{
    "abstract_sentences": {
        "1": "Deep Neural Networks (DNNs) have provably enhanced the state-of-the-art Neural Machine Translation (NMT) with their capability in modeling complex functions and capturing complex linguistic structures.", 
        "2": "However NMT systems with deep architecture in their encoder or decoder RNNs often suffer from severe gradient diffusion due to the non-linear recurrent activations, which often make the optimization much more difficult.", 
        "3": "To address this problem we propose novel linear associative units (LAU) to reduce the gradient propagation length inside the recurrent unit.", 
        "4": "Different from conventional approaches (LSTM unit and GRU), LAUs utilizes linear associative connections between input and output of the recurrent unit, which allows unimpeded information flow through both space and time direction.", 
        "5": "The model is quite simple, but it is surprisingly effective.", 
        "6": "Our empirical study on Chinese-English translation shows that our model with proper configuration can improve by 11.7 BLEU upon Groundhog and the best reported results in the same setting.", 
        "7": "On WMT14 English-German task and a larger WMT14 English-French task, our model achieves comparable results with the state-of-the-art."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 136–145 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1013  1 Introduction  Neural Machine Translation (NMT) is an endto-end learning approach to machine transla-\ntion which has recently shown promising results on multiple language pairs (Luong et al., 2015; Shen et al., 2015; Wu et al., 2016; Zhang et al., 2016; Tu et al., 2016; Zhang and Zong, 2016; Jean et al., 2015; Meng et al., 2015).", 
        "2": "Unlike conventional Statistical Machine Translation (SMT) systems (Koehn et al., 2003; Chiang, 2005; Liu et al., 2006; Xiong et al., 2006; Mi et al., 2008) which consist of multiple separately tuned components, NMT aims at building upon a single and large neural network to directly map input text to associated output text.", 
        "3": "Typical NMT models consists of two recurrent neural networks (RNNs), an encoder to read and encode the input text into a distributed representation and a decoder to generate translated text conditioned on the input representation (Sutskever et al., 2014; Bahdanau et al., 2014).", 
        "4": "Driven by the breakthrough achieved in computer vision (He et al., 2015; Srivastava et al., 2015), research in NMT has recently turned towards studying Deep Neural Networks (DNNs).", 
        "5": "Wu et al.", 
        "6": "(2016) and Zhou et al.", 
        "7": "(2016) found that deep architectures in both the encoder and decoder are essential for capturing subtle irregularities in the source and target languages.", 
        "8": "However, training a deep neural network is not as simple as stacking layers.", 
        "9": "Optimization often becomes increasingly difficult with more layers.", 
        "10": "One reasonable explanation is the notorious problem of vanishing/exploding gradients which was first studied in the context of vanilla RNNs (Pascanu et al., 2013b).", 
        "11": "Most prevalent approaches to solve this problem rely on short-cut connections between adjacent layers such as residual or fastforward connections (He et al., 2015; Srivastava et al., 2015; Zhou et al., 2016).", 
        "12": "Differ-\n136\nent from previous work, we choose to reduce the gradient path inside the recurrent units and propose a novel Linear Associative Unit (LAU) which creates a fusion of both linear and nonlinear transformations of the input.", 
        "13": "Through this design, information can flow across several steps both in time and in space with little attenuation.", 
        "14": "The mechanism makes it easy to train deep stack RNNs which can efficiently capture the complex inherent structures of sentences for NMT.", 
        "15": "Based on LAUs, we also propose a NMT model , called DEEPLAU, with deep architecture in both the encoder and decoder.", 
        "16": "Although DEEPLAU is fairly simple, it gives remarkable empirical results.", 
        "17": "On the NIST Chinese-English task, DEEPLAU with proper settings yields the best reported result and also a 4.9 BLEU improvement over a strong NMT baseline with most known techniques (e.g, dropout) incorporated.", 
        "18": "On WMT English-German and English-French tasks, it also achieves performance superior or comparable to the state-of-the-art.", 
        "19": "2 Neural machine translation  A typical neural machine translation system is a single and large neural network which directly models the conditional probability p(y|x) of translating a source sentence x = {x1, x2, · · · , xTx} to a target sentence y = {y1, y2, · · · , yTy}.", 
        "20": "Attention-based NMT, with RNNsearch as its most popular representative, generalizes the conventional notion of encoder-decoder in using an array of vectors to represent the source sentence and dynamically addressing the relevant segments of them during decoding.", 
        "21": "The process can be explicitly split into an encoding part, a decoding part and an attention mechanism.", 
        "22": "The model first encodes the source sentence x into a sequence of vectors c = {h1, h2, · · · , hTx}.", 
        "23": "In general, hi is the annotation of xi from a bi-directional RNN which contains information about the whole sentence with a strong focus on the parts of xi.", 
        "24": "Then, the RNNsearch model decodes and generates the target translation y based on the context c and the partial traslated sequence y<t by maximizing the probability of p(yi|y<i, c).", 
        "25": "In the atten-\ntion model, c is dynamically obtained according to the contribution of the source annotation made to the word prediction.", 
        "26": "This is called automatic alignment (Bahdanau et al., 2014) or attention mechanism (Luong et al., 2015), but it is essentially reading with content-based addressing defined in (Graves et al., 2014).", 
        "27": "With this addressing strategy the decoder can attend to the source representation that is most relevant to the stage of decoding.", 
        "28": "Deep neural models have recently achieved a great success in a wide range of problems.", 
        "29": "In computer vision, models with more than 100 convolutional layers have outperformed shallow ones by a big margin on a series of image tasks (He et al., 2015; Srivastava et al., 2015).", 
        "30": "Following similar ideas of building deep CNNs, some promising improvements have also been achieved on building deep NMT systems.", 
        "31": "Zhou et al.", 
        "32": "(2016) proposed a new type of linear connections between adjacent layers to simplify the training of deeply stacked RNNs.", 
        "33": "Similarly, Wu et al.", 
        "34": "(2016) introduced residual connections to their deep neural machine translation system and achieve great improvements.", 
        "35": "However the optimization of deep RNNs is still an open problem due to the massive recurrent computation which makes the gradient propagation path extremely tortuous.", 
        "36": "3 Model Description  In this section, we discuss Linear Associative Unit (LAU) to ease the training of deep stack of RNNs.", 
        "37": "Based on this idea, we further propose DEEPLAU, a neural machine translation model with a deep encoder and decoder.", 
        "38": "3.1 Recurrent Layers  A recurrent neural network (Williams and Zipser, 1989) is a class of neural network that has recurrent connections and a state (or its more sophisticated memory-like extension).", 
        "39": "The past information is built up through the recurrent connections.", 
        "40": "This makes RNN applicable for sequential prediction tasks of arbitrary length.", 
        "41": "Given a sequence of vectors x = {x1,x2, · · · ,xT } as input, a standard RNN computes the sequence hidden states h = {h1,h2, · · · ,hT } by iterating the following\nequation from t = 1 to t = T :\nht = φ(xt,ht−1) (1)\nφ is usually a nonlinear function such as composition of a logistic sigmoid with an affine transformation.", 
        "42": "3.2 Gated Recurrent Unit  It is difficult to train RNNs to capture longterm dependencies because the gradients tend to either vanish (most of the time) or explode.", 
        "43": "The effect of long-term dependencies is dropped exponentially with respect to the gradient propagation length.", 
        "44": "The problem was explored in depth by (Hochreiter and Schmidhuber, 1997; Pascanu et al., 2013b).", 
        "45": "A successful approach is to design a more sophisticated activation function than a usual activation function consisting of gating functions to control the information flow and reduce the propagation path.", 
        "46": "There is a long thread of work aiming to solve this problem, with the long short-term memory units (LSTM) being the most salient examples and gated recurrent unit (GRU) being the most recent one (Hochreiter and Schmidhuber, 1997; Cho et al., 2014).", 
        "47": "RNNs employing either of these recurrent units have been shown to perform well in tasks that require capturing long-term dependencies.", 
        "48": "GRU can be viewed as a slightly more dramatic variation on LSTM with fewer parameters.", 
        "49": "The activation function is armed with two specifically designed gates called update and reset gates to control the flow of information inside each hidden unit.", 
        "50": "Each hidden state at time-step t is computed as follows\nht = (1− zt) ht−1 + zt h̃t (2) where is an element-wise product, zt is the update gate, and h̃t is the candidate activation.", 
        "51": "h̃t = tanh(Wxhxt +Whh(rt ht−1)) (3) where rt is the reset gate.", 
        "52": "Both reset and update gates are computed as :\nrt = σ(Wxrxt +Whrht−1) (4)\nzt = σ(Wxzxt +Whzht−1) (5)\nThis procedure of taking a linear sum between the existing state and the newly computed state is similar to the LSTM unit.", 
        "53": "3.3 Linear Associative Unit  GRU can actually be viewed as a non-linear activation function with gating mechanism.", 
        "54": "Here we propose LAU which extends GRU by having an additional linear transformation of the input in its dynamics.", 
        "55": "More formally, the state update function becomes\nht =((1− zt) ht−1 + zt h̃t) (1− gt) + gt H(xt).", 
        "56": "(6)\nHere the updated ht has three sources: 1) the direct transfer from previous state ht−1, 2) the candidate update h̃t, and 3) a direct contribution from the input H(xt).", 
        "57": "More specifically, h̃t contains the nonlinear information of the input and the previous hidden state.", 
        "58": "h̃t = tanh(ft (Wxhxt)+rt (Whhht−1)), (7) where ft and rt express how much of the nonlinear abstraction are produced by the input xt and previous hidden state ht, respectively.", 
        "59": "For simplicity, we set ft = 1 − rt in this paper and find that this works well in our experiments.", 
        "60": "The term H(xt) is usually an affine linear transformation of the input xt to mach the dimensions of ht, where H(xt) = Wxxt.", 
        "61": "The associated term gt (the input gate) decides how much of the linear transformation of the input is carried to the hidden state and then the output.", 
        "62": "The gating function rt (reset gate) and zt (update gate) are computed following Equation (4) and (5) while gt is computed as\ngt = σ(Wxgxt +Whght−1).", 
        "63": "(8)\nThe term gt H(xt) therefore offers a direct way for input xt to go to later hidden layers, which can eventually lead to a path to the output layer when applied recursively.", 
        "64": "This mechanism is potentially very useful for translation where the input, no matter whether it is the source word or the attentive reading (context), should sometimes be directly carried to the next stage of processing without any substantial composition or nonlinear transformation.", 
        "65": "To understand this, imagine we want to translate a English sentence containing a relative rare entity name such as “Bahrain” to Chinese: LAU is potentially able to retain the embedding of this word in its hidden state, which\nwill otherwise be prone to serious distortion due to the scarcity of training instances for it.", 
        "66": "3.4 DEEPLAU\nGraves et al.", 
        "67": "(2013) explored the advantages of deep RNNs for handwriting recognition and text generation.", 
        "68": "There are multiple ways of combining one layer of RNN with another.", 
        "69": "Pascanu et al.", 
        "70": "(2013a) introduced Deep Transition RNNs with Skip connections (DT(S)RNNs).", 
        "71": "Kalchbrenner et al.", 
        "72": "(2015) proposed to make a full connection of all the RNN hidden layers.", 
        "73": "In this work we employ vertical stacking where only the output of the previous layer of RNN is fed to the current layer as input.", 
        "74": "The input at recurrent layer ` (denoted as x`t) is exactly the output of the same time step at layer ` − 1 (denoted as h`−1t ).", 
        "75": "Additionally, in order to learn more temporal dependencies, the sequences can be processed in different directions.", 
        "76": "More formally, given an input sequence x = (x1, ...,xT ), the output on layer ` is\nh (`) t =\n{ xt, ` = 1\nφ`(h (`) t+d,h (`−1) t ), ` > 1\n(9)\nwhere\n• h(`)t gives the output of layer ` at location t.\n• φ is a recurrent function and we choose LAUs in this work.", 
        "77": "• The directions are marked by a direction term d ∈ {−1, 1}.", 
        "78": "If we fixed d to −1, the input will be processed in forward direction, otherwise backward direction.", 
        "79": "The deep architecture of DEEPLAU, as shown in Figure 1, consists of three parts: a stacked LAU-based encoder, a stacked LAUbased decoder and an improved attention model.", 
        "80": "Encoder One shortcoming of conventional RNNs is that they are only able to make use of previous context.", 
        "81": "In machine translation, where whole source utterances are transcribed at once, there is no reason not to exploit future context as well.", 
        "82": "Thus bi-directional RNNs are proposed to integrate information from the past and the future.", 
        "83": "The typical bidirectional approach processes the raw input in backward and forward direction with two separate layers, and then concatenates them together.", 
        "84": "Following Zhou et al.", 
        "85": "(2016), we choose another bidirectional approach to process the sequence in order to learn more temporal dependencies in this work.", 
        "86": "Specifically, an RNN layer processes the input sequence in forward direction.", 
        "87": "The output of this layer is taken by an upper RNN layer as input, processed in reverse direction.", 
        "88": "Formally, following Equation (9), we set d = (−1)`.", 
        "89": "This approach can easily build a deeper network with the same number of parameters compared to the classical approach.", 
        "90": "The final encoder consists of Lenc layers and produces the output hLenc to compute the conditional input c to the decoder.", 
        "91": "Attention Model The alignment model αt,j scores how well the output at position t matches the inputs around position j based on s1t−1 and h Lenc j where h Lenc j is the top-most layer of the encoder at step j and s1t−1 is the first layer of decoder at step t − 1.", 
        "92": "It is intuitively beneficial to exploit the information of yt−1 when reading from the source sentence representation, which is missing from the implementation of attention-based NMT in (Bahdanau et al., 2014).", 
        "93": "In this work, we build a more effective alignment path by feeding both the previous hidden state s1t−1 and the context word yt−1 to the attention model, inspired by the recent implementation of attention-based\nNMT1.", 
        "94": "The conditional input cj is a weighted sum of attention score αt,j and encoder output hLenc .", 
        "95": "Formally, the calculation of cj is\ncj =\nt=Lx∑\nt=1\nαt,jh Lenc t (10)\nwhere\net,j = v T a σ(Was 1 t−1 +Uah Lenc j +Wyyt−1)\nαt,j = softmax(et,j).", 
        "96": "(11) σ is a nonlinear function with the information of yt−1 (its word embedding being yt−1) added.", 
        "97": "In our preliminary experiments, we found that GRU works slightly better than tanh function, but we chose the latter for simplicity.", 
        "98": "Decoder The decoder follows Equation (9) with fixed direction term d = −1.", 
        "99": "At the first layer, we use the following input:\nxt = [ct,yt−1]\nwhere yt−1 is the target word embedding at time step t, ct is dynamically obtained follows Equation (10).", 
        "100": "There are Ldec layers of RNNs armed with LAUs in the decoder.", 
        "101": "At inference stage, we only utilize the top-most hidden states sLdec to make the final prediction with a softmax layer:\np(yi|y<i,x) = softmax(WosLdeci ) (12) .", 
        "102": "4 Experiments    4.1 Setup  We mainly evaluated our approaches on the widely used NIST Chinese-English translation task.", 
        "103": "In order to show the usefulness of our approaches, we also provide results on other two translation tasks: English-French, EnglishGerman.", 
        "104": "The evaluation metric is BLEU2 (Papineni et al., 2002).", 
        "105": "For Chinese-English, our training data consists of 1.25M sentence pairs extracted from\n1github.com/nyu-dl/dl4mt-tutorial/ tree/master/session2\n2 For Chinese-English task, we apply case-insensitive NIST BLEU.", 
        "106": "For other tasks, we tokenized the reference and evaluated the performance with multi-bleu.pl.", 
        "107": "The metrics are exactly the same as in previous work.", 
        "108": "LDC corpora3, with 27.9M Chinese words and 34.5M English words respectively.", 
        "109": "We choose NIST 2002 (MT02) dataset as our development set, and the NIST 2003 (MT03), 2004 (MT04) 2005 (MT05) and 2006 (MT06) datasets as our test sets.", 
        "110": "For English-German, to compare with the results reported by previous work (Luong et al., 2015; Zhou et al., 2016; Jean et al., 2015), we used the same subset of the WMT 2014 training corpus that contains 4.5M sentence pairs with 91M English words and 87M German words.", 
        "111": "The concatenation of news-test 2012 and news-test 2013 is used as the validation set and news-test 2014 as the test set.", 
        "112": "To evaluate at scale, we also report the results of English-French.", 
        "113": "To compare with the results reported by previous work on end-toend NMT (Sutskever et al., 2014; Bahdanau et al., 2014; Jean et al., 2015; Luong et al., 2014; Zhou et al., 2016), we used the same subset of the WMT 2014 training corpus that contains 12M sentence pairs with 304M English words and 348M French words.", 
        "114": "The concatenation of news-test 2012 and news-test 2013 serves as the validation set and news-test 2014 as the test set.", 
        "115": "4.2 Training details  Our training procedure and hyper parameter choices are similar to those used by (Bahdanau et al., 2014).", 
        "116": "In more details, we limit the source and target vocabularies to the most frequent 30K words in both Chinese-English and English-French.", 
        "117": "For English-German, we set the source and target vocabularies size to 120K and 80K, respectively.", 
        "118": "For all experiments, the dimensions of word embeddings and recurrent hidden states are both set to 512.", 
        "119": "The dimension of ct is also of size 512.", 
        "120": "Note that our network is more narrow than most previous work where hidden states of dimmention 1024 is used.", 
        "121": "we initialize parameters by sampling each element from the Gaussian distribution with mean 0 and variance 0.042.", 
        "122": "Parameter optimization is performed using stochastic gradient descent.", 
        "123": "Adadelta (Zeiler,\n3The corpora include LDC2002E18, LDC2003E07, LDC2003E14, Hansards portion of LDC2004T07, LDC2004T08 and LDC2005T06.", 
        "124": "2012) is used to automatically adapt the learning rate of each parameter ( = 10−6 and ρ = 0.95).", 
        "125": "To avoid gradient explosion, the gradients of the cost function which had `2 norm larger than a predefined threshold τ were normalized to the threshold (Pascanu et al., 2013a).", 
        "126": "We set τ to 1.0 at the beginning and halve the threshold until the BLEU score does not change much on the development set.", 
        "127": "Each SGD is a mini-batch of 128 examples.", 
        "128": "We train our NMT model with the sentences of length up to 80 words in the training data, while for the Moses system we use the full training data.", 
        "129": "Translations are generated by a beam search and log-likelihood scores are normalized by sentence length.", 
        "130": "We use a beam width of 10 in all the experiments.", 
        "131": "Dropout was also applied on the output layer to avoid over-fitting.", 
        "132": "The dropout rate is set to 0.5.", 
        "133": "Except when otherwise mentioned, NMT systems are have 4 layers encoders and 4 layers decoders.", 
        "134": "4.3 Results on Chinese-English Translation  Table 1 shows BLEU scores on ChineseEnglish datasets.", 
        "135": "Clearly DEEPLAU leads to a remarkable improvement over their competitors.", 
        "136": "Compared to DEEPGRU, DEEPLAU is +4.89 BLEU score higher on average four test sets, showing the modeling power gained from the liner associative connections.", 
        "137": "We suggest it is because LAUs apply adaptive gate function conditioned on the input which make it able to automatically decide how much linear information should be transferred to the next step.", 
        "138": "To show the power of DEEPLAU, we also make a comparison with previous work.", 
        "139": "Our\nbest single model outperforms both a phrasedbased MT system (Moses) as well as an open source attention-based NMT system (Groundhog) by +7.3 and +6.8 BLEU points respectively on average.", 
        "140": "The result is also better than some other state-of-the-art variants of attention-based NMT mode with big margins.", 
        "141": "After PosUnk and ensemble, DEEPLAU seizes another notable gain of +4.38 BLEU and outperform Moses by +11.68 BLEU.", 
        "142": "4.4 Results on English-German Translation  The results on English-German translation are presented in Table 2.", 
        "143": "We compare our NMT systems with various other systems including the winning system in WMT14 (Buck et al., 2014), a phrase-based system whose language models were trained on a huge monolingual text, the Common Crawl corpus.", 
        "144": "For end-toend NMT systems, to the best of our knowledge, Wu et al.", 
        "145": "(2016) is currently the SOTA system and about 4 BLEU points on top of previously best reported results even though Zhou et al.", 
        "146": "(2016) used a much deeper neural network4.", 
        "147": "Following Wu et al.", 
        "148": "(2016), the BLEU score represents the averaged score of 8 models we trained.", 
        "149": "Our approach achieves comparable results with SOTA system.", 
        "150": "As can be seen from the Table 2, DeepLAU performs better than the word based model and even not much worse than the best wordpiece models achieved by Wu et al.", 
        "151": "(2016).", 
        "152": "Note that DEEPLAU are sim-\n4It is also worth mentioning that the result reported by Zhou et al.", 
        "153": "(2016) does not include PosUnk, and this comparison is not fair enough.", 
        "154": "ple and easy to implement, as opposed to previous models reported in Wu et al.", 
        "155": "(2016), which dependends on some external techniques to achieve their best performance, such as their introduction of length normalization, coverage penalty, fine-tuning and the RL-refined model.", 
        "156": "4.5 Results on English-French Translation  To evaluate at scale, we also show the results on an English-French task with 12M sentence pairs and 30K vocabulary in Table 3.", 
        "157": "Luong et al.", 
        "158": "(2014) achieves BLEU score of 30.4 with a six layers deep Encoder-Decoder model.", 
        "159": "The two attention models, RNNSearch and RNNsearch-LV achieve BLEU scores of 28.5 and 32.7 respectively.", 
        "160": "The previous best single NMT Deep-Att model with an 18 layers encoder and 7 layers decoder achieves BLEU score of 35.9.", 
        "161": "For DEEPLAU, we obtain the BLEU score of 35.1 with a 4 layers encoder and 4 layers decoder, which is on par with the SOTA system in terms of BLEU.", 
        "162": "Note that\nZhou et al.", 
        "163": "(2016) utilize a much larger depth as well as external alignment model and extensive regularization to achieve their best results.", 
        "164": "4.6 Analysis  Then we will study the main factors that influence our results on NIST Chinese-English translation task.", 
        "165": "We also compare our approach with two SOTA topologies which were used in building deep NMT systems.", 
        "166": "• Residual Networks (ResNet) are among the pioneering works (Szegedy et al., 2016; He et al., 2016) that utilize extra identity connections to enhance information flow such that very deep neural networks can be effectively optimized.", 
        "167": "Share the similar idea, Wu et al.", 
        "168": "(2016) introduced to leverage residual connections to train deep RNNs.", 
        "169": "• Fast Forward (F-F) connections were proposed to reduce the propagation path length which is the pioneer work to simplify the training of deep NMT model (Zhou et al., 2016).", 
        "170": "The work can be viewed as a parametric ResNet with short cut connections between adjacent layers.", 
        "171": "The procedure takes a linear sum between the input and the newly computed state.", 
        "172": "LAU vs. GRU Table 4 shows the effect of the novel LAU.", 
        "173": "By comparing row 3 to row 7, we see that when LEnc and LDec are set to 2,\nthe average BLEU scores achieved by DEEPGRU and DEEPLAU are 34.68 and 37.65, respectively.", 
        "174": "LAU can bring an improvement of 2.97 in terms of BLEU.", 
        "175": "After increasing the model depth to 4 (row 4 and row 6), the improvement is enlarged to 4.91.", 
        "176": "When DEEPGRU is trained with larger depth (say, 4), the training becomes more difficult and the performance falls behind its shallow partner.", 
        "177": "While for DEEPLAU, as can be see in row 9, with increasing the depth even to LEnc = 8 and LDec = 6 we can still obtain growth by 0.04 BLEU score.", 
        "178": "Compared to previous shortcut connection methods (row 5 and row 6), The LAU still achieve meaningful improvements over F-F connections and Residual connections by +1.35 and +2.57 BLEU points respectively.", 
        "179": "DEEPLAU introduces more parameters than DEEPGRU.", 
        "180": "In order to figure out the effect of DEEPLAU comparing models with the same parameter size, we increase the hidden size of DEEPGRU model.", 
        "181": "Row 3 shows that, after using a twice larger GRU layer, the BLEU score is 34.68, which is still worse than the corresponding DEEPLAU model with fewer parameters.", 
        "182": "Depth vs. Width Next we will study the model size.", 
        "183": "In Table 4, starting from LEnc = 2 and LDec = 2 and gradually increasing the model depth, we can achieve substantial improvements in terms of BLEU.", 
        "184": "With LEnc = 8 and LDec = 6, our DEEPLAU model yields the best BLEU score.", 
        "185": "We tried to increase\nthe model depth with the same hidden size but failed to see further improvements.", 
        "186": "We then tried to increase the hidden size.", 
        "187": "By comparing row 2 and row 3, we find the improvements is relative small with a wider hidden size.", 
        "188": "It is also worth mentioning that a deep and thin network with fewer parameters can still achieve comparable results with its shallow partner.", 
        "189": "This suggests that depth plays a more important role in increasing the complexity of neural networks than width and our deliberately designed LAU benefit from the optimizing of such a deep model.", 
        "190": "About Length A more detailed comparison between DEEPLAU (4 layers encoder and 4 layers decoder), DEEPLAU(2 layer encoder and 2 layer decoder) and DEEPGRU (4 layers encoder and 4 layers decoder), suggest that with deep architectures are essential to the superior performance of our system.", 
        "191": "In particular, we test the BLEU scores on sentences longer than {10, 20, 30, 40, 50, 60} on the merged test set.", 
        "192": "Clearly, in all curves, performance degrades with increased sentence length.", 
        "193": "However, DEEPLAU models yield consistently higher BLEU scores than the DEEPGRU model on longer sentences.", 
        "194": "These observations are consistent with our intuition that very deep RNN model is especially good at modeling the nested latent structures on relatively complicated sentences and LAU plays an important role on optimizing such a complex deep model.", 
        "195": "5 Conclusion  We propose a Linear Associative Unit (LAU) which makes a fusion of both linear and nonlinear transformation inside the recurrent unit.", 
        "196": "On this way, gradients decay much slower compared to the standard deep networks which enable us to build a deep neural network for machine translation.", 
        "197": "Our empirical study shows that it can significantly improve the performance of NMT.", 
        "198": "6 acknowledge  We sincerely thank the anonymous reviewers for their thorough reviewing and valuable suggestions.", 
        "199": "Wang’s work is partially supported by National Science Foundation for Deep Semantics Based Uighur to Chinese Machine Translation (ID 61662077).", 
        "200": "Qun Liu’s work is partially supported by Science Foundation Ireland in the ADAPT Centre for Digital Content Technology (www.adaptcentre.ie) at Dublin City University funded under the SFI Research Centres Programme (Grant 13/RC/2106) cofunded under the European Regional Development Fund."
    }, 
    "document_id": "P17-1013.pdf.json"
}
