{
    "abstract_sentences": {
        "1": "This paper deals with sentence-level sentiment classification.", 
        "2": "Though a variety of neural network models have been proposed recently, however, previous models either depend on expensive phrase-level annotation, most of which has remarkably degraded performance when trained with only sentence-level annotation; or do not fully employ linguistic resources (e.g., sentiment lexicons, negation words, intensity words).", 
        "3": "In this paper, we propose simple models trained with sentence-level annotation, but also attempt to model the linguistic role of sentiment lexicons, negation words, and intensity words.", 
        "4": "Results show that our models are able to capture the linguistic role of sentiment words, negation words, and intensity words in sentiment expression."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1679–1689 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1154  1 Introduction  Sentiment classification aims to classify text to sentiment classes such as positive or negative, or more fine-grained classes such as very positive, positive, neutral, etc.", 
        "2": "There has been a variety of approaches for this purpose such as lexicon-based classification (Turney, 2002; Taboada et al., 2011), and early machine learning based methods (Pang et al., 2002; Pang and Lee, 2005), and recently neural network models such as convolutional neural network (CNN) (Kim, 2014; Kalchbrenner et al., 2014; Lei et al., 2015), recursive autoencoders (Socher et al., 2011, 2013), Long ShortTerm Memory (LSTM) (Mikolov, 2012; Chung et al., 2014; Tai et al., 2015; Zhu et al., 2015), and many more.", 
        "3": "∗Corresponding Author: Minlie Huang\nIn spite of the great success of these neural models, there are some defects in previous studies.", 
        "4": "First, tree-structured models such as recursive autoencoders and Tree-LSTM (Tai et al., 2015; Zhu et al., 2015), depend on parsing tree structures and expensive phrase-level annotation, whose performance drops substantially when only trained with sentence-level annotation.", 
        "5": "Second, linguistic knowledge such as sentiment lexicon, negation words or negators (e.g., not, never), and intensity words or intensifiers (e.g., very, absolutely), has not been fully employed in neural models.", 
        "6": "The goal of this research is to developing simple sequence models but also attempts to fully employing linguistic resources to benefit sentiment classification.", 
        "7": "Firstly, we attempts to develop simple models that do not depend on parsing trees and do not require phrase-level annotation which is too expensive in real-world applications.", 
        "8": "Secondly, in order to obtain competitive performance, simple models can benefit from linguistic resources.", 
        "9": "Three types of resources will be addressed in this paper: sentiment lexicon, negation words, and intensity words.", 
        "10": "Sentiment lexicon offers the prior polarity of a word which can be useful in determining the sentiment polarity of longer texts such as phrases and sentences.", 
        "11": "Negators are typical sentiment shifters (Zhu et al., 2014), which constantly change the polarity of sentiment expression.", 
        "12": "Intensifiers change the valence degree of the modified text, which is important for fine-grained sentiment classification.", 
        "13": "In order to model the linguistic role of sentiment, negation, and intensity words, our central idea is to regularize the difference between the predicted sentiment distribution of the current position 1, and that of the previous or next positions, in a sequence model.", 
        "14": "For instance, if the cur-\n1Note that in sequence models, the hidden state of the current position also encodes forward or backward contexts.", 
        "15": "1679\nrent position is a negator not, the negator should change the sentiment distribution of the next position accordingly.", 
        "16": "To summarize, our contributions lie in two folds:\n• We discover that modeling the linguistic role of sentiment, negation, and intensity words can enhance sentence-level sentiment classification.", 
        "17": "We address the issue by imposing linguistic-inspired regularizers on sequence LSTM models.", 
        "18": "• Unlike previous models that depend on parsing structures and expensive phrase-level annotation, our models are simple and efficient, but the performance is on a par with the stateof-the-art.", 
        "19": "The rest of the paper is organized as follows: In the following section, we survey related work.", 
        "20": "In Section 3, we briefly introduce the background of LSTM and bidirectional LSTM, and then describe in detail the lingistic regularizers for sentiment/negation/intensity words in Section 4.", 
        "21": "Experiments are presented in Section 5, and Conclusion follows in Section 6.", 
        "22": "2 Related Work    2.1 Neural Networks for Sentiment Classification  There are many neural networks proposed for sentiment classification.", 
        "23": "The most noticeable models may be the recursive autoencoder neural network which builds the representation of a sentence from subphrases recursively (Socher et al., 2011, 2013; Dong et al., 2014; Qian et al., 2015).", 
        "24": "Such recursive models usually depend on a tree structure of input text, and in order to obtain competitive results, usually require annotation of all subphrases.", 
        "25": "Sequence models, for instance, convolutional neural network (CNN), do not require tree-structured data, which are widely adopted for sentiment classification (Kim, 2014; Kalchbrenner et al., 2014; Lei et al., 2015).", 
        "26": "Long short-term memory models are also common for learning sentence-level representation due to its capability of modeling the prefix or suffix context (Hochreiter and Schmidhuber, 1997).", 
        "27": "LSTM can be commonly applied to sequential data but also tree-structured data (Zhu et al., 2015; Tai et al., 2015).", 
        "28": "2.2 Applying Linguistic Knowledge for Sentiment Classification  Linguistic knowledge and sentiment resources, such as sentiment lexicons, negation words (not, never, neither, etc.)", 
        "29": "or negators, and intensity words (very, extremely, etc.)", 
        "30": "or intensifiers, are useful for sentiment analysis in general.", 
        "31": "Sentiment lexicon (Hu and Liu, 2004; Wilson et al., 2005) usually defines prior polarity of a lexical entry, and is valuable for lexicon-based models (Turney, 2002; Taboada et al., 2011), and machine learning approaches (Pang and Lee, 2008).", 
        "32": "There are recent works for automatic construction of sentiment lexicons from social data (Vo and Zhang, 2016) and for multiple languages (Chen and Skiena, 2014).", 
        "33": "A noticeable work that ultilizes sentiment lexicons can be seen in (Teng et al., 2016) which treats the sentiment score of a sentence as a weighted sum of prior sentiment scores of negation words and sentiment words, where the weights are learned by a neural network.", 
        "34": "Negation words play a critical role in modifying sentiment of textual expressions.", 
        "35": "Some early negation models adopt the reversing assumption that a negator reverses the sign of the sentiment value of the modified text (Polanyi and Zaenen, 2006; Kennedy and Inkpen, 2006).", 
        "36": "The shifting hyothesis assumes that negators change the sentiment values by a constant amount (Taboada et al., 2011; Liu and Seneff, 2009).", 
        "37": "Since each negator can affect the modified text in different ways, the constant amount can be extended to be negatorspecific (Zhu et al., 2014), and further, the effect of negators could also depend on the syntax and semantics of the modified text (Zhu et al., 2014).", 
        "38": "Other approaches to negation modeling can be seen in (Jia et al., 2009; Wiegand et al., 2010; Benamara et al., 2012; Lapponi et al., 2012).", 
        "39": "Sentiment intensity of a phrase indicates the strength of associated sentiment, which is quite important for fine-grained sentiment classification or rating.", 
        "40": "Intensity words can change the valence degree (i.e., sentiment intensity) of the modified text.", 
        "41": "In (Wei et al., 2011) the authors propose a linear regression model to predict the valence value for content words.", 
        "42": "In (Malandrakis et al., 2013), a kernel-based model is proposed to combine semantic information for predicting sentiment score.", 
        "43": "In the SemEval-2016 task 7 subtask A, a learningto-rank model with a pair-wise strategy is proposed to predict sentiment intensity scores (Wang\net al., 2016).", 
        "44": "Linguistic intensity is not limited to sentiment or intensity words, and there are works that assign low/medium/high intensity scales to adjectives such as okay, good, great (Sharma et al., 2015) or to gradable terms (e.g.", 
        "45": "large, huge, gigantic) (Shivade et al., 2015).", 
        "46": "In (Dong et al., 2015), a sentiment parser is proposed, and the authors studied how sentiment changes when a phrase is modified by negators or intensifiers.", 
        "47": "Applying linguistic regularization to text classification can be seen in (Yogatama and Smith, 2014) which introduces three linguistically motivated structured regularizers based on parse trees, topics, and hierarchical word clusters for text categorization.", 
        "48": "Our work differs in that (Yogatama and Smith, 2014) applies group lasso regularizers to logistic regression on model parameters while our regularizers are applied on intermediate outputs with KL divergence.", 
        "49": "3 Long Short-term Memory Network    3.1 Long Short-Term Memory (LSTM)  Long Short-Term Memory has been widely adopted for text processing.", 
        "50": "Briefly speaking, in LSTM, the hidden states ht and memory cell ct is a function of their previous ct−1 and ht−1 and input vector xt, or formally as follows:\nct, ht = g (LSTM)(ct−1, ht−1, xt) (1)\nThe hidden state ht ∈ Rd denotes the representation of position t while also encoding the preceding contexts of the position.", 
        "51": "For more details about LSTM, we refer readers to (Hochreiter and Schmidhuber, 1997).", 
        "52": "3.2 Bidirectional LSTM  In LSTM, the hidden state of each position (ht) only encodes the prefix context in a forward direction while the backward context is not considered.", 
        "53": "Bidirectional LSTM (Graves et al., 2013) exploited two parallel passes (forward and backward) and concatenated hidden states of the two LSTMs as the representation of each position.", 
        "54": "The forward and backward LSTMs are respectively formulated as follows:\n−→c t, −→ h t = g (LSTM)(−→c t−1, −→ h t−1, xt) (2)\n←−c t, ←− h t = g (LSTM)(←−c t+1, ←− h t+1, xt) (3)\nwhere g(LSTM) is the same as that in Eq (1).", 
        "55": "Particularly, parameters in the two LSTMs are shared.", 
        "56": "The representation of the entire sentence is [ −→ h n, ←− h 1], where n is the length of the sentence.", 
        "57": "At each position t, the new representation is ht = [ −→ h t, ←− h t], which is the concatenation of hidden states of the forward LSTM and backward LSTM.", 
        "58": "In this way, the forward and backward contexts can be considered simultaneously.", 
        "59": "4 Linguistically Regularized LSTM  The central idea of the paper is to model the linguistic role of sentiment, negation, and intensity words in sentence-level sentiment classification by regularizing the outputs at adjacent positions of a sentence.", 
        "60": "For example in Fig 1, in sentence “It’s not an interesting movie”, the predicted sentiment distributions at “*an interesting movie2” and “*interesting movie” should be close to each other, while the predicted sentiment distribution at “*interesting movie” should be quite different from the preceding positions (in the backward direction) (“*movie”) since a sentiment word (“interesting”) is seen.", 
        "61": "We propose a generic regularizer and three special regularizers based on the following linguistic observations:\n• Non-Sentiment Regularizer: if the two adjacent positions are all non-opinion words, the sentiment distributions of the two positions should be close to each other.", 
        "62": "Though\n2The asterisk denotes the current position.", 
        "63": "this is not always true (e.g., soap movie), this assumption holds at most cases.", 
        "64": "• Sentiment Regularizer: if the word is a sentiment word found in a lexicon, the sentiment distribution of the current position should be significantly different from that of the next or previous positions.", 
        "65": "We approach this phenomenon with a sentiment class specific shifting distribution.", 
        "66": "• Negation Regularizer: Negation words such as “not” and “never” are critical sentiment shifter or converter: in general they shift sentiment polarity from the positive end to the negative end, but sometimes depend on the negation word and the words they modify.", 
        "67": "The negation regularizer models this linguistic phenomena with a negator-specific transformation matrix.", 
        "68": "• Intensity Regularizer: Intensity words such as “very” and “extremely” change the valence degree of a sentiment expression: for instance, from positive to very positive.", 
        "69": "Modeling this effect is quite important for finegrained sentiment classification, and the intensity regularizer is designed to formulate this effect by a word-specific transformation matrix.", 
        "70": "More formally, the predicted sentiment distribution (pt, based on ht, see Eq.", 
        "71": "5) at position t should be linguistically regularized with respect to that of the preceding (t − 1) or following (t + 1) positions.", 
        "72": "In order to enforce the model to produce coherent predictions, we plug a new loss term into the original cross entropy loss: L(θ) = − ∑\ni\nŷi log yi + α ∑\ni\n∑\nt\nLt,i + β||θ||2\n(4) where ŷi is the gold distribution for sentence i, yi is the predicted distribution, Lt,i is one of the above regularizers or combination of these regularizers on sentence i, α is the weight for the regularization term, and t is the word position in a sentence.", 
        "73": "Note that we do not consider the modification span of negation and intensity words to preserve the simplicity of the proposed models.", 
        "74": "Negation scope resolution is another complex problem which has been extensively studied (Zou et al., 2013; Packard et al., 2014; Fancellu et al., 2016),\nwhich is beyond the scope of this work.", 
        "75": "Instead, we resort to sequence LSTMs for encoding surrounding contexts at a given position.", 
        "76": "4.1 Non-Sentiment Regularizer (NSR)  This regularizer constrains that the sentiment distributions of adjacent positions should not vary much if the additional input word xt is not a sentiment word, formally as follows:\nL (NSR) t = max(0, DKL(pt||pt−1)−M) (5)\nwhereM is a hyperparameter for margin, pt is the predicted distribution at state of position t, (i.e., ht), andDKL(p||q) is a symmetric KL divergence defined as follows:\nDKL(p||q) = 1\n2\nC∑\nl=1\np(l) log q(l) + q(l) log p(l)\n(6) where p, q are distributions over sentiment labels l and C is the number of labels.", 
        "77": "4.2 Sentiment Regularizer (SR)  The sentiment regularizer constrains that the sentiment distributions of adjacent positions should drift accordingly if the input word is a sentiment word.", 
        "78": "Let’s revisit the example “It’s not an interesting movie” again.", 
        "79": "At position t = 2 (in the backward direction) we see a positive word “interesting” so the predicted distribution would be more positive than that at position t = 1 (movie).", 
        "80": "This is the issue of sentiment drift.", 
        "81": "In order to address the sentiment drift issue, we propose a polarity shifting distribution sc ∈ RC for each sentiment class defined in a lexicon.", 
        "82": "For instance, a sentiment lexicon may have class labels like strong positive, weakly positive, weakly negative, and strong negative, and for each class, there is a shifting distribution which will be learned by the model.", 
        "83": "The sentiment regularizer states that if the current word is a sentiment word, the sentiment distribution drift should be observed in comparison to the previous position, in more details:\np (SR) t−1 = pt−1 + sc(xt) (7)\nL (SR) t = max(0, DKL(pt||p (SR) t−1 )−M) (8)\nwhere p(SR)t−1 is the drifted sentiment distribution after considering the shifting sentiment distribution corresponding to the state at position t, c(xt)\nis the prior sentiment class of word xt, and sc ∈ θ is a parameter to be optimized but could also be set fixed with prior knowledge.", 
        "84": "Note that in this way all words of the same sentiment class share the same drifting distribution, but in a refined setting, we can learn a shifting distribution for each sentiment word if large-scale datasets are available.", 
        "85": "4.3 Negation Regularizer (NR)  The negation regularizer approaches how negation words shift the sentiment distribution of the modified text.", 
        "86": "When the input xt is a negation word, the sentiment distribution should be shifted/reversed accordingly.", 
        "87": "However, the negation role is more complex than that by sentiment words, for example, the word “not” in “not good” and “not bad” have different roles in polarity change.", 
        "88": "The former changes the polarity to negative, while the latter changes to neutral instead of positive.", 
        "89": "To respect such complex negation effects, we propose a transformation matrix Tm ∈ RC×C for each negation word m, and the matrix will be learned by the model.", 
        "90": "The regularizer assumes that if the current position is a negation word, the sentiment distribution of the current position should be close to that of the next or previous position with the transformation.", 
        "91": "p (NR) t−1 = softmax(Txj × pt−1) (9)\np (NR) t+1 = softmax(Txj × pt+1) (10)\nL (NR) t = min { max(0, DKL(pt||p(NR)t−1 )−M) max(0, DKL(pt||p(NR)t+1 )−M) (11) where p(NR)t−1 and p (NR) t+1 is the sentiment distuibution after transformation, Txj ∈ θ is the transformation matrix for a negation word xj , a parameter to be learned during training.", 
        "92": "In total, we train m transformation matrixs for m negation words.", 
        "93": "Such negator-specific transformation is in accordance with the finding that each negator has its individual negation effect (Zhu et al., 2014).", 
        "94": "4.4 Intensity Regularizer (IR)  Sentiment intensity of a phrase indicates the strength of associated sentiment, which is quite important for fine-grained sentiment classification or rating.", 
        "95": "Intensifier can change the valence degree of the content word.", 
        "96": "The intensity regularizer\nmodels how intensity words influence the sentiment valence of a phrase or a sentence.", 
        "97": "The formulation of the intensity effect is quite the same as that in the negation regularizer, but with different parameters of course.", 
        "98": "For each intensity word, there is a transform matrix to favor the different roles of various intensifiers on sentiment drift.", 
        "99": "For brevity, we will not repeat the formulas here.", 
        "100": "4.5 Applying Linguistic Regularizers to Bidirectional LSTM  To preserve the simplicity of our proposals, we do not consider the modification span of negation and intensity words, which is a quite challenging problem in the NLP community (Zou et al., 2013; Packard et al., 2014; Fancellu et al., 2016).", 
        "101": "However, we can alleviate the problem by leveraging bidirectional LSTM.", 
        "102": "For a single LSTM, we employ a backward LSTM from the end to the beginning of a sentence.", 
        "103": "This is because, at most times, the modified words of negation and intensity words are usually at the right side of the modified text.", 
        "104": "But sometimes, the modified words are at the left side of negation and intensity words.", 
        "105": "To better address this issue, we employ bidirectional LSTM and let the model determine which side should be chosen.", 
        "106": "More formally, in Bi-LSTM, we compute a transformed sentiment distribution on−→p t−1 of the forward LSTM and also that on←−p t+1 of the backward LSTM, and compute the minimum distance of the distribution of the current position to the two distributions.", 
        "107": "This could be formulated as follows:\n−→p (R)t−1 = softmax(Txj ×−→p t−1) (12)\n←−p (R)t+1 = softmax(Txj ×←−p t+1) (13)\nL (R) t = min\n{ max(0, DKL(\n−→p t||−→p (R)t−1)−M) max(0, DKL(\n←−p t||←−p (R)t+1)−M) (14)\nwhere −→p (R)t−1 and←−p (R) t+1 are the sentiment distributions transformed from the previous distribution −→p t−1 and next distribution ←−p t+1 respectively.", 
        "108": "Note that R ∈ {NR, IR} indicating the formulation works for both negation and intensity regularizers.", 
        "109": "Due to the same consideration, we redefine L\n(NSR) t and L (SR) t with bidirectional LSTM similarly.", 
        "110": "The formulation is the same and omitted for brevity.", 
        "111": "4.6 Discussion  Our models address these linguistic factors with mathematical operations, parameterized with shifting distribution vectors or transformation matrices.", 
        "112": "In the sentiment regularizer, the sentiment shifting effect is parameterized with a classspecific distribution (but could also be wordspecific if with more data).", 
        "113": "In the negation and intensity regularizers, the effect is parameterized with word-specific transformation matrices.", 
        "114": "This is to respect the fact that the mechanism of how negation and intensity words shift sentiment expression is quite complex and highly dependent on individual words.", 
        "115": "Negation/Intensity effect also depends on the syntax and semantics of the modified text, however, for simplicity we resort to sequence LSTM for encoding surrounding contexts in this paper.", 
        "116": "We partially address the modification scope issue by applying the minimization operator in Eq.", 
        "117": "11 and Eq.", 
        "118": "14, and the bidirectional LSTM.", 
        "119": "5 Experiment    5.1 Dataset and Sentiment Lexicon  Two datasets are used for evaluating the proposed models: Movie Review (MR) (Pang and Lee, 2005) where each sentence is annotated with two classes as negative, positive and Stanford Sentiment Treebank (SST) (Socher et al., 2013) with five classes { very negative, negative, neutral, positive, very positive}.", 
        "120": "Note that SST has provided phrase-level annotation on all inner nodes, but we only use the sentence-level annotation since one of our goals is to avoid expensive phrase-level annotation.", 
        "121": "The sentiment lexicon contains two parts.", 
        "122": "The first part comes fromMPQA (Wilson et al., 2005), which contains 5, 153 sentiment words, each with polarity rating.", 
        "123": "The second part consists of the leaf nodes of the SST dataset (i.e., all sentiment words) and there are 6, 886 polar words except neural ones.", 
        "124": "We combine the two parts and ignore those words that have conflicting sentiment labels, and produce a lexicon of 9, 750words with 4 sentiment labels.", 
        "125": "For negation and intensity words, we collect them manually since the number is small, some of which can be seen in Table 2.", 
        "126": "5.2 The Details of Experiment Setting  In order to let others reproduce our results, we present all the details of our models.", 
        "127": "We adopt Glove vectors (Pennington et al., 2014) as the initial setting of word embeddings V .", 
        "128": "The shifting vector for each sentiment class (sc), and the transformation matrices for negation and intensity (Tm) are initialized with a prior value.", 
        "129": "The other parameters for hidden layers (W (∗), U (∗), S) are initialized with Uniform(0, 1/sqrt(d)), where d is the dimension of hidden representation, and we set d=300.", 
        "130": "We adopt adaGrad to train the models, and the learning rate is 0.1.", 
        "131": "It’s worth noting that, we adopt stochastic gradient descent to update the word embeddings (V ), with a learning rate of 0.2 but without momentum.", 
        "132": "The optimal setting for α and β is 0.5 and 0.0001 respectively.", 
        "133": "During training, we adopt the dropout operation before the softmax layer, with a probability of 0.5.", 
        "134": "Mini-batch is taken to train the models, each batch containing 25 samples.", 
        "135": "After training with 3,000 mini-batch (about 9 epochs on MR and 10 epochs on SST), we choose the results of the model that performs best on the validation dataset as the final performance.", 
        "136": "5.3 Overall Comparison  We include several baselines, as listed below: RNN/RNTN: Recursive Neural Network over parsing trees, proposed by (Socher et al., 2011) and Recursive Tensor Neural Network (Socher et al., 2013) employs tensors to model correlations between different dimensions of child nodes’ vectors.", 
        "137": "LSTM/Bi-LSTM: Long Short-Term Memory\n(Cho et al., 2014) and the bidirectional variant as introduced previously.", 
        "138": "Tree-LSTM: Tree-Structured Long Short-Term Memory (Tai et al., 2015) introduces memory cells and gates into tree-structured neural network.", 
        "139": "CNN: Convolutional Neural Network (Kalchbrenner et al., 2014) generates sentence representation by convolution and pooling operations.", 
        "140": "CNN-Tensor: In (Lei et al., 2015), the convolution operation is replaced by tensor product and a dynamic programming is applied to enumerate all skippable trigrams in a sentence.", 
        "141": "Very strong results are reported.", 
        "142": "DAN: Deep Average Network (DAN) (Iyyer et al., 2015) averages all word vectors in a sentence and connects an MLP layer to the output layer.", 
        "143": "Neural Context-Sensitive Lexicon: NCSL (Teng et al., 2016) treats the sentiment score of a sentence as a weighted sum of prior scores of words in the sentence where the weights are learned by a neural network.", 
        "144": "Firstly, we evaluate our model on the MR dataset and the results are shown in Table 3.", 
        "145": "We have the following observations: First, both LR-LSTM and LR-Bi-LSTM outperforms their counterparts (81.5% vs. 77.4% and 82.1% vs. 79.3%, resp.", 
        "146": "), demonstrating the ef-\nfectiveness of the linguistic regularizers.", 
        "147": "Second, LR-LSTM and LR-Bi-LSTM perform slightly better than Tree-LSTM but Tree-LSTM leverages a constituency tree structure while our model is a simple sequence model.", 
        "148": "As future work, we will apply such regularizers to tree-structured models.", 
        "149": "Last, on the MR dataset, our model is comparable to or slightly better than CNN.", 
        "150": "For fine-grained sentiment classification, we evaluate our model on the SST dataset which has five sentiment classes { very negative, negative, neutral, positive, very positive} so that we can evaluate the sentiment shifting effect of intensity words.", 
        "151": "The results are shown in Table 3.", 
        "152": "We have the following observations: First, linguistically regularized LSTM and BiLSTM are better than their counterparts.", 
        "153": "It’s worth noting that LR-Bi-LSTM (trained with just sentence-level annotation) is even comparable to Bi-LSTM trained with phrase-level annotation.", 
        "154": "That means, LR-Bi-LSTM can avoid the heavy phrase-level annotation but still obtain comparable results.", 
        "155": "Second, our models are comparable to TreeLSTM but our models are not dependent on a parsing tree and more simple, and hence more efficient.", 
        "156": "Further, for Tree-LSTM, the model is heavily dependent on phrase-level annotation, otherwise the performance drops substantially (from 51% to 48.1%).", 
        "157": "Last, on the SST dataset, our model is better than CNN, DAN, and NCSL.", 
        "158": "We conjecture that the strong performance of CNN-Tensor may be due to the tensor product operation, the enumeration of all skippable trigrams, and the concatenated representations of all pooling layers for final classification.", 
        "159": "5.4 The Effect of Different Regularizers  In order to reveal the effect of each individual regularizer, we conduct ablation experiments.", 
        "160": "Each time, we remove a regularizer and observe how the performance varies.", 
        "161": "First of all, we conduct this experiment on the entire datasets, and then we experiment on sub-datasets that only contain negation words or intensity words.", 
        "162": "The experiment results are shown in Table 4 where we can see that the non-sentiment regularizer (NSR) and sentiment regularizer (SR) play a key role3, and the negation regularizer and in-\n3Kindly note that almost all sentences contain sentiment\ntensity regularizer are effective but less important than NSR and SR.", 
        "163": "This may be due to the fact that only 14% of sentences contains negation words in the test datasets, and 23% contains intensity words, and thus we further evaluate the models on two subsets, as shown in Table 5.", 
        "164": "The experiments on the subsets show that: 1) With linguistic regularizers, LR-Bi-LSTM outperforms Bi-LSTM remarkably on these subsets; 2) When the negation regularizer is removed from the model, the performance drops significantly on both MR and SST subsets; 3) Similar observations can be found regarding the intensity regularizer.", 
        "165": "5.5 The Effect of the Negation Regularizer  To further reveal the linguistic role of negation words, we compare the predicted sentiment distributions of a phrase pair with and without a negation word.", 
        "166": "The experimental results performed on MR are shown in Fig.", 
        "167": "2.", 
        "168": "Each dot denotes a phrase\nwords, see Tab.", 
        "169": "1.\npair (for example, <interesting, not interesting>), where the x-axis denotes the positive score4 of a phrase without negators (e.g., interesting), and the y-axis indicates the positive score for the phrase with negators (e.g., not interesting).", 
        "170": "The curves in the figures show this function: [1 − y, y] = softmax(Tnw ∗ [1 − x, x]) where [1 − x, x] is a sentiment distribution on [negative, positive], x is the positive score of the phrase without negators (x-axis) and y that of the phrase with negators (yaxis), and Tnw is the transformation matrix for the negation word nw (see Eq.", 
        "171": "9).", 
        "172": "By looking into the\ndetailed results of our model, we have the following statements: First, there is no dot at the up-right and bottomleft blocks, indicating that negators generally shift/convert very positive or very negative phrases to other polarities.", 
        "173": "Typical phrases include not very good, not too bad.", 
        "174": "Second, the dots at the up-left and bottom-right respectively indicates the negation effects: changing negative to positive and positive to negative.", 
        "175": "Typical phrases include never seems hopelessly (up-left), no good scenes (bottom-right), not interesting (bottom-right), etc.", 
        "176": "There are also some positive/negative phrases shifting to neutral sentiment such as not so good, and not too bad.", 
        "177": "Last, the dots located at the center indicate that neutral phrases maintain neutral sentiment with negators.", 
        "178": "Typical phrases include not at home, not here, where negators typically modify nonsentiment words.", 
        "179": "5.6 The Effect of the Intensity Regularizer  To further reveal the linguistic role of intensity words, we perform experiments on the SST dataset, as illustrated in Figure 3.", 
        "180": "We show the\n4 The score is obtained from the predicted distribution, where 1 means positive and 0 means negative.", 
        "181": "matrix that indicates how the sentiment shifts after being modified by intensifiers.", 
        "182": "Each number in a cell (mij) indicates how many phrases are predicted with a sentiment label i but the prediction of the phrases with intensifiers changes to label j.", 
        "183": "For instance, the number 20 (m21) in the second matrix , means that there are 20 phrases predicted with a class of negative (-) but the prediction changes to very negative (- -) after being modified by intensifier “very”.", 
        "184": "Results in the first\nmatrix show that, for intensifier “most”, there are 21/21/13/12 phrases whose sentiment is shifted after being modified by intensifiers, from negative to very negative (eg.", 
        "185": "most irresponsible picture), positive to very positive (eg.", 
        "186": "most famous author), neutral to negative (eg.", 
        "187": "most plain), and neutral to positive (eg.", 
        "188": "most closely), respectively.", 
        "189": "There are also many phrases retaining the sentiment after being modified with intensifiers.", 
        "190": "Not surprisingly, for very positive/negative phrases, phrases modified by intensifiers still maintain the strong sentiment.", 
        "191": "For the left phrases, they fall into three categories: first, words modified by intensifiers are non-sentiment words, such as most of us, most part; second, intensifiers are not strong enough to shift sentiment, such as most complex (from neg.", 
        "192": "to neg.", 
        "193": "), most traditional (from pos.", 
        "194": "to pos.", 
        "195": "); third, our models fail to shift sentiment with intensifiers such as most vital, most resonant film.", 
        "196": "6 Conclusion and Future Work  We present linguistically regularized LSTMs for sentence-level sentiment classification.", 
        "197": "The proposed models address the sentient shifting effect of sentiment, negation, and intensity words.", 
        "198": "Furthermore, our models are sequence LSTMs which do not depend on a parsing tree-structure and do\nnot require expensive phrase-level annotation.", 
        "199": "Results show that our models are able to address the linguistic role of sentiment, negation, and intensity words.", 
        "200": "To preserve the simplicity of the proposed models, we do not consider the modification scope of negation and intensity words, though we partially address this issue by applying a minimization operartor (see Eq.", 
        "201": "11, Eq.", 
        "202": "14) and bi-directional LSTM.", 
        "203": "As future work, we plan to apply the linguistic regularizers to tree-LSTM to address the scope issue since the parsing tree is easier to indicate the modification scope explicitly.", 
        "204": "Acknowledgments  This work was partly supported by the National Basic Research Program (973 Program) under grant No.", 
        "205": "2013CB329403, and the National Science Foundation of China under grant No.61272227/61332007."
    }, 
    "document_id": "P17-1154.pdf.json"
}
