{
    "abstract_sentences": {
        "1": "We study the problem of semi-supervised question answering—-utilizing unlabeled text to boost the performance of question answering models.", 
        "2": "We propose a novel training framework, the Generative Domain-Adaptive Nets.", 
        "3": "In this framework, we train a generative model to generate questions based on the unlabeled text, and combine model-generated questions with human-generated questions for training question answering models.", 
        "4": "We develop novel domain adaptation algorithms, based on reinforcement learning, to alleviate the discrepancy between the modelgenerated data distribution and the humangenerated data distribution.", 
        "5": "Experiments show that our proposed framework obtains substantial improvement from unlabeled text."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1040–1050 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1096  1 Introduction  Recently, various neural network models were proposed and successfully applied to the tasks of questions answering (QA) and/or reading comprehension (Xiong et al., 2016; Dhingra et al., 2016; Yang et al., 2017).", 
        "2": "While achieving stateof-the-art performance, these models rely on a large amount of labeled data.", 
        "3": "However, it is extremely difficult to collect large-scale question answering datasets.", 
        "4": "Historically, many of the question answering datasets have only thousands of question answering pairs, such as WebQuestions (Berant et al., 2013), MCTest (Richardson et al., 2013), WikiQA (Yang et al., 2015), and TREC-QA (Voorhees and Tice, 2000).", 
        "5": "Although larger question answering datasets with hundreds of thousands of question-answer pairs have been collected, including SQuAD (Rajpurkar et al.,\n2016), MSMARCO (Nguyen et al., 2016), and NewsQA (Trischler et al., 2016a), the data collection process is expensive and time-consuming in practice.", 
        "6": "This hinders real-world applications for domain-specific question answering.", 
        "7": "Compared to obtaining labeled question answer pairs, it is trivial to obtain unlabeled text data.", 
        "8": "In this work, we study the following problem of semi-supervised question answering: is it possible to leverage unlabeled text to boost the performance of question answering models, especially when only a small amount of labeled data is available?", 
        "9": "The problem is challenging because conventional manifold-based semi-supervised learning algorithms (Zhu and Ghahramani, 2002; Yang et al., 2016a) cannot be straightforwardly applied.", 
        "10": "Moreover, since the main foci of most question answering tasks are extraction rather than generation, it is also not sensible to use unlabeled text to improve language modeling as in machine translation (Gulcehre et al., 2015).", 
        "11": "To better leverage the unlabeled text, we propose a novel neural framework called Generative Domain-Adaptive Nets (GDANs).", 
        "12": "The starting point of our framework is to use linguistic tags to extract possible answer chunks in the unlabeled text, and then train a generative model to generate questions given the answer chunks and their contexts.", 
        "13": "The model-generated questionanswer pairs and the human-generated questionanswer pairs can then be combined to train a question answering model, referred to as a discriminative model in the following text.", 
        "14": "However, there is discrepancy between the model-generated data distribution and the human-generated data distribution, which leads to suboptimal discriminative models.", 
        "15": "To address this issue, we further propose two domain adaptation techniques that treat the model-generated data distribution as a different domain.", 
        "16": "First, we use an additional domain tag to\n1040\nindicate whether a question-answer pair is modelgenerated or human-generated.", 
        "17": "We condition the discriminative model on the domain tags so that the discriminative model can learn to factor out domain-specific and domain-invariant representations.", 
        "18": "Second, we employ a reinforcement learning algorithm to fine-tune the generative model to minimize the loss of the discriminative model in an adversarial way.", 
        "19": "In addition, we present a simple and effective baseline method for semi-supervised question answering.", 
        "20": "Although the baseline method performs worse than our GDAN approach, it is extremely easy to implement and can still lead to substantial improvement when only limited labeled data is available.", 
        "21": "We experiment on the SQuAD dataset (Rajpurkar et al., 2016) with various labeling rates and various amounts of unlabeled data.", 
        "22": "Experimental results show that our GDAN framework consistently improves over both the supervised learning setting and the baseline methods, including adversarial domain adaptation (Ganin and Lempitsky, 2014) and dual learning (Xia et al., 2016).", 
        "23": "More specifically, the GDAN model improves the F1 score by 9.87 points in F1 over the supervised learning setting when 8K labeled question-answer pairs are used.", 
        "24": "Our contribution is four-fold.", 
        "25": "First, different from most of the previous neural network studies on question answering, we study a critical but challenging problem, semi-supervised question answering.", 
        "26": "Second, we propose the Generative Domain-Adaptive Nets that employ domain adaptation techniques on generative models with reinforcement learning algorithms.", 
        "27": "Third, we introduce a simple and effective baseline method.", 
        "28": "Fourth, we empirically show that our framework leads to substantial improvements.", 
        "29": "2 Semi-Supervised Question Answering  Let us first introduce the problem of semisupervised question answering.", 
        "30": "Let L = {q(i), a(i), p(i)}Ni=1 denote a question answering dataset of N instances, where q(i), a(i), and p(i) are the question, answer, and paragraph of the i-th instance respectively.", 
        "31": "The goal of question answering is to produce the answer a(i) given the question q(i) along with the paragraph p(i).", 
        "32": "We will drop the superscript ·(i) when the context is unambiguous.", 
        "33": "In our formulation, follow-\ning the setting in SQuAD (Rajpurkar et al., 2016), we specifically focus on extractive question answering, where a is always a consecutive chunk of text in p. More formally, let p = (p1, p2, · · · , pT ) be a sequence of word tokens with T being the length, then a can always be represented as a = (pj , pj+1, · · · , pk−1, pk), where j and k are the start and end token indices respectively.", 
        "34": "The questions can also be represented as a sequence of word tokens q = (q1, q2, · · · , qT ′) with length T ′.", 
        "35": "In addition to the labeled dataset L, in the semisupervised setting, we are also given a set of unlabeled data, denoted as U = {a(i), p(i)}Mi=1, where M is the number of unlabeled instances.", 
        "36": "Note that it is usually trivial to have access to an almost infinite number of paragraphs p from sources such as Wikipedia articles and other web pages.", 
        "37": "And since the answer a is always a consecutive chunk in p, we argue that it is also sensible to extract possible answer chunks from the unlabeled text using linguistic tags.", 
        "38": "We will discuss the technical details of answer chunk extraction in Section 4.1, and in the formulation of our framework, we assume that the answer chunks a are available.", 
        "39": "Given both the labeled data L and the unlabeled data U , the goal of semi-supervised question answering is to learn a question answering model D that captures the probability distribution P(a|p, q).", 
        "40": "We refer to this question answering model D as the discriminative model, in contrast to the generative model that we will present in Section 3.2.", 
        "41": "2.1 A Simple Baseline  We now present a simple baseline for semisupervised question answering.", 
        "42": "Given a paragraph p = (p1, p2, · · · , pT ) and the answer a = (pj , pj+1, · · · , pk−1, pk), we extract (pj−W , pj−W+1, · · · , pj−1, pk+1, pk+2, pk+W ) from the paragraph and treat it as the question.", 
        "43": "Here W is the window size and is set at 5 in our experiments so that the lengths of the questions are similar to human-generated questions.", 
        "44": "The context-based question-answer pairs on U are combined with human-generated pairs on L for training the discriminative model.", 
        "45": "Intuitively, this method extracts the contexts around the answer chunks to serve as hints for the question answering model.", 
        "46": "Surprisingly, this simple baseline method leads to substantial improvements when labeled data is limited.", 
        "47": "3 Generative Domain-Adaptive Nets  Though the simple method described in Section 2.1 can lead to substantial improvement, we aim to design a learning-based model to move even further.", 
        "48": "In this section, we will describe the model architecture and the training algorithms for the GDANs.", 
        "49": "We will use a notation in the context of question answering following Section 2, but one should be able to extend the notion of GDANs to other applications as well.", 
        "50": "The GDAN framework consists of two models, a discriminative model and a generative model.", 
        "51": "We will first discuss the two models in detail in the context of question answering, and then present an algorithm based on reinforcement learning to combine the two models.", 
        "52": "3.1 Discriminative Model  The discriminative model learns the conditional probability of an answer chunk given the paragraph and the question, i.e., P(a|p, q).", 
        "53": "We employ a gated-attention (GA) reader (Dhingra et al., 2016) as our base model in this work, but our framework does not make any assumptions about the base models being used.", 
        "54": "The discriminative model is referred to as D.\nThe GA model consists of K layers with K being a hyper-parameter.", 
        "55": "Let Hkp be the intermediate paragraph representation at layer k, and Hq be the question representation.", 
        "56": "The paragraph representation Hkp is a T × d matrix, and the question representation Hq is a T ′ × d matrix, where d is the dimensionality of the representations.", 
        "57": "Given the paragraph p, we apply a bidirectional Gated Recurrent Unit (GRU) network (Chung et al., 2014) on top of the embeddings of the sequence (p1, p2, · · · , pT ), and obtain the initial paragraph representation H0p.", 
        "58": "Given the question q, we also apply another bidirectional GRU to obtain the question representation Hq.", 
        "59": "The question and paragraph representations are combined with the gated-attention (GA) mechanism (Dhingra et al., 2016).", 
        "60": "More specifically, for each paragraph token pi, we compute\nαj = exphTq,jh k−1 p,i∑T ′\nj′=1 exph T q,j′h k−1 p,i\nhkp,i = T ′∑\nj=1\nαjhq,j hk−1p,i\nwhere hkp,i is the i-th row of H k p and hq,j is the j-th row of Hq.", 
        "61": "Since the answer a is a sequence of consecutive word tokens in the paragraph p, we apply two softmax layers on top of HKp to predict the start and end indices of a, following Yang et al.", 
        "62": "(2017).", 
        "63": "3.1.1 Domain Adaptation with Tags  We will train our discriminative model on both model-generated question-answer pairs and human-generated pairs.", 
        "64": "However, even a welltrained generative model will produce questions somewhat different from human-generated ones.", 
        "65": "Learning from both human-generated data and model-generated data can thus lead to a biased model.", 
        "66": "To alleviate this issue, we propose to view the model-generated data distribution and the human-generated data distribution as two different data domains and explicitly incorporate domain adaptation into the discriminative model.", 
        "67": "More specifically, we use a domain tag as an additional input to the discriminative model.", 
        "68": "We use the tag “d true” to represent the domain of human-generated data (i.e., the true data), and “d gen” for the domain of model-generated data.", 
        "69": "Following a practice in domain adaptation (Johnson et al., 2016; Chu et al., 2017), we append the domain tag to the end of both the questions and the paragraphs.", 
        "70": "By introducing the domain tags, we expect the discriminative model to factor out domain-specific and domain-invariant representations.", 
        "71": "At test time, the tag “d true” is appended.", 
        "72": "3.2 Generative Model  The generative model learns the conditional probability of generating a question given the paragraph and the answer, i.e., P(q|p, a).", 
        "73": "We implement the generative model as a sequence-tosequence model (Sutskever et al., 2014) with a copy mechanism (Gu et al., 2016; Gulcehre et al., 2016).", 
        "74": "The generative model consists of an encoder and a decoder.", 
        "75": "An encoder is a GRU that encodes the input paragraph into a sequence of hidden states H. We inject the answer information by appending an additional zero/one feature to the word embeddings of the paragraph tokens; i.e., if a word token appears in the answer, the feature is set at one, otherwise zero.", 
        "76": "The decoder is another GRU with an attention mechanism over the encoder hidden states H. At each time step, the generation probabilities over all\nAlgorithm 1 Training Generative DomainAdaptive Nets\nInput: labeled data L, unlabeled data U , #iterations TG and TD Initialize G by MLE training on L Randomly initialize D while not stopping do\nfor t← 1 to TD do Update D to maximize J(L, d true, D) + J(UG, d gen, D) with SGD end for for t← 1 to TG do\nUpdate G to maximize J(UG, d true, D) with Reinforce and SGD\nend for end while return model D\nword types are defined with a copy mechanism:\npoverall = gtpvocab + (1− gt)pcopy (1)\nwhere gt is the probability of generating the token from the vocabulary, while (1 − gt) is the probability of copying a token from the paragraph.", 
        "77": "The probability gt is computed based on the current hidden state ht:\ngt = σ(w T g ht)\nwhere σ denotes the logistic function and wg is a vector of model parameters.", 
        "78": "The generation probabilities pvocab are defined as a softmax function over the word types in the vocabulary, and the copying probabilities pcopy are defined as a softmax function over the word types in the paragraph.", 
        "79": "Both pvocab and pcopy are defined as a function of the current hidden state ht and the attention results (Gu et al., 2016).", 
        "80": "3.3 Training Algorithm  We first define the objective function of the GDANs, and then present an algorithm to optimize the given objective function.", 
        "81": "Similar to the Generative Adversarial Nets (GANs) (Goodfellow et al., 2014) and adversarial domain adaptation (Ganin and Lempitsky, 2014), the discriminative model and the generative model have different objectives in our framework.", 
        "82": "However, rather than formulating the objective as an adversarial game between the two models (Goodfellow et al., 2014; Ganin and Lempitsky, 2014), in our framework, the discriminative model relies on the data generated by\nthe generative model, while the generative model aims to match the model-generated data distribution with the human-generated data distribution using the signals from the discriminative model.", 
        "83": "Given a labeled datasetL = {p(i), q(i), a(i)}Ni=1, the objective function of a discriminative modelD for a supervised learning setting can be written as∑\np(i),q(i),a(i)∈L logPD(a(i)|p(i), q(i)), where PD is a probability distribution defined by the model D. Since we also incorporate domain tags into the model D, we denote the objective function as\nJ(L, tag, D) = 1 |L| ∑\np(i),q(i),a(i)∈L\nlog PD,tag(a (i)|p(i), q(i))\nmeaning that the domain tag, “tag”, is appended to the dataset L. We use |L| = N to denote the number of the instances in the dataset L. The objective function is averaged over all instances such that we can balance labeled and unlabeled data.", 
        "84": "Let UG denote the dataset obtained by generating questions on the unlabeled dataset U with the generative model G. The objective of the discriminative model is then to maximize J for both labeled and unlabeled data under the domain adaptation notions, i.e., J(L, d true, D) + J(UG, d gen, D).", 
        "85": "Now we discuss the objective of the generative model.", 
        "86": "Similar to the dual learning (Xia et al., 2016) framework, one can define an autoencoder objective.", 
        "87": "In this case, the generative model aims to generate questions that can be reconstructed by the discriminative model, i.e., maximizing J(UG, d gen, D).", 
        "88": "However, this objective function can lead to degenerate solutions because the questions can be thought of as an overcomplete representation of the answers (Vincent et al., 2010).", 
        "89": "For example, given p and a, the generative model might learn to generate trivial questions such as copying the answers, which does not contributed to learning a better D.\nInstead, we leverage the discriminative model to better match the model-generated data distribution with the human-generated data distribution.", 
        "90": "We propose to define an adversarial training objective J(UG, d true, D).", 
        "91": "We append the tag “d true” instead of “d gen” for the model-generated data to “fool” the discriminative model.", 
        "92": "Intuitively, the goal of G is to generate ”useful” questions where the usefulness is measured by the probability that the generated questions can be answered correctly by D.\nThe overall objective function now can be written as\nmaxD J(L, d true, D) + J(UG, d gen, D)\nmaxG J(UG, d true, D)\nWith the above objective function in mind, we present a training algorithm in Algorithm 1 to train a GDAN.", 
        "93": "We first pretrain the generative model on the labeled data L with maximum likelihood estimation (MLE):\nmax G\nN∑\ni=1\nT ′∑\nt=1\nlogPG(q (i) t |q (i) <t, p (i), a(i))\nwhere PG is the probability defined by Eq.", 
        "94": "1.", 
        "95": "We then alternatively update D and G based on their objectives.", 
        "96": "To update D, we sample one batch from the labeled data L and one batch from the unlabeled data UG, and combine the two batches to perform a gradient update step.", 
        "97": "Since the output of G is discrete and non-differentiable, we use the Reinforce algorithm (Williams, 1992) to update G. The action space is all possible questions with length T ′ (possibly with padding) and the reward is the objective function J(UG, d true, D).", 
        "98": "Let θG be the parameters of G. The gradient can be written as\n∂J(UG, d true, D) ∂θG\n= EPG(q|p,a)(log PD,d true(a|p, q)− b) ∂ log PG(q|p, a)\n∂θG\nwhere we use an average reward from samples as the baseline b.", 
        "99": "We approximate the expectation\nEPG(q|p,a) by sampling one instance at a time from PG(q|p, a) and then do an update step.", 
        "100": "This training algorithm is referred to as reinforcement learning (RL) training in the following sections.", 
        "101": "The overall architecture and training algorithm are illustrated in Figure 1.", 
        "102": "MLE vs RL.", 
        "103": "The generator G has two training phases–MLE training and RL training, which are different in that: 1) RL training does not require labels, so G can explore a broader data domain of p using unlabeled data, while MLE training requires labels; 2) MLE maximizes logP (q|p, a), while RL maximizes logPD(a|q, p).", 
        "104": "Since logP (q|a, p) is the sum of logP (q|p) and logP (a|q, p) (plus a constant), maximizing logP (a|q, p) does not require modeling logP (q|p) that is irrelevant to QA, which makes optimization easier.", 
        "105": "Moreover, maximizing logP (a|q, p) is consistent with the goal of QA.", 
        "106": "4 Experiments    4.1 Answer Extraction  As discussed in Section 2, our model assumes that answers are available for unlabeled data.", 
        "107": "In this section, we introduce how we use linguistic tags and rules to extract answer chunks from unlabeled text.", 
        "108": "To extract answers from massive unlabelled Wikipedia articles, we first sample 205,511 Wikipedia articles that are not used in the training, development and test sets in the SQuAD dataset.", 
        "109": "We extract the paragraphs from each article, and limit the length of each paragraph at the word level to be less than 850.", 
        "110": "In total, we obtain 950,612\nparagraphs from unlabelled articles.", 
        "111": "Answers in the SQuAD dataset can be categorized into ten types, i.e., “Date”, “Other Numeric”, “Person”, “Location”, “Other Entity”, “Common Noun Phrase”, “Adjective Phrase”, “Verb Phrase”, “Clause” and “Other” (Rajpurkar et al., 2016).", 
        "112": "For each paragraph from the unlabeled articles, we utilize Stanford Part-Of-Speech (POS) tagger (Toutanova et al., 2003) to label each word with the corresponding POS tag, and implement a simple constituency parser to extract the noun phrase, verb phrase, adjective and clause based on a small set of constituency grammars.", 
        "113": "Next, we use Stanford Named Entity Recognizer (NER) (Finkel et al., 2005) to assign each word with one of the seven labels, i.e., “Date”, “Money”, “Percent”, “location”, “Organization” and “Time”.", 
        "114": "We then categorize a span of consecutive words with the same NER tags of either “Money” or “Percent” as the answer of the type “Other Numeric”.", 
        "115": "Similarly, we categorize a span of consecutive words with the same NER tags of\n“Organization” as the answer of the type “Other Entity”.", 
        "116": "Finally, we subsample five answers from all the extracted answers for each paragraph according to the percentage of answer types in the SQuAD dataset.", 
        "117": "We obtain 4,753,060 answers in total, which is about 50 times larger than the number of answers in the SQuAD dataset.", 
        "118": "4.2 Settings and Comparison Methods  The original SQuAD dataset consists of 87,636 training instances and 10,600 development instances.", 
        "119": "Since the test set is not published, we split 10% of the training set as the test set, and the remaining 90% serves as the actual training set.", 
        "120": "Instances are split based on articles; i.e., paragraphs in one article always appear in only one set.", 
        "121": "We tune the hyper-parameters and perform early stopping on the development set using the F1 scores, and the performance is evaluated on the test set using both F1 scores and exact matching (EM) scores (Rajpurkar et al., 2016).", 
        "122": "We compare the following methods.", 
        "123": "SL is\nthe supervised learning setting where we train the model D solely on the labeled data L. Context is the simple context-based method described in Section 2.1.", 
        "124": "Context + domain is the “Context” method with domain tags as described in Section 3.1.1.", 
        "125": "Gen is to train a generative model and use the generated questions as additional training data.", 
        "126": "Gen + GAN refers to the domain adaptation method using GANs (Ganin and Lempitsky, 2014); in contrast to the original work, the generative model is updated using Reinforce.", 
        "127": "Gen + dual refers to the dual learning method (Xia et al., 2016).", 
        "128": "Gen + domain is “Gen” with domain tags, while the generative model is trained with MLE and fixed.", 
        "129": "Gen + domain + adv is the approach we propose (Cf.", 
        "130": "Figure 1 and Algorithm 1), with “adv” meaning adversarial training based on Reinforce.", 
        "131": "We use our own implementation of “Gen + GAN” and “Gen + dual”, since the GAN model (Ganin and Lempitsky, 2014) does not handle discrete features and the dual learning model (Xia et al., 2016) cannot be directly applied to question answering.", 
        "132": "When implementing these two baselines, we adopt the learning schedule introduced by Ganin and Lempitsky (2014), i.e., gradually increasing the weights of the gradients for the generative model G.  4.3 Results and Analysis  We study the performance of different models with varying labeling rates and unlabeled dataset sizes.", 
        "133": "Labeling rates are the percentage of training instances that are used to train D. The results are reported in Table 2.", 
        "134": "Though the unlabeled dataset we collect consists of around 5 million instances, we also sample a subset of around 50,000 instances to evaluate the effects of the size of unlabeled data.", 
        "135": "The highest labeling rate in Table 2 is 0.9 because 10% of the training instances are used for testing.", 
        "136": "Since we do early stopping on the development set using the F1 scores, we also report the development F1.", 
        "137": "We report two metrics, the F1 scores and the exact matching (EM) scores (Rajpurkar et al., 2016), on the test set.", 
        "138": "All metrics are computed using the official evaluation scripts.", 
        "139": "SL v.s.", 
        "140": "SSL.", 
        "141": "We observe that semi-supervised learning leads to consistent improvements over supervised learning in all cases.", 
        "142": "Such improvements are substantial when labeled data is limited.", 
        "143": "For example, the GDANs improve over supervised learning by 9.87 points in F1 and 7.26 points in\nEM when the labeling rate is 0.1.", 
        "144": "With our semisupervised learning approach, we can use only 0.1 training instances to obtain even better performance than a supervised learning approach with 0.2 training instances, saving more than half of the labeling costs.", 
        "145": "Comparison with Baselines.", 
        "146": "By comparing “Gen + domain + adv” with “Gen + GAN” and “Gen + Dual”, it is clear that the GDANs perform substantially better than GANs and dual learning.", 
        "147": "With labeling rate 0.1, GDANs outperform dual learning and GANs by 2.47 and 4.29 points respectively in terms of F1.", 
        "148": "Ablation Study.", 
        "149": "We also perform an ablation study by examining the effects of “domain” and “adv” when added to “gen”.", 
        "150": "It can be seen that both the domain tags and the adversarial training contribute to the performance of the GDANs when the labeling rate is equal to or less than 0.5.", 
        "151": "With labeling rate 0.9, adding domain tags still leads to better performance but adversarial training does not seem to improve the performance by much.", 
        "152": "Unlabeled Data Size.", 
        "153": "Moreover, we observe that the performance can be further improved when a larger unlabeled dataset is used, though the gain is relatively less significant compared to changing the model architectures.", 
        "154": "For example, increasing the unlabeled dataset size from 50K to 5M, the performance of GDANs increases by 0.38 points in F1 and 0.52 points in EM.", 
        "155": "Context-Based Method.", 
        "156": "Surprisingly, the simple context-based method, though performing worse than GDANs, still leads to substantial gains; e.g., 7.00 points in F1 with labeling rate 0.1.", 
        "157": "Adding domain tags can improve the performance of the context-based method as well.", 
        "158": "MLE vs RL.", 
        "159": "We plot the loss curve of −J(UG, d gen, D) for both the MLE-trained generator (“Gen + domain”) and the RL-trained generator (“Gen + domain + adv”) in Figure 2.", 
        "160": "We observe that the training loss for D on RLgenerated questions is lower than MLE-generated questions, which confirms that RL training maximizes logP (a|p, q).", 
        "161": "Samples of Generated Questions.", 
        "162": "We present some questions generated by our model in Table 1.", 
        "163": "The generated questions are post-processed by removing repeated subs-sequences.", 
        "164": "Compared to MLE-generated questions, RL-generated questions are more informative (Cf., P1, P2, and P4), and contain less “UNK” (unknown) tokens (Cf.,\nP1).", 
        "165": "Moreover, both semantically and syntactically, RL-generated questions are more accurate (Cf., P3 and P5).", 
        "166": "5 Related Work  Semi-Supervised Learning.", 
        "167": "Semi-supervised learning has been extensively studied in literature (Zhu, 2005).", 
        "168": "A batch of novel models have been recently proposed for semi-supervised learning based on representation learning techniques, such as generative models (Kingma et al., 2014), ladder networks (Rasmus et al., 2015) and graph embeddings (Yang et al., 2016a).", 
        "169": "However, most of the semi-supervised learning methods are based on combinations of the supervised loss p(y|x) and an unsupervised loss p(x).", 
        "170": "In the context of reading comprehension, directly modeling the likelihood of a paragraph would not possibly improve the supervised task of question answering.", 
        "171": "Moreover, traditional graph-based semisupervised learning (Zhu and Ghahramani, 2002) cannot be easily extended to modeling the unlabeled answer chunks.", 
        "172": "Domain Adaptation.", 
        "173": "Domain adaptation has been successfully applied to various tasks, such as classification (Ganin and Lempitsky, 2014) and machine translation (Johnson et al., 2016; Chu et al., 2017).", 
        "174": "Several techniques on domain adaptation (Glorot et al., 2011) focus on learning distribution invariant features by sharing the intermediate representations for downstream tasks.", 
        "175": "Another line of research on domain adaptation attempt to match the distance between different domain distributions in a low dimensional space (Long et al., 2015; Baktashmotlagh et al., 2013).", 
        "176": "There are\nalso methods seeking a domain transition from the source domain to the target domain (Gong et al., 2012; Gopalan et al., 2011; Pan et al., 2011).", 
        "177": "Our work gets inspiration from a practice in Johnson et al.", 
        "178": "(2016) and Chu et al.", 
        "179": "(2017) based on appending domain tags.", 
        "180": "However, our method is different from the above methods in that we apply domain adaptation techniques to the outputs of a generative model rather than a natural data domain.", 
        "181": "Question Answering.", 
        "182": "Various neural models based on attention mechanisms (Wang and Jiang, 2016; Seo et al., 2016; Xiong et al., 2016; Wang et al., 2016; Dhingra et al., 2016; Kadlec et al., 2016; Trischler et al., 2016b; Sordoni et al., 2016; Cui et al., 2016; Chen et al., 2016) have been proposed to tackle the tasks of question answering and reading comprehension.", 
        "183": "However, the performance of these neural models largely relies on a large amount of labeled data available for training.", 
        "184": "Learning with Multiple Models.", 
        "185": "GANs (Goodfellow et al., 2014) formulated a adversarial game between a discriminative model and a generative model for generating realistic images.", 
        "186": "Ganin and Lempitsky (Ganin and Lempitsky, 2014) employed a similar idea to use two models for domain adaptation.", 
        "187": "Review networks (Yang et al., 2016b) employ a discriminative model as a regularizer for training a generative model.", 
        "188": "In the context of machine translation, given a language pair, various recent work studied jointly training models to learn the mappings in both directions (Tu et al., 2016; Xia et al., 2016).", 
        "189": "6 Conclusions  We study a critical and challenging problem, semi-supervised question answering.", 
        "190": "We propose a novel neural framework called Generative Domain-Adaptive Nets, which incorporate domain adaptation techniques in combination with generative models for semi-supervised learning.", 
        "191": "Empirically, we show that our approach leads to substantial improvements over supervised learning models and outperforms several strong baselines including GANs and dual learning.", 
        "192": "In the future, we plan to apply our approach to more question answering datasets in different domains.", 
        "193": "It will also be intriguing to generalize GDANs to other applications.", 
        "194": "Acknowledgements.", 
        "195": "This work was funded by the Office of Naval Research grants N000141512791 and\nN000141310721 and NVIDIA."
    }, 
    "document_id": "P17-1096.pdf.json"
}
