{
    "abstract_sentences": {
        "1": "We propose jointly modelling Knowledge Bases and aligned text with Feature-Rich Networks.", 
        "2": "Our models perform Knowledge Base Completion by learning to represent and compose diverse feature types from partially aligned and noisy resources.", 
        "3": "We perform experiments on Freebase utilizing additional entity type information and syntactic textual relations.", 
        "4": "Our evaluation suggests that the proposed models can better incorporate side information than previously proposed combinations of bilinear models with convolutional neural networks, showing large improvements when scoring the plausibility of unobserved facts with associated textual mentions."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 324–329 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2051  1 Introduction  Knowledge Bases (KB) are an important resource for many applications such as question answering (Reddy et al., 2014), relation extraction (Mintz et al., 2009) and named entity recognition (Ling and Weld, 2012).", 
        "2": "While large collaborative KBs like Freebase (Bollacker et al., 2008) and DBpedia (Auer et al., 2007) contain facts about million of entities, they are mostly incomplete and contain errors.", 
        "3": "A large amount of research has been dedicated to automatically extend knowledge bases, a task called Entity Linking or Knowledge Base Completion (KBC).", 
        "4": "Proposed approaches to KBC either reason about the internal structure of the KB, or utilize external data sources that indicate relations between the entities in the KB.", 
        "5": "A very successful approach to KBC is latent feature models (Nickel et al., 2011; Bordes et al., 2013; Socher et al., 2013; Nickel et al., 2016).", 
        "6": "Such models embed the symbols of the KB into\na low dimensional space and assign a score to unseen triples as a function of the latent feature representations.", 
        "7": "Most approaches define a scoring function as a linear or bilinear operator.", 
        "8": "Latent feature models have shown good performance when considering the internal structure of KBs and are scalable to very large datasets.", 
        "9": "Utilizing textual data or other external resources for KBC is a challenging task but has the potential of constantly updating KBs as new information becomes available.", 
        "10": "A line of work uses the KB as a means to obtain distant supervision to train relation extraction systems that classify textual mentions into one of the KBs relations (Mintz et al., 2009; Hoffmann et al., 2011; Surdeanu et al., 2012).", 
        "11": "State-of-the-art approaches for KBC with external textual data are obtained by latent feature models that jointly embed the KB symbols and text relations into the same space (Riedel et al., 2013; Toutanova et al., 2015).", 
        "12": "The benefit of such models over relation extraction systems is that they can combine both the internal structure of the KB and textual information to reason about the plausibility of unobserved facts.", 
        "13": "A commonly used approach for augmenting a KBC given an aligned text corpus is by adopting a Universal Schema (Riedel et al., 2013), where extracted textual relations between entities are directly added to the knowledge graph and treated the same as KB relations.", 
        "14": "This allows application of any latent variable model defined over triples to jointly embed the KB and text relations to the same space.", 
        "15": "An extension to the Universal Schema approach was proposed by (Toutanova et al., 2015), where representations of text relations are formed compositionally by Convolutional Neural Networks (CNNs) and then composed with entity vectors by a bilinear model to score a fact.", 
        "16": "However, these models show only moderate improvement when incorporating tex-\n324\ntual relations.", 
        "17": "A limitation of the Universal Schema approach for joint embedding of KBs and text is that information about the correspondence between KB and text relations is only implicitly available through their co-occurrence with entities.", 
        "18": "Text relations can often be noisy and pairs of entities can cooccur in the same sentence without sharing a semantic relation.", 
        "19": "In addition, there is usually a mismatch in the relations found in the KB and those expressed in text.", 
        "20": "The model has to learn the alignment between KB and text relations without explicit evidence of co-occurrence between the two, and then propagate that information through the entity embeddings in order to score unseen KB triples.", 
        "21": "We propose a different approach to combine KB and textual evidence, where the textual relations are not part of the same graph but are treated as side evidence.", 
        "22": "In our setting, a fact does not necessarily consist of a (sbj, rel, obj) triple, but as an n-tuple where extra elements are formed by extracting additional information from the KB and aligned side resources such as text.", 
        "23": "We score the probability of the tuple being true by learning latent representations for each element of the tuple, and then learning a composition and scoring function parameterized by a Multilayer Perceptron (MLP).", 
        "24": "We choose MLPs as they are a generic method to model interactions between latent features without having to specify the form of a composition operator for tuples of different arity.", 
        "25": "When scoring the plausibility of unseen facts, all the side evidence associated with that fact becomes explicit through the n-tuple.", 
        "26": "We evaluate the ability of the proposed Feature-\nRich Networks (FRN) for KBC on the challenging FB15k-237 (Toutanova et al., 2015).", 
        "27": "We compare the performance of bilinear models to an MLP when facts are represented as simple triples, and the contribution of two additional types of aligned information: entity types and textual relation mentions from a side corpus.", 
        "28": "We also evaluate the contribution of initializing feature representations from external models.", 
        "29": "Evaluation suggests that while MLPs and bilinear models perform similarly when treating facts as triples of KB symbols, the proposed approach can better utilize additional textual data than a combination of CNNs with bilinear models, showing large improvements in predicting unseen facts when they have linked relation mentions in text.", 
        "30": "2 Model Definition  Knowledge Bases can be represented as a directed graph where nodes are entities e ∈ E and edges are typed relations r ∈ R. A fact in the KB is encoded as a triple (es, r, eo), where es is the subject entity and eo is the object entity.", 
        "31": "Starting with an existing KB consisting of a set of observed facts, our goal is to reason about the plausibility of unobserved facts, given some additional external resource.", 
        "32": "In our proposed model, we expand the representation of a fact to an n-tuple by considering alignments of the additional resource with elements of the triple.", 
        "33": "Our most expressive model encodes a fact as X = (es, r, eo, ts, to, To,s), where ts, to are associated representation of types of the two entities, and To,s is the aligned textual evidence associated with a pair of entities from a side corpus.", 
        "34": "Representations of entities and entity types are shared between subjects and objects.", 
        "35": "Francis Ford Coppola, director of The Godfather, …\nappos nmod:of\nsubject entity /m/02vyw object entity /m/07g1sm relation /film/director/film subject entity types /people/person /film/director/ /award/award winner object entity types /film/film /award/award winning work text features appos−1 Esbj director appos director\nof nmod:of−1 director nmod:of Eobj\nExtracted features for a KB fact with a single associated textual relation mention.", 
        "36": "2.0.1 Feature Rich Networks We model the probability of an n-tuple being true with an MLP that learns to compose and score the compatibility of the features associated with it.", 
        "37": "Features for each individual element of the tuple are assigned low dimensional embeddings which are concatenated to form the input to the MLP.", 
        "38": "The embeddings are jointly learned with the composition and scoring model through back-propagation.", 
        "39": "The probability of a fact being true is given by:\np(X = 1) = σ(w3 · g(W2 · g(W1 · x)) (1)\nx = v(es); v(r); v(eo); v(ts); v(to); v(Ts,o) (2)\nwhereW1, W2, w3 are the weights of the network, g(•) is a non-linear function applied elementwise, σ(•) is the sigmoid function and v(•) are latent feature representations of each element of the tuple.", 
        "40": "We use Rectified Linear Units as nonlinearities (Nair and Hinton, 2010).", 
        "41": "2.1 Additional Features  We create compositional representations for the entity types and textual relation mentions with simple aggregation functions of their feature embeddings.", 
        "42": "Although not considered in this work, the overall approach is highly modular allowing for each component to be modelled by a different kind of network.", 
        "43": "Freebase Entity Types Entities in Freebase can have multiple types assigned to them.", 
        "44": "While entity types are explicitly provided in Freebase, we instead learn type representations by considering observed relations in the training set.", 
        "45": "Each relation in Freebase is\nencoded as a domain/type/property of the subject entity.", 
        "46": "We extract the set of all triples where an entity takes the subject position, and keep the domain/type part as a type feature of that entity.", 
        "47": "We aggregate embeddings of all the observed discrete features using summation followed by L2-normalization to create the final representation of an entity’s type.", 
        "48": "We use a special UNKNOWN symbol for entities with no observed types in the training set (i.e., entities that do not appear as subject of a triple).", 
        "49": "We create entity type representations for both subject and object entities and concatenate them to the input vector of the network.", 
        "50": "Text Relations We use a side corpus where pairs of entities are linked to the KB and take the shortest dependency path connecting them as a textual relation mention.", 
        "51": "Since textual relations are tied to entity pairs, we collect all mentions for a given entity pair and associate them with a fact.", 
        "52": "This results in a set of phrases that act as textual evidence for relations of an entity pair.", 
        "53": "We create a representation of the associated text for each entity pair by using a Neural Bag of Words model augmented with dependency features.", 
        "54": "A dependency feature is a symbol for a word having a specific dependency relation, such as compound knowledge, compound−1 base for the knowledge base noun compound.", 
        "55": "Similar to the Entity Type representations, embeddings of words and dependency features are aggregated by summation followed by L2normalization, and a special UNKNOWN symbol is assigned to tuples whose pair of entities does\nnot have textual relation mentions.", 
        "56": "While our text representation component is quite simple, similar models have shown competitive performance on modelling short text (Komninos and Manandhar, 2016).", 
        "57": "Initialization with Pre-trained Embeddings We experiment with pre-trained embeddings to initialize the entity vectors and text feature embeddings of our model.", 
        "58": "Text feature embeddings are initialized from an available dependency based skip-gram model trained on Wikipedia (Komninos and Manandhar, 2016).", 
        "59": "Features that are not included in the vocabulary of the pre-trained model are initialized with a random vector from a normal distribution with zero mean and same variance as the set of pre-trained embeddings.", 
        "60": "For entity vectors, we retrieve the English name of the entity from Freebase and construct a representation by averaging the embeddings of the words appearing in the name.", 
        "61": "Entities that do not have a name property are initialized randomly.", 
        "62": "2.2 Training  The network weights are optimized by minimizing the binary cross-entropy loss over minibatches using the AdaM optimizer (Kingma and Ba, 2014).", 
        "63": "To avoid the large computational cost of training with all possible unobserved facts, we\nmake use of negative sampling.", 
        "64": "The loss function is:\nL(Θ) = − ∑\n|Xp| log p(Xp)−\n∑ |Xn| log(1− p(Xn))\n(3) where Θ are all the parameters of the network including the feature embeddings, Xp are the observed facts in the training set and Xn are randomly drawn unobserved facts.", 
        "65": "We construct the negative samples by fixing the subject entity and relation, and uniformly sampling an object entity with the restriction that the resulting triple is not included in the training set.", 
        "66": "We then expand the triple with entity type and text alignments.", 
        "67": "This negative sampling schedule follows the evaluation procedure, where the network has to rank triples that only differ in the object entity position.", 
        "68": "Experiments in the validation set indicated that for a fixed number of negative samples, only considering negative samples that differ in the object position performs better than also including negative samples for the subject position.", 
        "69": "3 Evaluation    3.1 Dataset and Evaluation Protocol  The FB15k237 dataset consists of about 15k entities and 237 relations derived from the FB15k dataset (Toutanova et al., 2015).", 
        "70": "This sub-\nset of relations does not contain redundant relations that can be easily inferred, resulting in a more challenging task compared to the original FB15k dataset.", 
        "71": "There are 310,116 triples in the dataset split into 272,115/17,535/20,466 for training/validation/testing.", 
        "72": "In addition to the KB, the dataset includes dependency paths of approximately 2.7 million relation instances of linked entity mentions extracted from the ClueWeb corpus (Gabrilovich et al., 2013).", 
        "73": "Evaluation follows the procedure of (Toutanova et al., 2015).", 
        "74": "Given a positive fact in the test set, the subject entity and relation are fixed and models have to rank all facts formed by the object entities appearing in the training set.", 
        "75": "The reported metrics are mean reciprocal rank (MRR) and hits@10.", 
        "76": "Hits@10 is the fraction of positive facts ranked in the top 10 positions.", 
        "77": "Positive facts in the training, validation and test set are removed before ranking.", 
        "78": "3.2 Implementation Details  Hyperparameters of the model were chosen by maximizing MRR on the validation set.", 
        "79": "We use two 300-dimensional hidden layers for the MLP, and dimensions of feature embeddings are: 300 for entity and text features, 100 for relations and 20 for entity type features.", 
        "80": "The number of negative samples was set to 20 as increasing their number only resulted in minor gains, and the batch size was set to 420.", 
        "81": "Best models were chosen among 20 epochs of training by monitoring validation MRR.", 
        "82": "Models with embedding initializations converged within the first 10 epochs.", 
        "83": "Initialization in the text model includes initializing entity and relation embeddings from a model without text mentions.", 
        "84": "3.3 Results  We compare our Feature-Rich Networks with the bilinear models F and E (Riedel et al., 2013), model DistMult (Yang et al., 2014) and their CNN augmented versions (Toutanova et al., 2015).", 
        "85": "Results can be seen in Table 1.", 
        "86": "We first observe that when modelling just KB triples, the MLP model outperforms individual bilinear formulations, performing similarly to the best combination of DistMult + E. This shows that an additive combination of bilinear models is a strong baseline even though it does not use additional parameters other than embeddings to compose and score triples.", 
        "87": "The addition of entity type information has a positive but small contribution\nto performance.", 
        "88": "This is not surprising as entity type information is extracted from observed relations, and latent feature models can effectively learn that during training.", 
        "89": "On the other hand, initializing entity embeddings with averaged word embeddings of their names results in a substantial performance gain of about 1.5 points in both MRR and hits@10.", 
        "90": "In general, we observe that all models perform worse on facts with textual relation mentions when they have not access to such mentions.", 
        "91": "When textual relation mentions are added, we observe that our proposed model increases its performance score about 3 points in MRR and 4.5 in hits@10 compared to the best model that does not include text.", 
        "92": "Contrary to the conv-bilinear models, the performance gain is much larger for facts with textual mentions, reaching an additional 15/20 in MRR/hits@10 respectively.", 
        "93": "We attribute this gain to the explicitly represented textual relation alignments with the KB symbols as encoded by the expanded tuple representations, and the non-linear composition of its elements by the MLP.", 
        "94": "We also notice that embedding initialization performs better overall.", 
        "95": "4 Conclusion  In this paper, we propose joint modelling of Knowledge Bases and text with Feature-Rich Networks.", 
        "96": "Our models can learn to combine information from different sources and better utilize noisy information from text than bilinear models augmented with convolutional neural networks.", 
        "97": "Besides text, we experiment with entity types and initialization with pre-trained embeddings, getting positive gains in performance.", 
        "98": "An interesting direction for future work is to combine our models with additional aligned information, such as multiple KBs and to experiment with different components such as CNNs or LSTMs for text encoding.", 
        "99": "Acknowledgements  Alexandros Komninos was supported by EPSRC via an Engineering Doctorate in LSCITS.", 
        "100": "Suresh Manandhar was supported by EPSRC grant EP/I037512/1, A Unified Model of Compositional & Distributional Semantics: Theory and Application."
    }, 
    "document_id": "P17-2051.pdf.json"
}
