{
    "abstract_sentences": {
        "1": "Most existing approaches for zero pronoun resolution are heavily relying on annotated data, which is often released by shared task organizers.", 
        "2": "Therefore, the lack of annotated data becomes a major obstacle in the progress of zero pronoun resolution task.", 
        "3": "Also, it is expensive to spend manpower on labeling the data for better performance.", 
        "4": "To alleviate the problem above, in this paper, we propose a simple but novel approach to automatically generate large-scale pseudo training data for zero pronoun resolution.", 
        "5": "Furthermore, we successfully transfer the cloze-style reading comprehension neural network model into zero pronoun resolution task and propose a two-step training mechanism to overcome the gap between the pseudo training data and the real one.", 
        "6": "Experimental results show that the proposed approach significantly outperforms the state-of-the-art systems with an absolute improvements of 3.1% F-score on OntoNotes 5.0 data."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 102–111 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1010  1 Introduction  Previous works on zero pronoun (ZP) resolution mainly focused on the supervised learning approaches (Han, 2006; Zhao and Ng, 2007; Iida et al., 2007; Kong and Zhou, 2010; Iida and Poesio, 2011; Chen and Ng, 2013).", 
        "2": "However, a major obstacle for training the supervised learning models for ZP resolution is the lack of annotated data.", 
        "3": "An important step is to organize the shared task on anaphora and coreference resolution, such as the ACE evaluations, SemEval-2010 shared task on Coreference Resolution in Multiple Languages (Marta Recasens, 2010) and CoNLL2012 shared task on Modeling Multilingual Unre-\nstricted Coreference in OntoNotes (Sameer Pradhan, 2012).", 
        "4": "Following these shared tasks, the annotated evaluation data can be released for the following researches.", 
        "5": "Despite the success and contributions of these shared tasks, it still faces the challenge of spending manpower on labeling the extended data for better training performance and domain adaptation.", 
        "6": "To address the problem above, in this paper, we propose a simple but novel approach to automatically generate large-scale pseudo training data for zero pronoun resolution.", 
        "7": "Inspired by data generation on cloze-style reading comprehension, we can treat the zero pronoun resolution task as a special case of reading comprehension problem.", 
        "8": "So we can adopt similar data generation methods of reading comprehension to the zero pronoun resolution task.", 
        "9": "For the noun or pronoun in the document, which has the frequency equal to or greater than 2, we randomly choose one position where the noun or pronoun is located on, and replace it with a specific symbol 〈blank〉.", 
        "10": "Let query Q and answer A denote the sentence that contains a 〈blank〉, and the noun or pronoun which is replaced by the 〈blank〉, respectively.", 
        "11": "Thus, a pseudo training sample can be represented as a triple:\n〈D,Q,A〉 (1)\nFor the zero pronoun resolution task, a 〈blank〉 represents a zero pronoun (ZP) in query Q, and A indicates the corresponding antecedent of the ZP.", 
        "12": "In this way, tremendous pseudo training samples can be generated from the various documents, such as news corpus.", 
        "13": "Towards the shortcomings of the previous approaches that are based on feature engineering, we propose a neural network architecture, which is an attention-based neural network model, for zero pronoun resolution.", 
        "14": "Also we propose a two-step\n102\ntraining method, which benefit from both largescale pseudo training data and task-specific data, showing promising performance.", 
        "15": "To sum up, the contributions of this paper are listed as follows.", 
        "16": "• To our knowledge, this is the first time that utilizing reading comprehension neural network model into zero pronoun resolution task.", 
        "17": "• We propose a two-step training approach, namely pre-training-then-adaptation, which benefits from both the large-scale automatically generated pseudo training data and taskspecific data.", 
        "18": "• Towards the shortcomings of the feature engineering approaches, we first propose an attention-based neural network model for zero pronoun resolution.", 
        "19": "2 The Proposed Approach  In this section, we will describe our approach in detail.", 
        "20": "First, we will describe our method of generating large-scale pseudo training data for zero pronoun resolution.", 
        "21": "Then we will introduce twostep training approach to alleviate the gaps between pseudo and real training data.", 
        "22": "Finally, the attention-based neural network model as well as associated unknown words processing techniques will be described.", 
        "23": "2.1 Generating Pseudo Training Data  In order to get large quantities of training data for neural network model, we propose an approach, which is inspired by (Hermann et al., 2015), to automatically generate large-scale pseudo training data for zero pronoun resolution.", 
        "24": "However, our approach is much more simple and general than that of (Hermann et al., 2015).", 
        "25": "We will introduce the details of generating the pseudo training data for zero pronoun resolution as follows.", 
        "26": "First, we collect a large number of documents that are relevant (or homogenous in some sense) to the released OntoNote 5.0 data for zero pronoun resolution task in terms of its domain.", 
        "27": "In our experiments, we used large-scale news data for training.", 
        "28": "Given a certain document D, which is composed by a set of sentences D = {s1, s2, ..., sn},\nwe randomly choose an answer wordA in the document.", 
        "29": "Note that, we restrictA to be either a noun or pronoun, where the part-of-speech is identified using LTP Toolkit (Che et al., 2010), as well as the answer word should appear at least twice in the document.", 
        "30": "Second, after the answer word A is chosen, the sentence that contains A is defined as a queryQ, in which the answer wordA is replaced by a specific symbol 〈blank〉.", 
        "31": "In this way, given the queryQ and documentD, the target of the prediction is to recover the answer A.", 
        "32": "That is quite similar to the zero pronoun resolution task.", 
        "33": "Therefore, the automatically generated training samples is called pseudo training data.", 
        "34": "Figure 1 shows an example of a pseudo training sample.", 
        "35": "In this way, we can generate tremendous triples of 〈D,Q,A〉 for training neural network, without making any assumptions on the nature of the original corpus.", 
        "36": "2.2 Two-step Training  It should be noted that, though we have generated large-scale pseudo training data for neural network training, there is still a gap between pseudo training data and the real zero pronoun resolution task in terms of the query style.", 
        "37": "So we should do some adaptations to our model to deal with the zero pronoun resolution problems ideally.", 
        "38": "In this paper, we used an effective approach to deal with the mismatch between pseudo training data and zero pronoun resolution task-specific data.", 
        "39": "Generally speaking, in the first stage, we use a large amount of the pseudo training data to train a fundamental model, and choose the best model according to the validation accuracy.", 
        "40": "Then we continue to train from the previous best model using the zero pronoun resolution task-specific training data, which is exactly the same domain and query type as the standard zero pronoun resolution task data.", 
        "41": "The using of the combination of proposed pseudo training data and task-specific data, i.e.", 
        "42": "zero pronoun resolution task data, is far more effective than using either of them alone.", 
        "43": "Though there is a gap between these two data, they share many similar characteristics to each other as illustrated in the previous part, so it is promising to utilize these two types of data together, which will compensate to each other.", 
        "44": "The two-step training procedure can be concluded as,\n• Pre-training stage: by using large-scale training data to train the neural network model, we can learn richer word embeddings, as well as relatively reasonable weights in neural networks than just training with a small amount of zero pronoun resolution task training data;\n• Adaptation stage: after getting the best model that is produced in the previous step, we continue to train the model with task-specific data, which can force the previous model to adapt to the new data, without losing much knowledge that has learned in the previous stage (such as word embeddings).", 
        "45": "As we will see in the experiment section that the proposed two-step training approach is effective and brings significant improvements.", 
        "46": "2.3 Attention-based Neural Network Model  Our model is primarily an attention-based neural network model, which is similar to Attentive Reader proposed by (Hermann et al., 2015).", 
        "47": "Formally, when given a set of training triple 〈D,Q,A〉, we will construct our network in the following way.", 
        "48": "Firstly, we project one-hot representation of document D and query Q into a continuous space with the shared embedding matrix We.", 
        "49": "Then we input these embeddings into different bidirectional RNN to get their contextual representations respectively.", 
        "50": "In our model, we used the bidirectional Gated Recurrent Unit (GRU) as RNN implementation (Cho et al., 2014).", 
        "51": "e(x) =We · x, where x ∈ D,Q (2)\n−→ hs = −−−→ GRU(e(x)); ←− hs = ←−−− GRU(e(x)) (3)\nhs = [ −→ hs; ←− hs] (4)\nFor the query representation, instead of concatenating the final forward and backward states as its representations, we directly get an averaged representations on all bi-directional RNN slices, which can be illustrated as\nhquery = 1\nn\nn∑\nt=1\nhquery(t) (5)\nFor the document, we place a soft attention over all words in document (Bahdanau et al., 2014), which indicate the degree to which part of document is attended when filling the blank in the query sentence.", 
        "52": "Then we calculate a weighted sum of all document tokens to get the attended representation of document.", 
        "53": "m(t) = tanh(W · hdoc(t) + U · hquery) (6)\nα(t) = exp(Ws ·m(t))\nn∑ j=1 exp(Ws ·m(j)) (7)\nhdoc att = hdoc · α (8) where variable α(t) is the normalized attention weight at tth word in document, hdoc is a matrix that concatenate all hdoc(t) in sequence.", 
        "54": "hdoc = concat[hdoc(1), hdoc(2), ..., hdoc(t)] (9)\nThen we use attended document representation and query representation to estimate the final answer, which can be illustrated as follows, where V\nis the vocabulary,\nr = concat[hdoc att, hquery] (10)\nP (A|D,Q) ∝ softmax(Wr · r) , s.t.", 
        "55": "A ∈ V (11)\nFigure 2 shows the proposed neural network architecture.", 
        "56": "Note that, for zero pronoun resolution task, antecedents of zero pronouns are always noun phrases (NPs), while our model generates only one word (a noun or a pronoun) as the result.", 
        "57": "To better adapt our model to zero pronoun resolution task, we further process the output result in the following procedure.", 
        "58": "First, for a given zero pronoun, we extract a set of NPs as its candidates utilizing the same strategy as (Chen and Ng, 2015).", 
        "59": "Then, we use our model to generate an answer (one word) for the zero pronoun.", 
        "60": "After that, we go through all the candidates from the nearest to the far-most.", 
        "61": "For an NP candidate, if the produced answer is its head word, we then regard this NP as the antecedent of the given zero pronoun.", 
        "62": "By doing so, for a given zero pronoun, we generate an NP as the prediction of its antecedent.", 
        "63": "2.4 Unknown Words Processing  Because of the restriction on both memory occupation and training time, it is usually suggested to use a shortlist of vocabulary in neural network training.", 
        "64": "However, we often replace the out-ofvocabularies to a unique special token, such as 〈unk〉.", 
        "65": "But this may place an obstacle in real\nworld test.", 
        "66": "When the model predicts the answer as 〈unk〉, we do not know what is the exact word it represents in the document, as there may have many 〈unk〉s in the document.", 
        "67": "In this paper, we propose to use a simple but effective way to handle unknown words issue.", 
        "68": "The idea is straightforward, which can be illustrated as follows.", 
        "69": "• Identify all unknown words inside of each 〈D,Q,A〉;\n• Instead of replacing all these unknown words into one unique token 〈unk〉, we make a hash table to project these unique unknown words to numbered tokens, such as 〈unk1〉, 〈unk2〉, ..., 〈unkN〉 in terms of its occurrence order in the document.", 
        "70": "Note that, the same words are projected to the same unknown word tokens, and all these projections are only valid inside of current sample.", 
        "71": "For example, 〈unk1〉 indicate the first unknown word, say “apple”, in the current sample, but in another sample the 〈unk1〉 may indicate the unknown word “orange”.", 
        "72": "That is, the unknown word labels are indicating position features rather than the exact word;\n• Insert these unknown marks in the vocabulary.", 
        "73": "These marks may only take up dozens of slots, which is negligible to the size of shortlists (usually 30K ∼ 100K).", 
        "74": "We take one sentence “The weather of today is not as pleasant as the weather of yesterday.” as an example to show our unknown word processing method, which is shown in Figure 3.", 
        "75": "If we do not discriminate the unknown words and assign different unknown words with the same token 〈unk〉, it would be impossible for us to know what is the exact word that 〈unk〉 represents for in the real test.", 
        "76": "However, when using our proposed unknown word processing method, if the model predicts a 〈unkX〉 as the answer,\nwe can simply scan through the original document and identify its position according to its unknown word number X and replace the 〈unkX〉 with the real word.", 
        "77": "For example, in Figure 3, if we adopt original unknown words processing method, we could not know whether the 〈unk〉 is the word “weather” or “pleasant”.", 
        "78": "However, when using our approach, if the model predicts an answer as 〈unk1〉, from the original text, we can know that 〈unk1〉 represents the word “weather”.", 
        "79": "3 Experiments    3.1 Data  In our experiments, we choose a selection of public news data to generate large-scale pseudo training data for pre-training our neural network model (pre-training step)1.", 
        "80": "In the adaptation step, we used the official dataset OntoNotes Release 5.02 which is provided by CoNLL-2012 shared task, to carry out our experiments.", 
        "81": "The CoNLL2012 shared task dataset consists of three parts: a training set, a development set and a test set.", 
        "82": "The datasets are made up of 6 different domains, namely Broadcast News (BN), Newswires (NW), Broadcast Conversations (BC), Telephone Conversations (TC), Web Blogs (WB), and Magazines (MZ).", 
        "83": "We closely follow the experimental settings as (Kong and Zhou, 2010; Chen and Ng, 2014, 2015, 2016), where we treat the training set for training and the development set for testing, because only the training and development set are annotated with ZPs.", 
        "84": "The statistics of training and testing data is shown in Table 1 and 2 respectively.", 
        "85": "3.2 Neural Network Setups  Training details of our neural network models are listed as follows.", 
        "86": "1The news data is available at http://www.sogou.", 
        "87": "com/labs/dl/cs.html\n2http://catalog.ldc.upenn.edu/ LDC2013T19\nDocs Sentences Words AZPs\nTest 172 6,083 110K 1,713\nAll models are trained on Tesla K40 GPU.", 
        "88": "Our model is implemented with Theano (Theano Development Team, 2016) and Keras (Chollet, 2015).", 
        "89": "3.3 Experimental results  Same to the previous researches that are related to zero pronoun resolution, we evaluate our system performance in terms of F-score (F).", 
        "90": "We focus on AZP resolution process, where we assume that gold AZPs and gold parse trees are given3.", 
        "91": "The same experimental setting is utilized in (Chen and Ng, 2014, 2015, 2016).", 
        "92": "The overall results are shown in Table 3, where the performances of each domain are listed in detail and overall performance is also shown in the last column.", 
        "93": "• Overall Performance We employ four Chinese ZP resolution baseline systems on OntoNotes 5.0 dataset.", 
        "94": "As we can\n3All gold information are provided by the CoNLL-2012 shared task dataset\nsee that our model significantly outperforms the previous state-of-the-art system (Chen and Ng, 2016) by 3.1% in overall F-score, and substantially outperform the other systems by a large margin.", 
        "95": "When observing the performances of different domains, our approach also gives relatively consistent improvements among various domains, except for BN and TC with a slight drop.", 
        "96": "All these results approve that our proposed approach is effective and achieves significant improvements in AZP resolution.", 
        "97": "In our quantitative analysis, we investigated the reasons of the declines in the BN and TC domain.", 
        "98": "A primary observation is that the word distributions in these domains are fairly different from others.", 
        "99": "The average document length of BN and TC are quite longer than other domains, which suggest that there is a bigger chance to have unknown words than other domains, and add difficulties to the model training.", 
        "100": "Also, we have found that in the BN and TC domains, the texts are often in oral form, which means that there are many irregular expressions in the context.", 
        "101": "Such expressions add noise to the model, and it is difficult for the model to extract useful information in these contexts.", 
        "102": "These phenomena indicate that further improvements can be obtained by filtering stop words in contexts, or increasing the size of task-specific data, while we leave this in the future work.", 
        "103": "• Effect of UNK processing As we have mentioned in the previous section, traditional unknown word replacing methods are vulnerable to the real word test.", 
        "104": "To alleviate this issue, we proposed the UNK processing mechanism to recover the UNK tokens to the real words.", 
        "105": "In Table 4, we compared the performance that with and without the proposed UNK processing,\nto show whether the proposed UNK processing method is effective.", 
        "106": "As we can see that, by applying our UNK processing mechanism, the model do learned the positional features in these lowfrequency words, and brings over 3% improvements in F-score, which indicated the effectiveness of our UNK processing approach.", 
        "107": "• Effect of Domain Adaptation We also tested out whether our domain adaptation method is effective.", 
        "108": "In this experiments, we used three different types of training data: only pseudo training data, only task-specific data, and our adaptation method, i.e.", 
        "109": "using pseudo training data in the pre-training step and task-specific data for domain adaptation step.", 
        "110": "The results are given in Table 5.", 
        "111": "As we can see that, using either pseudo training data or task-specific data alone can not bring inspiring result.", 
        "112": "By adopting our domain adaptation method, the model could give significant improvements over the other models, which demonstrate the effectiveness of our proposed two-step training approach.", 
        "113": "An intuition behind this phenomenon is that though pseudo training data is fairly big enough to train a reliable model parameters, there is still a gap to the real zero pronoun resolution tasks.", 
        "114": "On the contrary, though task-specific training data is exactly the same type as the real test, the quantity is not enough to train a reasonable model (such as word embedding).", 
        "115": "So it is better to make use of both to\ntake the full advantage.", 
        "116": "However, as the original task-specific data is fairly small compared to pseudo training data, we also wondered if the large-scale pseudo training data is only providing rich word embedding information.", 
        "117": "So we use the large-scale pseudo training data for embedding training using GloVe toolkit (Pennington et al., 2014), and initialize the word embeddings in the “only task-specific data” system.", 
        "118": "From the result we can see that the pseudo training data provide more information than word embeddings, because though we used GloVe embeddings in “only task-specific data”, it still can not outperform the system that uses domain adaptation which supports our claim.", 
        "119": "4 Error Analysis  To better evaluate our proposed approach, we performed a qualitative analysis of errors, where two major errors are revealed by our analysis, as discussed below.", 
        "120": "4.1 Effect of Unknown Words  Our approach does not do well when there are lots of 〈unk〉s in the context of ZPs, especially when the 〈unk〉s appears near the ZP.", 
        "121": "An example is given below, where words with # are regarded as 〈unk〉s in our model.", 
        "122": "φ 登上# 太平山# 顶 , 将香港岛# 和维多 利亚港# 的美景尽收眼底。 φ Successfully climbed# the peak of [Taiping Mountain]#, to have a panoramic view of the beauty of [Hong Kong Island]# and [Victoria Harbour]#.", 
        "123": "In this case, the words “登上/climbed” and “太 平山/Taiping Mountain” that appears immediately after the ZP “φ” are all regarded as 〈unk〉s in our model.", 
        "124": "As we model the sequence of words by RNN, the 〈unk〉s make the model more difficult to capture the semantic information of the sentence, which in turn influence the overall performance.", 
        "125": "Especially for the words that are near\nthe ZP, which play important roles when modeling context information for the ZP.", 
        "126": "By looking at the word “顶/peak”, it is hard to comprehend the context information, due to the several surrounding 〈unk〉s.", 
        "127": "Though our proposed unknown words processing method is effective in empirical evaluation, we think that more advanced method for unknown words processing would be of a great help in improving comprehension of the context.", 
        "128": "4.2 Long Distance Antecedents  Also, our model makes incorrect decisions when the correct antecedents of ZPs are in long distance.", 
        "129": "As our model chooses answer from words in the context, if there are lots of words between the ZP and its antecedent, more noise information are introduced, and adds more difficulty in choosing the right answer.", 
        "130": "For example:\n我帮不了那个人 ... ...那天结束后 φ 回到 家中。 I can’t help that guy ... ... After that day, φ return home.", 
        "131": "In this case, the correct antecedent of ZP “φ” is the NP candidate “我/I”.", 
        "132": "By seeing the contexts, we observe that there are over 30 words between the ZP and its antecedent.", 
        "133": "Although our model does not intend to fill the ZP gap only with the words near the ZP, as most of the antecedents appear just a few words before the ZPs, our model prefers the nearer words as correct antecedents.", 
        "134": "Hence, once there are lots of words between ZP and its nearest antecedent, our model can sometimes make wrong decisions.", 
        "135": "To correctly handle such cases, our model should learn how to filter the useless words and enhance the learning of longterm dependency.", 
        "136": "5 Related Work    5.1 Zero pronoun resolution  For Chinese zero pronoun (ZP) resolution, early studies employed heuristic rules to Chinese ZP resolution.", 
        "137": "Converse (2006) proposes a rule-based method to resolve the zero pronouns, by utilizing Hobbs algorithm (Hobbs, 1978) in the CTB documents.", 
        "138": "Then, supervised approaches to this task have been vastly explored.", 
        "139": "Zhao and Ng (2007) first present a supervised machine learning approach to the identification and resolution of Chinese ZPs.", 
        "140": "Kong and Zhou (2010) develop a tree-kernel based approach for Chinese ZP resolution.", 
        "141": "More recently, unsupervised approaches\nhave been proposed.", 
        "142": "Chen and Ng (2014) develop an unsupervised language-independent approach, utilizing the integer linear programming to using ten overt pronouns.", 
        "143": "Chen and Ng (2015) propose an end-to-end unsupervised probabilistic model for Chinese ZP resolution, using a salience model to capture discourse information.", 
        "144": "Also, there have been many works on ZP resolution for other languages.", 
        "145": "These studies can be divided into rule-based and supervised machine learning approaches.", 
        "146": "Ferrández and Peral (2000) proposed a set of hand-crafted rules for Spanish ZP resolution.", 
        "147": "Recently, supervised approaches have been exploited for ZP resolution in Korean (Han, 2006) and Japanese (Isozaki and Hirao, 2003; Iida et al., 2006, 2007; Sasano and Kurohashi, 2011).", 
        "148": "Iida and Poesio (2011) developed a cross-lingual approach for Japanese and Italian ZPs where an ILPbased model was employed to zero anaphora detection and resolution.", 
        "149": "In sum, most recent researches on ZP resolution are supervised approaches, which means that their performance highly relies on large-scale annotated data.", 
        "150": "Even for the unsupervised approach (Chen and Ng, 2014), they also utilize a supervised pronoun resolver to resolve ZPs.", 
        "151": "Therefore, the advantage of our proposed approach is obvious.", 
        "152": "We are able to generate large-scale pseudo training data for ZP resolution, and also we can benefit from the task-specific data for fine-tuning via the proposed two-step training approach.", 
        "153": "5.2 Cloze-style Reading Comprehension  Our neural network model is mainly motivated by the recent researches on cloze-style reading comprehension tasks, which aims to predict one-word answer given the document and query.", 
        "154": "These models can be seen as a general model of mining the relations between the document and query, so it is promising to combine these models to the specific domain.", 
        "155": "A representative work of cloze-style reading comprehension is done by Hermann et al.", 
        "156": "(2015).", 
        "157": "They proposed a methodology for obtaining large quantities of 〈D,Q,A〉 triples.", 
        "158": "By using this method, a large number of training data can be obtained without much human intervention, and make it possible to train a reliable neural network.", 
        "159": "They used attention-based neural networks for this task.", 
        "160": "Evaluation on CNN/DailyMail datasets showed that their approach is much effective than\ntraditional baseline systems.", 
        "161": "While our work is similar to Hermann et al.", 
        "162": "(2015), there are several differences which can be illustrated as follows.", 
        "163": "Firstly, though we both utilize the large-scale corpus, they require that the document should accompany with a brief summary of it, while this is not always available in most of the document, and it may place an obstacle in generating limitless training data.", 
        "164": "In our work, we do not assume any prerequisite of the training data, and directly extract queries from the document, which makes it easy to generate large-scale training data.", 
        "165": "Secondly, their work mainly focuses on reading comprehension in the general domain.", 
        "166": "We are able to exploit large-scale training data for solving problems in the specific domain, and we proposed two-step training method which can be easily adapted to other domains as well.", 
        "167": "6 Conclusion  In this study, we propose an effective way to generate and exploit large-scale pseudo training data for zero pronoun resolution task.", 
        "168": "The main idea behind our approach is to automatically generate large-scale pseudo training data and then utilize an attention-based neural network model to resolve zero pronouns.", 
        "169": "For training purpose, two-step training approach is employed, i.e.", 
        "170": "a pre-training and adaptation step, and this can be also easily applied to other tasks as well.", 
        "171": "The experimental results on OntoNotes 5.0 corpus are encouraging, showing that the proposed model and accompanying approaches significantly outperforms the stateof-the-art systems.", 
        "172": "The future work will be carried out on two main aspects: First, as experimental results show that the unknown words processing is a critical part in comprehending context, we will explore more effective way to handle the UNK issue.", 
        "173": "Second, we will develop other neural network architecture to make it more appropriate for zero pronoun resolution task.", 
        "174": "Acknowledgements  We would like to thank the anonymous reviewers for their thorough reviewing and proposing thoughtful comments to improve our paper.", 
        "175": "This work was supported by the National 863 Leading Technology Research Project via grant 2015AA015407, Key Projects of National Natural Science Foundation of China via grant 61632011,\nand National Natural Science Youth Foundation of China via grant 61502120."
    }, 
    "document_id": "P17-1010.pdf.json"
}
