{
    "abstract_sentences": {
        "1": "We examine differences in portrayal of characters in movies using psycholinguistic and graph theoretic measures computed directly from screenplays.", 
        "2": "Differences are examined with respect to characters’ gender, race, age and other metadata.", 
        "3": "Psycholinguistic metrics are extrapolated to dialogues in movies using a linear regression model built on a set of manually annotated seed words.", 
        "4": "Interesting patterns are revealed about relationships between genders of production team and the gender ratio of characters.", 
        "5": "Several correlations are noted between gender, race, age of characters and the linguistic metrics."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1669–1678 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1153  1 Introduction  Movies are often described as having the power to influence individual beliefs and values.", 
        "2": "In (Cape, 2003), the authors assert movies’ influence in both creating new thinking patterns in previously unexplored social phenomena, especially in children, as well as their ability to update an individual’s existing social boundaries based on what is shown on screen as the ”norm”.", 
        "3": "Some authors claim the inverse (Wedding and Boyd, 1999): that movies reflect existing cultural values of the society, adding weight to their ability in influencing individual beliefs of what is accepted as the norm.", 
        "4": "As a result, they are studied in multiple disciplines to analyze their influence.", 
        "5": "Movies are particularly scrutinized in aspects involving negative stereotyping (Cape, 2003; Dimnik and Felton, 2006; Ter Bogt et al., 2010; Hedley, 1994) since this may introduce questionable beliefs in viewers.", 
        "6": "Negative stereotyping is believed to impact society in multiple aspects such as self-induced undermining of ability (Davies\net al., 2005) as well as causing forms of prejudice that can impact leadership or employment prospects (Eagly and Karau, 2002; Niven, 2006).", 
        "7": "Studies in analyzing stereotyping in movies typically rely on collecting manual annotations on a small set of movies on which hypotheses tests are conducted (Behm-Morawitz and Mastro, 2008; Benshoff and Griffin, 2011; Hooks, 2009).", 
        "8": "In this work, we present large scale automated analyses of movie characters using language used in dialogs to study stereotyping along factors such as gender, race and age.", 
        "9": "Language use has been long known as a strong indicator of the speaker’s psychological and emotional state (Gottschalk and Gleser, 1969) and is well studied in a number of applications such as automatic personality detection (Mairesse et al., 2007) and psychotherapy (Xiao et al., 2015; Pennebaker et al., 2003).", 
        "10": "Computational analysis of language has been particularly popular thanks to advancements in computing and the ease of conducting large scale analysis of text on computers (Pennebaker et al., 2015).", 
        "11": "To perform our analysis, we construct a new movie screenplay corpus 1 that includes nearly 1000 movie scripts obtained from the Internet.", 
        "12": "For each movie in the corpus, we obtain additional metadata such as cast, genre, writers and directors, and also collect actor level demographic information such as gender, race and age.", 
        "13": "We use two kinds of measures in our analyses: (i) linguistic metrics that capture various psychological constructs and behaviors, estimated using dialogues from the screenplay; and (ii) graph theoretic metrics estimated from character network graphs, which are constructed to model intercharacter interactions in the movie.", 
        "14": "The linguistic metrics include psycholinguistic normatives,\n1http://sail.usc.edu/mica/text_corpus_ release.php\n1669\nwhich provide word level scores on a numeric scale which are then aggregated at the dialog level, and metrics from the Linguistic Inquiry and Word Counts tool (LIWC) which capture usage of well studied stereotyping dimensions such as sexuality.", 
        "15": "We estimate centrality metrics from the character network graphs to measure relative importance of the different characters, which are analyzed with respect to the different factors of gender, race and age.", 
        "16": "The main contributions of this work are as follows: (i) we present a scalable analysis of differences in portrayal of various character subgroups in movies using their language use, (ii) we construct a new corpus with detailed annotations for our analysis and (iii) we highlight several differences in the portrayal of characters along factors such as race, age and gender.", 
        "17": "The rest of the paper is organized as follows: in section 2 we describe related work.", 
        "18": "We explain the data collection process in section 3 and experimental procedure in section 4.", 
        "19": "We explain results in section 5 and conclude in section 6.", 
        "20": "2 Related work  Previous works in studying representation in movies largely focus on relative frequencies, particularly on character gender.", 
        "21": "In (Smith et al., 2014), the authors studied 120 movies from around the globe which were manually annotated to capture information about character gender, age, careers, writer gender and director gender.", 
        "22": "However, since the annotations are done manually, collecting information on new movies is a laborious process.", 
        "23": "We avoided this by estimating the metadata computationally, enabling us to scale up efficiently.", 
        "24": "Automated analyses of movies using computational techniques to analyze representation has recently gained some attention.", 
        "25": "In (NYFA, 2013; Polygraph, 2016), the authors examine differences in relative frequency of female characters and note considerable disparities in gender ratio in these movies.", 
        "26": "However, the analyses there too are limited to comparing relative frequencies.", 
        "27": "Our work is closest to (Ramakrishna et al., 2015) where the authors study difference in language used in movies across genders, but their analysis is one dimensional.", 
        "28": "In our work we perform fine grained comparisons of character portrayal using multiple language based metrics along factors such as gen-\nder, race and age on a newly created corpus.", 
        "29": "3 Data    3.1 Raw screenplay  We fetch movie screenplay files from two primary sources: imsdb (IMSDb, 2017) and daily scripts (DailyScript, 2017).", 
        "30": "In total, we retrieved 1547 movies.", 
        "31": "After removing duplicates we retain 1434 raw screenplay files, of which 489 were corrupted or empty leaving us with 945 usable screenplays.", 
        "32": "Tables 1, 3 and 4 list statistics about the corpus.", 
        "33": "3.2 Script parser  The screenplay files are formatted in human readable format and include dialogues tagged with character names along with auxiliary information of the scene such as shot location (interior/exterior), character placement and scene context.", 
        "34": "The screenplays are from a diverse set of writers and include a significant amount of noise and inconsistencies in their structure.", 
        "35": "To extract the relevant information, we developed a text parser 2 that accepts raw script files and outputs utterances along with character names.", 
        "36": "We ignore scene context information and primarily focus on spoken dialogues to study language usage in the movies.", 
        "37": "3.3 Movie and character meta-data  For each parsed movie, we fetch relevant metadata such as year of release, directors, writers, and producers from the Internet Movie Database (IMDb, 2017).", 
        "38": "Since most screenplays are drafts and subject to revisions such as changes in character names, matching them to an entry from IMDb is nontrivial.", 
        "39": "We first start with a list of all movies that have a close match with the screenplay name; given this list of potential matches we compute name alignment scores for each entry as the percentage of character names from the script found online.", 
        "40": "The character names are mapped using term frequency-inverse document frequency (TFIDF) to compute the name alignment score following (Cohen et al., 2003).", 
        "41": "Finally, the entry with highest alignment score is chosen.", 
        "42": "For all actors listed in the aligned result, we collect their age, gender and race as detailed below.", 
        "43": "2https://bitbucket.org/anil_ ramakrishna/scriptparser  3.3.1 Gender  Given the names of actors and other members of production team found in a movie, we use a name based gender classifier to predict their gender information.", 
        "44": "Table 4 lists statistics on gender ratios for the production team in the corpus.", 
        "45": "Femaleto-male ratios were found in close agreement with previous works (Smith et al., 2014).", 
        "46": "As mentioned above, several screenplays get revised during production.", 
        "47": "In particular character names get changed, sometimes even gender.", 
        "48": "As a result, some characters may not be aligned to the correct entry from IMDb.", 
        "49": "In addition, digitized screenplays sometime include significant noise thanks to optical character recognition errors, leading to character names failing to align with entries from IMDb.", 
        "50": "To correct these, we perform manual cleanup of all the movie alignments, fix incorrect gender maps, and manually force match movies if they’re mapped to the wrong IMDb entry.", 
        "51": "3.3.2 Age  We also extract age for each actor to study possible age related biases in movies.", 
        "52": "We include age in our analysis since studies report preferential biases with age in employment particularly when combined with gender (Lincoln and Allen, 2004).", 
        "53": "In addition, there may be biases in portrayal of specific age groups when combined with gender and race.", 
        "54": "For each actor in the mapped IMDb entry, we collect his/her birthday information.", 
        "55": "We subtract the movie production year obtained also from IMDb from the actor’s birthday to get an estimate of the actor’s age during the movie’s production.", 
        "56": "We note however that the age obtained in this manner may be different from the portrayed age of the character.", 
        "57": "To account for this we bin the actors into fifteen year age groups before our analysis, since its generally unlikely to have actors further than fifteen years from their portrayed age.", 
        "58": "3.3.3 Race  We parse ethnicity information from the website (ethnicelebs.com, 2017), which includes ethnicity for approximately 8000 different actors.", 
        "59": "The information obtained from this site is primarily submitted by independent users, and exhibits significant amount of variation among the possible ethnicities with about 750 different unique ethnicity types.", 
        "60": "Since we are more specifically interested in\nracial representations, we map the ethnicity types to race using Amazon Mechanical Turk (MTurk).", 
        "61": "We use a modified version of the racial categories from the US census which are listed in Table 1 along with frequency of actors from each racial category in our corpus.", 
        "62": "The ethnicities obtained from the site above primarily cover major actors with a fan base with no information for several actors who play minor roles.", 
        "63": "We annotate racial information for nearly 2000 such actors using MTurk with two annotations for each actor, manually correcting nearly 400 cases in which the annotators disagreed.", 
        "64": "4 Experiments    4.1 Character portrayal using language  To study differences in portrayal of characters, we use two different metrics: psycholinguistic normatives, which are designed to capture the underlying emotional state of the speaker; and LIWC metrics, which provide a measure of the speaker’s affinity to different social and physical constructs such as religion and death.", 
        "65": "We explain these two metrics in detail below.", 
        "66": "4.1.1 Psycholinguistic normatives  Psycholinguistic normatives provide a measure of various emotional and psychological constructs of the speaker, such as arousal, valence, concreteness, intelligibility, etc.", 
        "67": "and are computed entirely from language usage.", 
        "68": "They are relatively easy to compute, provide reliable indicators of the above constructs, and have been used in a variety of tasks in natural language processing such as information retrieval (Tanaka et al., 2013), sentiment analysis (Nielsen, 2011), text based personality prediction (Mairesse et al., 2007) and opinion mining.", 
        "69": "The numeric ratings are typically extrapolated from a small set of keywords which are annotated\nby psychologists.", 
        "70": "Manual annotations of word ratings is a laborious process and is hence limited to a few thousand words (Clark and Paivio, 2004).", 
        "71": "Automatic extrapolation of these ratings to words not covered by the manual annotations can be done using structured databases which provide relationships between words such as synonymy and hyponymy (Liu et al., 2014), or using context based semantic similarity.", 
        "72": "In this work, we use the model described in (Malandrakis and Narayanan, 2015) where the authors use linear regression to compute normative scores for an input word w based on its similarity to a set of concept words si.", 
        "73": "r(w) = θ0 + ∑\ni\nθi · sim(w, si) (1)\nwhere, r(w) is the computed normative score for word w, θ0 and θi are regression coefficients and sim is similarity between the given word w and concept words si.", 
        "74": "The concept words can either be hand crafted suitably for the domain or chosen automatically from data.", 
        "75": "Similar to (Malandrakis and Narayanan, 2015), we create training data by posing queries on the Yahoo search engine from words of the aspell spell checker of which top 500 previews are collected from each query.", 
        "76": "From this corpus, the top 10000 most frequent words with atleast 3 characters were were used as concept words in extrapolation of all the norms.", 
        "77": "The linear regression model is trained using normative ratings for the manually annotated words by computing their similarity to the concept words.", 
        "78": "The similarity function sim is the cosine of binary context vectors with window size 1.", 
        "79": "The computed normatives are in the range [−1, 1].", 
        "80": "The psycholinguistic normatives used in this work are listed in Table 2.", 
        "81": "Valence is the degree of positive or negative emotion evoked by the word.", 
        "82": "Arousal is a measure of excitement in the speaker.", 
        "83": "Valence and arousal combined are common indicators used to map emotions.", 
        "84": "Age of Acquisition refers to the average age at which the word is learned and it denotes sophistication of language use.", 
        "85": "Gender Ladenness is a measure of masculine or feminine association of a word.", 
        "86": "10 fold Cross Validation tests are performed on the normative scores predicted by the regression model given by equation 1.", 
        "87": "Correlation coefficients of the selected normatives with the manual annota-\ntions are as follows: Arousal (0.7), Valence (0.88), Age of Acquisition (0.86) and Gender Ladenness (0.8).", 
        "88": "The high correlations render confidence in the psycholinguistic models.", 
        "89": "In our experiments, the normative scores are computed on content words from each dialog.", 
        "90": "We filter out all words other than nouns, verbs, adjectives and adverbs.", 
        "91": "Word level scores are aggregated at the dialog level using arithmetic mean.", 
        "92": "4.1.2 Linguistic inquiry and word counts (LIWC)  LIWC is a text processing application that processes raw text and outputs percentage of words from the text that belong to linguistic, affective, perceptual and other dimensions.", 
        "93": "It operates by maintaining a diverse set of dictionaries of words each belonging to a unique dimension.", 
        "94": "Input texts are processed word by word; each word is searched in the internal dictionaries and the corresponding counter is incremented if a word is found in that dictionary.", 
        "95": "Finally, percentage of words from the input text belonging to the different dimensions are returned.", 
        "96": "For our experiments, we treat each utterance in the movie as a unique document and obtain values for the LIWC metrics.", 
        "97": "Table 2 lists the metrics used in our experiments.", 
        "98": "4.2 Character network analytics  In order to study representation of the different subgroups as major characters in movies, we construct a network of interaction between characters using which we compute importance measures for each character.", 
        "99": "From each movie script, we construct an undirected and unweighted graph where nodes represent characters.", 
        "100": "We place an edge eab if two characters A and B interact at least once in the movie.", 
        "101": "For our experiments we assume interaction between A and B if there is at least one scene in which one speaks right after another.", 
        "102": "This graph creation method based on scene cooccurrence is similar to the approach used in (Beveridge and Shan, 2016).", 
        "103": "We estimate different measures of a node’s importance within the character network and use it as proxy for the character’s importance.", 
        "104": "We employ two types of centralities: betweenness centrality, the number of shortest paths that go through the node, and degree centrality, which is the number of edges incident on a node.", 
        "105": "These centrality measurements have been previously used in the con-\ntext of books, films and comics (Beveridge and Shan, 2016; Bonato et al., 2016; Alberich et al., 2002; Ribeiro et al., 2016).", 
        "106": "5 Results  We study differences in various subgroups along multiple facets.", 
        "107": "We first report results on differences in character ratios from each subgroup since this has implications on employment and can have social-economic effects (Niven, 2006).", 
        "108": "We next use psycholinguistic normatives and LIWC metrics described in the previous section to study differences in character portrayal along the primary markers: age, gender and race.", 
        "109": "We finally use the graph theoretic centrality measures to estimate characters’ importance and analyze differences among the different subgroups.", 
        "110": "Since we are interested in character level analytics, we treat all utterances from the character as a single document to compute the aggregate language metrics.", 
        "111": "We perform all our experiments using non-parametric statistical tests since the data fails to satisfy preconditions such as normality and homoscedasticity required for parametric tests such as ANOVA.", 
        "112": "5.1 Difference in relative frequency of subgroups  We first filter our characters with unknown gender/race/age leaving us with 6907 characters in to-\ntal.", 
        "113": "Table 3 lists the number of characters and dialogues from each gender.", 
        "114": "As noted in previous studies, the ratio is considerably skewed with male actors having nearly twice as many roles and dialogues compared to female actors.", 
        "115": "Table 4 lists relative frequency among male and female members of the production team.", 
        "116": "Table 1 lists the percentage of actors belonging to different racial categories in the corpus.", 
        "117": "We perform chi-squared tests between character gender and gender of production team members who are most likely to influence characters gender: writers, directors and casting directors.", 
        "118": "Table 5 shows contingency tables with gender frequencies for each of these cases along with percentages.", 
        "119": "Note we filter out nearly 100 movies for this test in which the gender of the production team members was unknown.", 
        "120": "Of the three tests we perform, character gender distributions for writer and director genders are significantly different from the overall character gender distribution (p < 10−10 and p < 10−4 respectively; α = 0.05).", 
        "121": "In particular, female writers and directors appear to produce movies with relatively balanced gender proportions (still slightly skewed towards the male side) compared to male writers\n0 100\n200\n300\n400\n500 600 fe m al\ne < 10−5\n0\n1\n2\n3\n4\n5 0.0081\n0\n5\n10\n15\n20\n25\n30\n35\n40\n45 < 10−5\n0\n1\n2\n3\n4\n5 0.12\n0\n10\n20\n30\n40\n50\n60\n70\n80 0.0034\n0\n1\n2\n3\n4\n5\n6 0.12\n0\n5\n10\n15\n20\n25 0.09\n0\n1\n2\n3\n4\n5 *\ncaucasian 0\n100\n200\n300\n400\n500\n600\nm al\ne\neastasian 0\n1\n2\n3\n4\n5\nmixed 0\n5\n10\n15\n20\n25\n30\n35\n40\n45\nnativeamerican 0\n1\n2\n3\n4\n5\nafrican 0\n10\n20\n30\n40\n50\n60\n70\n80\nsouthasian 0\n1\n2\n3\n4\n5\n6\nlatino 0\n5\n10\n15\n20\n25\npacificislander 0\n1\n2\n3\n4\n5\nFigure 1: Histogram of age for actors belonging to different gender and racial categories with p-values on top; significant values at α = 0.05 are highlighted; *: no test performed since the female group is empty\nand directors.", 
        "122": "Casting directors however appear to have no influence on gender of the characters.", 
        "123": "Studies report potential biases in actor employment with age (Lincoln and Allen, 2004), particularly in female actors.", 
        "124": "To evaluate this, we plot histograms of age for male and female characters for each of the racial categories in Figure 1.", 
        "125": "The distribution of age for each category appears approximately normal, except for the nativeamerican and pacificislander character groups which have a small sample size.", 
        "126": "For most categories of race, the mode of the distribution for female actors appears to be at least five years less than the mode for male actors.", 
        "127": "To check for significance in this difference we conduct Mann-Whitney U tests on male and female age groups for each race with the resulting p-values shown in the figure.", 
        "128": "We ignore characters belonging to the pacificislander racial group since there are no female actors from this race in our corpus.", 
        "129": "The difference in age groups is significant in most categories with large sample sizes, suggesting possible preferences towards casting younger people when casting female actors.", 
        "130": "5.2 Character portrayal using language  To analyze differences in portrayal of subgroups, we compute psycholinguistic normatives and LIWC metrics as described before.", 
        "131": "For each of the metrics listed in Table 2, we conduct non-\nparametric hypothesis tests to look for differences in samples from the subgroups.", 
        "132": "We treat the different metrics independently, performing statistical tests along each separately.", 
        "133": "We avoid statistical tests combining two or more factors since some of the resulting groups would be empty due to the skewed group sizes along race.", 
        "134": "We defer such analyses to future work.", 
        "135": "5.2.1 Gender  We perform Mann-Whitney U tests between male and female characters along the nine dimensions and the results are shown in Table 6.", 
        "136": "In all of\nthe cases, higher values imply higher degree of the corresponding dimension, except for valence in which higher values imply positive valence (attractiveness) and lower values imply negative valence (averseness).", 
        "137": "The difference between male and female characters are statistically significant along six of the nine dimensions.", 
        "138": "The results indicate slightly higher age of acquisition scores for male characters.", 
        "139": "Regarding gender ladenness, male characters appear to be closer to the masculine side than female characters on average, agreeing with previous results.", 
        "140": "Our results also indicate that female character utterances tend to be more positive in valence compared to male characters while male characters seem to have higher percentage of words related to achievement.", 
        "141": "In addition, male characters appear to be more frequent in using words related to death as well as swear words compared to female characters.", 
        "142": "5.2.2 Race  To study differences in portrayal of the racial categories, we perform Kruskal-Wallis test (a generalization of Mann-Whitney U test for more than two groups) on each of the nine metrics with race as the independent variable.", 
        "143": "We found significant differences in distribution of samples for gender ladenness, sexuality, religion and swear words.", 
        "144": "For gender ladenness, caucasian and mixed race characters have significantly higher medians than african and nativeamerican characters.", 
        "145": "In sexuality, latino and mixed race characters were found to have higher median than at least one other racial group with significance indicating a higher degree of sexualization in these characters.", 
        "146": "Eastasian characters were found to be significantly lower than medians of three other races (caucasian, african and mixed) in using words with religious connotations.", 
        "147": "In swear word usage, the only significant difference found is between caucasian and african characters with african characters using higher percentage of swear words.", 
        "148": "In all of the above cases, significance was tested at α = 0.05.", 
        "149": "5.2.3 Age  To examine the relationship between age and the different metrics, we build separate linear regression models with each dimension as the dependent variable and character age as the independent variable.", 
        "150": "Table 7 reports regression coefficients for age along with p values for each dimension.", 
        "151": "The\npositive coefficient for age of acquisition indicates an increase in sophistication of word usage with age.", 
        "152": "Arousal, on the other hand, has a significant negative coefficient indicating a decrease in activation, on average, as character age increases.", 
        "153": "Gender ladenness also has a significant negative coefficient indicating that as age increases, the average gender ladenness value decreases.", 
        "154": "Similar trends are observed for sexuality and swear word usage.", 
        "155": "Usage of words related to achievement and religion however, seem to increase with age.", 
        "156": "5.3 Character network analytics  To study differences in major roles assigned to the different subgroups, we compute two centrality metrics from the character network graph constructed for each movie: degree centrality measures the number of unique characters that interact with a given character, betweenness centrality measures how much would the plot be disrupted if said character was to disappear completely, i.e., how important is a character to the overall plot.", 
        "157": "Similar to the language analyses from previous section, we test differences in these metrics along the three factors of gender, race and age.", 
        "158": "All statistical tests reported below are conducted at α = 0.05.", 
        "159": "5.3.1 Gender  Male characters were found to have higher values in the two metrics compared to female characters but the differences were not statistically significant.", 
        "160": "Motivated by studies (Sapolsky et al., 2003; Linz et al., 1984) which report interactions between genre and gender, we performed MannWhitney U tests between male and female char-\nacters given different genres.", 
        "161": "To avoid type I errors we corrected for multiple comparisons using the Holm-Bonferroni correction.", 
        "162": "Significant differences were found only in horror movies where the median degree centrality for females (0.221) was higher than the median degree centrality of males (0.166).", 
        "163": "This is in agreement with prior studies which report female characters to have a more prominent presence in horror movies, particularly as victims of violent scenes (Welsh and Brantford, 2009).", 
        "164": "5.3.2 Race  To examine differences in major roles across the racial categories, we perform Kruskal-Wallis tests similar to previous subsection.", 
        "165": "Significant differences were found with both degree and betweenness centrality measures (p < 0.001; α = 0.05).", 
        "166": "Latino characters were found to have significantly lower degree centralities compared to caucasian and southasian races suggesting noncentral roles in these characters.", 
        "167": "Caucasian characters were found to have median betweenness centralities significantly higher than at least one other race.", 
        "168": "Characters from the nativeamerican race exhibit significantly lower medians in both degree and betweenness centralities than caucasian, african and mixed characters, which agrees with (Rosenthal, 2012).", 
        "169": "5.3.3 Age  We investigate the effects of age on importance of character roles by building a linear regression model on the two centralities with age as the independent variable.", 
        "170": "In both cases, age was found to be significant (p < 0.001; α = 0.05).", 
        "171": "With degree centrality, the regression coefficient β was found to be equal to 0.003.", 
        "172": "In betweenness centrality, the regression coefficient was also positive, given by β = 8.41×10−4.", 
        "173": "Both these metrics indicate a positive correlation for character importance with age, i.e.", 
        "174": "as characters age, there is an increased interaction with other characters in the movie as well as higher prominence in the movie plot.", 
        "175": "6 Conclusion  We present a scalable automated analyses of differences in character portrayal along multiple factors such as gender, race and age using word usage, psycholinguistic and graph theoretic measures.", 
        "176": "Several interesting patterns are revealed\nin the analysis.", 
        "177": "In particular, movies with female writers and directors in the production team are observed to have balanced gender ratios in characters compared to male writers/directors.", 
        "178": "Across several races, female actors are found to be younger than male actors on average.", 
        "179": "Female characters appear to be more positive in language use with fewer references to death and fewer swear words compared to male characters.", 
        "180": "Female characters also appear to be more prominent in horror movies compared to male characters.", 
        "181": "Latino and mixed race characters appear to have higher usage of sexual words.", 
        "182": "Eastasian characters seem to use significantly fewer religious words.", 
        "183": "As characters aged, their word sophistication seems to increase along with usage of words related to achievement and religion; there was also a significant reduction in word activation, usage of sexual and swear words as character age increases.", 
        "184": "Future work includes expanding the analyses to non-English movies and combining the linguistic metrics with character networks.", 
        "185": "Specifically, character network edges can be weighted using the psycholinguistic metrics to analyze the emotional patterns in inter-character interactions.", 
        "186": "7 Acknowledgments  We acknowledge support from NSF and our partnership with Google and the Geena Davis Institute on Gender in Media.", 
        "187": "We thank Naveen Kumar for all the helpful discussions and feedback during this work."
    }, 
    "document_id": "P17-1153.pdf.json"
}
