{
    "abstract_sentences": {
        "1": "Most work on segmenting text does so on the basis of topic changes, but it can be of interest to segment by other, stylistically expressed characteristics such as change of authorship or native language.", 
        "2": "We propose a Bayesian unsupervised text segmentation approach to the latter.", 
        "3": "While baseline models achieve essentially random segmentation on our task, indicating its difficulty, a Bayesian model that incorporates appropriately compact language models and alternating asymmetric priors can achieve scores on the standard metrics around halfway to perfect segmentation."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1457–1469 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1134  1 Introduction  Most work on automatically segmenting text has been on the basis of topic: segment boundaries correspond to topic changes (Hearst, 1997).", 
        "2": "There are various contexts, however, in which it is of interest to identify changes in other characteristics; for example, there has been work on identifying changes in authorship (Koppel et al., 2011) and poetic voice (Brooke et al., 2012).", 
        "3": "In this paper we investigate text segmentation on the basis of change in the native language of the writer.", 
        "4": "Two illustrative contexts where this task might be of interest are patchwriting detection and literary analysis.", 
        "5": "Patchwriting is the heavy use of text from a different source with some modification and insertion of additional words and sentences to form a new text.", 
        "6": "Pecorari (2003) notes that this is a kind of textual plagiarism, but is a strategy for learning to write in an appropriate language and style, rather than for deception.", 
        "7": "Keck (2006), Gilmore et al.", 
        "8": "(2010) and Vieyra et al.", 
        "9": "(2013) found that non-native speakers, not\nsurprisingly in situations of imperfect mastery of a language, are strongly over-represented in this kind of textual plagiarism.", 
        "10": "In these cases the boundaries between the writer’s original text and (near-)copied native text are often quite apparent to the reader, as in this short example from Li and Casanave (2012) (copied text italicised): “Nevertheless, doubtfulness can be cleared reasonably by the experiments conducted upon the ‘split-brain patients’, in whom intra-hemispheric communication is no longer possible.", 
        "11": "To illustrate, one experiment has the patient sit at a table with a non-transparent screen blocking the objects behind, who is then asked to reach the objects with different hand respectively.” Because patchwriting can indicate imperfect comprehension of the source (Jamieson and Howard, 2013), identifying it and supporting novice writers to improve it has become a focus of programmes like the Citation Project.1\nFor the second, perhaps more speculative context of literary analysis, consider Joseph Conrad, known for having written a number of famous English-language novels, such as Heart of Darkness; he was born in Poland and moved to England at the age of 21.", 
        "12": "His writings have been the subject of much manual analysis, with one particular direction of such research being the identification of likely influences on his English writing, including his native Polish language and the French he learnt before English.", 
        "13": "Morzinski (1994), for instance, notes aspects of his writing that exhibit Polish-like syntax, verb inflection, or other linguistic characteristics (e.g.", 
        "14": "“Several had still their staves in their hands” where the awkwardly placed adverb still is typical of Polish).", 
        "15": "These appear both in isolated sentences and in larger chunks of text, and part of\n1http://citationproject.net/\n1457\nan analysis can involve identifying these chunks.", 
        "16": "This raises the question: Can NLP and computational models identify the points in a text where native language changes?", 
        "17": "Treating this as an unsupervised text segmentation problem, we present the first Bayesian model of text segmentation based on authorial characteristics, applied to native language.", 
        "18": "2 Related Work  Topic Segmentation The most widelyresearched text segmentation task has as its goal to divide a text into topically coherent segments.", 
        "19": "Lexical cohesion (Halliday and Hasan, 1976) is an important concept here: the principle that text is not formed by a random set of words and sentences but rather logically ordered sets of related words that together form a topic.", 
        "20": "In addition to the semantic relation between words, other methods such as back-references and conjunctions also help achieve cohesion.", 
        "21": "Based on this, Morris and Hirst (1991) proposed the use of lexical chains, sequences of related words (defined via thesaurus), to break up a text into topical segments: breaks in lexical chains indicate breaks in topic.", 
        "22": "The TextTiling algorithm (Hearst, 1994, 1997) took a related approach, defining a function over lexical frequency and distribution information to determine topic boundaries, and assuming that each topic has its own vocabulary and that large shifts in this vocabulary usage correspond to topic shifts.", 
        "23": "There have been many approaches since that time.", 
        "24": "A key one, which is the basis for our own work, is the unsupervised Bayesian technique BAYESSEG of Eisenstein and Barzilay (2008), based on a generative model that assumes that each segment has its own language model.", 
        "25": "Under this assumption the task can be framed as predicting boundaries at points which maximize the probability of a text being generated by a given language model.", 
        "26": "Their method is based on lexical cohesion — expressed in this context as topic segments having compact and consistent lexical distributions — and implements this within a probabilistic framework by modelling words within each segment as draws from a multinomial language model associated with that segment.", 
        "27": "Much other subsequent work either uses this as a baseline, or extends it in some way: Jeong and Titov (2010), for example, who propose a model for joint discourse segmentation and alignment for\ndocuments with parallel structures, such as a text with commentaries or presenting alternative views on the same topic; or Du et al.", 
        "28": "(2013), who use hierarchical topic structure to improve the linear segmentation.", 
        "29": "Bible Authorship Koppel et al.", 
        "30": "(2011) consider the task of decomposing a document into its authorial components based on their stylistic properties and propose an unsupervised method for doing so.", 
        "31": "The authors use as their data two biblical books, Jeremiah and Ezekiel, that are generally believed to be single-authored: their task was to segment a single artificial text constructed by interleaving chapters of the two books.", 
        "32": "Their most successful method used work in biblical scholarship on lexical choice: they give as an example the case that in Hebrew there are seven synonyms for the word fear, and that different authors may choose consistently from among them.", 
        "33": "Then, having constructed their own synsets using available biblical resources and annotations, they represent texts by vectors of synonyms and apply a modified cosine similarity measure to compare and cluster these vectors.", 
        "34": "While the general task is relevant to this paper, the particular notion of synonymy here means the approach is specific to this problem, although their approach is extended to other kinds of text in Akiva and Koppel (2013).", 
        "35": "Aldebei et al.", 
        "36": "(2015) proposed a new approach motivated by this work, similarly clustering sentences, then using a Naive Bayes classifier with modified prior probabilities to classify sentences.", 
        "37": "Poetry Voice Detection Brooke et al.", 
        "38": "(2012) perform stylistic segmentation of a well-known poem, The Waste Land by T.S.", 
        "39": "Eliot.", 
        "40": "This poem is renowned for the great number of voices that appear throughout the text and has been the subject of much literary analysis (Bedient and Eliot, 1986; Cooper, 1987).", 
        "41": "These distinct voices, conceived of as representing different characters, have differing tones, lexis and grammatical styles (e.g.", 
        "42": "reflecting the level of formality).", 
        "43": "The transitions between the voices are not explicitly marked in the poem and the task here is to predict the breaks where these voice changes occur.", 
        "44": "The authors argue that the use of generative models is not feasible for this task, noting: “Generative models, which use a bag-of-words assumption, have a very different problem: in their standard form, they can capture only lexical cohesion, which is not the (primary) focus of stylistic analysis.”\nThey instead present a method based on a curve that captures stylistic change, similar to the TextTiling approach but generalised to use a range of features.", 
        "45": "The local maxima in this change curve represent potential breaks in the text.", 
        "46": "The features are both internal to the poem (e.g.", 
        "47": "word length, syllable count, POS tag) as well as external (e.g.", 
        "48": "average unigram counts in the 1T Corpus or sentiment polarity from a lexicon).", 
        "49": "Results on an artificially constructed mixed-style poem achieve a Pk of 0.25.", 
        "50": "Brooke et al.", 
        "51": "(2013) extend this by considering clustering following an initial segmentation.", 
        "52": "Native Language Identification (NLI) NLI casts the detecting of native language (L1) influence in writing in a non-native (L2) language as a classification task: the framing of the task in this way comes from Koppel et al.", 
        "53": "(2005).", 
        "54": "There has been much activity on it in the last few years, with Tetreault et al.", 
        "55": "(2012) providing a comprehensive analysis of features that had been used up until that point, and a shared task in 2013 (Tetreault et al., 2013) that attracted 29 entrants.", 
        "56": "The shared task introduced a new, now-standard dataset, TOEFL11, and work has continued on improving classification results, e.g.", 
        "57": "by Bykh and Meurers (2014) and Ionescu et al.", 
        "58": "(2014).", 
        "59": "In addition to work on the classification task itself, there have also been investigations of the features used, and how they might be employed elsewhere.", 
        "60": "Malmasi and Cahill (2015) examine the effectiveness of individual feature types used in the shared task and the diversity of those features.", 
        "61": "Of relevance to the present paper, simple part-of-speech n-grams alone are fairly effective, with classification accuracies of between about 40% and 65%; higher-order n-grams are more effective than lower, and the more finegrained CLAWS2 tagset more effective than the Penn Treebank tagset.", 
        "62": "An area for application of these features is in Second Language Acquisition (SLA), as a data-driven approach to finding L1-related characteristics that might be a result of cross-linguistic influence and consequently a possible starting for an SLA hypothesis (Ellis, 2008); Swanson and Charniak (2013) and Malmasi and Dras (2014) propose methods for this.", 
        "63": "Tying It Together Contra Brooke et al.", 
        "64": "(2012), we show that it is possible to develop effective generative models for segmentation on stylistic factors, of the sort used for topic segmentation.", 
        "65": "To apply it specifically to segmentation based on a writer’s L1, we draw on work in NLI.", 
        "66": "3 Experimental Setup  We investigate the task of L1-based segmentation in three stages: 1.", 
        "67": "Can we define any models that do better than random, in a best case scenario?", 
        "68": "For this best case scenario, we determine results over a devset with the best prior found by a grid search, for a single language pair likely to be relatively easily distinguishable.", 
        "69": "Note that as this is unsupervised segmentation, it is a devset in the sense that it is used to find the best prior, and also in a sense that some models as described in §4 use information from a related NLI task on the underlying data.", 
        "70": "2.", 
        "71": "If the above is true, do the results also hold for test data, using priors derived from the devset?", 
        "72": "3.", 
        "73": "Further, do the results also hold for all language pairs available in our dataset, not just a single easily distinguishable pair?", 
        "74": "We first describe the evaluation data — artificial texts generated from learner essays, similar to the artificially constructed texts of previously described work on Bible authorship and poetry segmentation — and evaluation metrics, followed in §4 by the definitions of our Bayesian models.", 
        "75": "3.1 Source Data  We use as the source of data the TOEFL11 dataset used for the NLI shared task (Blanchard et al., 2013) noted in §2.", 
        "76": "The data consists of 12100 essays by writers with 11 different L1s, taken from TOEFL tests where the test-taker is given a prompt2 as the topic for the essay.", 
        "77": "The corpus is balanced across L1s and prompts (which allows us to verify that segmentation isn’t occurring on the basis of topic), and is split into standard training, dev and test sets.", 
        "78": "3.2 Document Generation  As the main task is to segment texts by the author’s L1, we want to ensure that we are not segmenting by topic and thus use texts written by authors from different L1 backgrounds on the same topic (prompt).", 
        "79": "We will also create one dataset to verify that segmentation by topic works in this domain; for this we use texts written by authors from the same L1 background on different topics.", 
        "80": "For our L1-varying datasets, we construct composite documents to be segmented as alternat-\n2For example, prompt P7 is: “Do you agree or disagree with the following statement?", 
        "81": "It is more important for students to understand ideas and concepts than it is for them to learn facts.", 
        "82": "Use reasons and examples to support your answer.”\ning segments drawn from TOEFL11 from two different L1s holding the topic (prompt) constant, broadly following a standard approach (Brooke et al., 2012, for example) (see Appendix A.1 for details).", 
        "83": "We follow the same process for our topicvarying datasets, but hold the L1 constant while alternating the topic (prompt).", 
        "84": "For our single pair of L1s, we choose German and Italian.", 
        "85": "German is the class with the highest NLI accuracy in the TOEFL11 corpus across the shared task results and Italian also performs very well.", 
        "86": "Additionally, there is very little confusion between the two; a binary NLI classifier we trained on the language pair achieved 97% accuracy.", 
        "87": "For our all-pairs results, given the 11 languages in the TOEFL11 corpus, we have 55 sets of documents of alternating L1s (one of which is German–Italian).", 
        "88": "We generate four distinct types of datasets for our experiments using the above methodology.", 
        "89": "The documents in these datasets, as described below, differ in the parameters used to select the essays for each segment and what type of tokens are used.", 
        "90": "Tokens (words) can be represented in their original form and used for performing segmentation.", 
        "91": "Alternatively, using an insight from Wong et al.", 
        "92": "(2012), we can represent the documents at a level other than lexical: the text could consist of the POS tags corresponding to all of the tokens, or n-grams over those POS tags.", 
        "93": "The POS representation is motivated by the usefulness of POSbased features for capturing L1-based stylistic differences as noted in §2.", 
        "94": "Our method for encoding n-grams is described in Appendix A.2.", 
        "95": "TOPICSEG-TOKENS This data is generated by keeping the L1 class constant and alternating segments between two topics.", 
        "96": "We chose Italian for the L1 class and essays from the prompts “P7” and “P8” are used.", 
        "97": "The dataset, constructed from TOEFL11-TRAIN and TOEFL11-DEV, contains a total of 53 artificial documents, and will be used to verify that topic segmentation as discussed in Eisenstein and Barzilay (2008) functions as expected for data from this domain: that is, that topic change is detectable.", 
        "98": "TOPICSEG-PTB Here the tokens in each text are replaced with their POS tags or n-grams over those tags, and the segmentation is performed over this data.", 
        "99": "In this dataset the tags are obtained via the Stanford Tagger and use the Penn Treebank (PTB) tagset.", 
        "100": "The same source data (TOEFL11TRAIN and TOEFL11-DEV), L1 and topics as TOPICSEG-TOKENS are used for a total of 53\ndocuments.", 
        "101": "This dataset will be used to investigate, inter alia, whether segmentation over these stylistically related features could take advantage of topic cues.", 
        "102": "We would expect not.", 
        "103": "L1SEG-PTB This dataset is used for segmentation based on native language, also using (n-grams over) the PTB POS tags.", 
        "104": "We choose a specific topic and then retrieve all essays from the corpus that match this; here we chose prompt “P7”, since it had the largest number of essays for our chosen single L1 pair, German–Italian.", 
        "105": "For the dataset constructed from TOEFL11-TRAIN and TOEFL11DEV (which we will refer to as L1SEG-PTB-GIDEV), this resulted in 57 documents.", 
        "106": "Documents that are composites of two L1s are then generated as described above.", 
        "107": "For investigating questions 2 and 3 above, we similarly have datasets constructed from the the smaller TOEFL11-TEST data (L1SEG-PTB-GI-TEST), which consist of 5 documents of 5 segments each for the single L1 pair, and from all language pairs (L1SEG-PTB-ALLDEV, L1SEG-PTB-ALL-TEST).", 
        "108": "We would expect that these datasets should not be segmentable by topic, as all the segments are on the same topic; the segments should however, differ in stylistic characteristics related to the L1.", 
        "109": "L1SEG-CLAWS2 This dataset is generated using the same methodology as L1SEG-PTB, with the exception that the essays are tagged using the RASP tagger which uses the more fine-grained CLAWS2 tagset, noting that the CLAWS2 tagset performed better in the NLI classification task (Malmasi and Cahill, 2015).", 
        "110": "3.3 Evaluation  We use the standard Pk (Beeferman et al., 1999) and WindowDiff (WD) (Pevzner and Hearst, 2002) metrics, which (broadly speaking) select sentences using a moving window of size k and determines whether these sentences correctly or incorrectly fall into the same or different reference segmentations.", 
        "111": "Pk and WD scores range between 0 and 1, with a lower score indicating better performance, and 0 a perfect segmentation.", 
        "112": "It has been noted that some “degenerate” algorithms — such as placing boundaries randomly or at every possible position — can score 0.5 (Pevzner and Hearst, 2002).", 
        "113": "WD scores are typically similar to Pk, correcting for differential penalties between false positive boundaries and false negatives implicit in Pk.", 
        "114": "Pk and WD scores reported in §5 are\naverages across all documents in a dataset.", 
        "115": "Formal definitions are given in Appendix A.3.", 
        "116": "4 Segmentation Models  For all of our segmentation we use as a starting point the unsupervised Bayesian method of Eisenstein and Barzilay (2008); see §2.3 We recap the important technical definitions here.", 
        "117": "In Equation 1 of their work they define the observation likelihood as,\np(X | z,Θ) = T∏\nt\np(xt | θzt), (1)\nwhere X is the set of all T sentences, z is the vector of segment assignments for each sentence, xt is the bag of words drawn from the language model and Θ is the set of all K language models Θ1 .", 
        "118": ".", 
        "119": ".ΘK .", 
        "120": "As is standard in segmentation work, K is assumed to be fixed and known (Malioutov and Barzilay, 2006); it is set to the actual number of segments.", 
        "121": "The authors also impose an additional constraint, that zt must be equal to either zt−1 (the previous sentence’s segment) or zt−1 +1 (the next segment), in order to ensure a linear segmentation.", 
        "122": "This segmentation model has two parameters: the set of language models Θ and the segment assignment indexes z.", 
        "123": "The authors note that since this task is only concerned with the segment assignments, searching in the space of language models is not desirable.", 
        "124": "They offer two alternatives to overcome this: (1) taking point estimates of the language models, which is considered to be theoretically unsatisfying and (2) marginalizing them out, which yields better performance.", 
        "125": "Equation 7 of Eisenstein and Barzilay (2008), reproduced here, shows how they marginalize over the language models, supposing that each language model is drawn from a symmetric Dirichlet prior (i.e.", 
        "126": "θj ∼ Dir(θ0)):\np(X | z, θ0) = K∏\nj\npdcm({xt : zt = j} | θ0) (2)\nThe Dirichlet compound multinomial distribution pdcm expresses the expectation over all the multinomial language models, when conditioned on the symmetric Dirichlet prior θ0:\n3An open-source implementation of the method, called BAYESSEG, is made available by the authors at http:// groups.csail.mit.edu/rbg/code/bayesseg/\npdcm({xt : zt = j} | θ0) = Γ(Wθ0)\nΓ(Nj +Wθo)\nW∏\ni\nΓ(nj,i + θ0)\nΓ(θ0) (3)\nwhereW is the number of words in the vocabulary and Nj = ∑W i nj,i, the total number of words in the segment j.", 
        "127": "They then observe that the optimal segmentation maximizes the joint probability\np(X, z | θ0) = p(X | z, θ0)p(z) and assume a uniform p(z) over valid segmentations with no probability mass assigned to invalid segmentations.", 
        "128": "The hyperparameter θ0 can be chosen, or can be learned via an ExpectationMaximization process.", 
        "129": "Inference Eisenstein and Barzilay (2008) defined two methods of inference, a dynamic programming (DP) one and one using MetropolisHastings (MH).", 
        "130": "Only MH is applicable where shifting a boundary will affect the probability of every segment, not just adjacent segments, as in their model incorporating cue phrases.", 
        "131": "Where this is not the case, they use DP inference.", 
        "132": "Their DP inference algorithm is suitable for all of our models, so we also use that.", 
        "133": "Priors For our priors, we carry out a grid search on the devsets (that is, the datasets derived from TOEFL11-TRAIN and TOEFL11-DEV) in the interval [0.1, 3.0], partitioned into 30 evenly spaced values; this includes both weak and strong priors.4  4.1 TOPICSEG  Our first model is exactly the one proposed by Eisenstein and Barzilay (2008) described above.", 
        "134": "The aim here is to look at how we perform at segmenting learner essays by topic in order to confirm that topic segmentation works for this domain and these types of topics.", 
        "135": "We apply this model to the TOPICSEG-TOKENS and TOPICSEG-PTB datasets where the texts have the same L1 and boundaries are placed between essays of differing topics (prompts).", 
        "136": "4.2 L1SEG  Our second model modifies that of Eisenstein and Barzilay (2008) by revising the generative story.", 
        "137": "4The Eisenstein and Barzilay (2008) code does implement an EM method for finding priors in the symmetric case, but we found that perhaps surprisingly the grid search almost always found better ones.", 
        "138": "Where they assume a standard generative model over words with constraints on topic change between sentences, we make minor modifications to adapt the model for our task.", 
        "139": "The standard generative story (Blei, 2012) — an account of how a model generates the observed data — usually generates words in a two-stage process: (1) For each document, randomly choose a distribution of topics.", 
        "140": "(2) For each word in the document: (a) Assign a topic from those chosen in step 1.", 
        "141": "(b) Randomly choose a word from that topic’s vocabulary.", 
        "142": "Here we modify this story to be over part-ofspeech data instead of lexical items.", 
        "143": "By using this representation (which as noted in §2 is useful for NLI classification) we aim to segment our texts based on the L1 of the author for each segment.", 
        "144": "For this model we only make use of the L1SEGPTB-GI-DEV dataset.5  4.3 L1SEG-COMP  It is not obvious that the same properties that produce compact distributions in standard lexical chains would also be the case for POS data, particularly if extended to POS n-grams which can result in a very large number of potential tokens.", 
        "145": "In this regard Eisenstein and Barzilay (2008) note: “To obtain a high likelihood, the language models associated with each segment should concentrate their probability mass on a compact subset of words.", 
        "146": "Language models that spread their probability mass over a broad set of words will induce a lower likelihood.", 
        "147": "This is consistent with the principle of lexical cohesion.”\nEisenstein and Barzilay (2008) discuss this within the context of topic segmentation.6 However, it is unclear if this would also would happen for POS tags; there is no syntactic analogue for the sort of lexical chains important in topic segmentation.", 
        "148": "It may then turn out that using all POS tags or n-grams over them as in the previous model would not achieve a strong performance.", 
        "149": "We thus use knowledge from the NLI classification task to help.", 
        "150": "Discarding Non-Discriminative Features One approach that could possibly overcome these lim-\n5We also looked at including words.", 
        "151": "The results of these models were always worse, and we do not discuss them in this paper.", 
        "152": "6For example, a topic segment related to the previously mentioned essay prompt P7 might concentrate its probability mass on the following set of words: {education, learning, understanding, fact, theory, idea, concept, knowledge}.", 
        "153": "itations is the removal of features from the input space that have been found to be nondiscriminative in NLI classification.", 
        "154": "This would allow us to encode POS sequence information via n-grams while also keeping the model’s vocabulary sufficiently small.", 
        "155": "Doing this requires the use of extrinsic information for filtering the n-grams.", 
        "156": "The use of such extrinsic information has proven to be useful for other similar tasks such as the poetry style change segmentation work of Brooke et al.", 
        "157": "(2012), as noted in §2.", 
        "158": "We perform this filtering using the discriminative feature lists derived from the NLI classification task using the system and method described in Malmasi and Dras (2014), also noted in §2.", 
        "159": "We extract the top 300 most discriminative POS ngram features for each L1 from TOEFL11-TRAIN and TOEFL11-DEV, resulting in two lists of 600 POS bigrams and trigrams; these are thus independent of our test datasets.", 
        "160": "(We illustrate a text with respect to these discriminative features in Appendix A.4.)", 
        "161": "Note that discriminative n-grams can overlap with each other within the same class and also between two classes.", 
        "162": "We resolve such conflicts by using the weights of the features from the classification task as described in Malmasi and Dras (2014) and choosing the feature with the higher weight.", 
        "163": "4.4 L1SEG-ASYMP  Looking at the distribution of discriminative features in our documents, one idea is that incorporating knowledge about which features are associated with which L1 could potentially help improve the results.", 
        "164": "One approach to do this is the use of asymmetric priors.", 
        "165": "We note that features associated with an L1 often dominate in a segment.", 
        "166": "Accordingly, priors can represent evidence external to the data that some some aspect should be weighted more strongly: for us, this is evidence from the NLI classification task.", 
        "167": "The segmentation models discussed so far only make use of a symmetric prior but later work mentions that it would be possible to modify this to use an asymmetric prior (Eisenstein, 2009).", 
        "168": "Given that priors are effective for incorporating external information, recent work has highlighted the importance of optimizing over such priors, and in particular, the use of asymmetric priors.", 
        "169": "Key work on this is by Wallach et al.", 
        "170": "(2009) on LDA, who report that “an asymmetric Dirichlet prior over the document-topic distributions has substantial advantages over a symmetric prior”,\nwith prior values being determined through hyperparameter optimization.", 
        "171": "Such methods have since been applied in other tasks such as sentiment analysis (Lin and He, 2009; Lin et al., 2012) to achieve substantial improvements.", 
        "172": "For sentiment analysis, Lin and He (2009) incorporate external information from a subjectivity lexicon.", 
        "173": "In applying LDA, instead of using a uniform Dirichlet prior for the document–sentiment distribution, they use asymmetric priors for positive and negative sentiment, determined empirically.", 
        "174": "For our task, we assign a prior to each of two languages in a document, one corresponding to L1a and the other to L1b.", 
        "175": "Given this, we can assume that segments will alternate between L1a and L1b.", 
        "176": "And instead of a single θ0, we have two asymmetric priors that we call θa, θb corresponding to L1a and L1b respectively.", 
        "177": "This will require reworking the definition of pdcm in Equation 3.", 
        "178": "First adapting Equation 2,\np(X | z, θa, θb) = ∏\n{jo} pdcm({xt : zt = jo} | θa) · ∏ {je} pdcm({xt : zt = je} | θb), (4)\nwith {jo} = {j | j mod 2 = 1, 1 ≤ j ≤ K} the set of indices over odd segments and {je} = {j | j mod 2 = 0, 1 ≤ j ≤ K} the set over evens.", 
        "179": "K is the (usual) total number of segments.", 
        "180": "Then\npdcm({xt : zt = jo} | θa) = Γ( ∑W k θa[k])\nΓ(Njo + ∑W k θa[k])\nW∏\ni\nΓ(nj,i + θa[i])\nΓ(θa[i]) (5)\nW is now more generally the number of items in our vocabulary (whether words or POS n-grams).", 
        "181": "A notational addition here is θa[k] which refers to the L1a prior for the kth word or POS n-gram.", 
        "182": "There is an analogous pdcm for θb.", 
        "183": "The next issue is how to construct the θa and θb.", 
        "184": "The simplest scenario would require a single constant value for all elements in one L1 and another for all elements in the other L1.", 
        "185": "Specifically, using discrim(L1x) to denote “the ranked list of discriminative n-grams for L1x”, we define\nθa[i] = { c1 if θa[i] ∈ discrim(L1a) c2 if θa[i] ∈ discrim(L1b)\nand analogously for θb[i].", 
        "186": "We would expect that c1 > c2 (i.e.", 
        "187": "the prior is stronger for elements that\ncome from the appropriate ranked list of discriminative features), but these values will be learned.", 
        "188": "In principle we would calculate versions of p(X | z, θa, θb) twice: once where we assign θa to segment 1, and the second time where we assign θb.", 
        "189": "We’d then compare the two p(X | z, θa, θb), and see which one fits better.", 
        "190": "In this work, however, we will fix the initial L1: segment 1 corresponds to L1a and consequently has prior θa.7  5 Results    5.1 Segmenting by Topic  We begin by testing the TOPICSEG model to ensure that the Bayesian segmentation methodology can achieve reasonable results for segmenting learner essays by topic.", 
        "191": "The results on the TOPICSEG-TOKENS dataset (Table 1) show that content words are very effective at segmenting the writings by topic, achieving Pk values in the range 0.19–0.21.", 
        "192": "These values are similar to those reported for segmenting Wall Street Journal text (Beeferman et al., 1999).", 
        "193": "On the other hand, using the PTB POS tag version of the data in the TOPICSEG-PTB dataset results in very poor segmentation results, with Pk values around 0.45.", 
        "194": "This is essentially the same as the performance of degenerate algorithms (noted in §3.3) of 0.5.", 
        "195": "This demonstrates that, as expected, POS unigrams do not provide enough information for topic segmentation; it is not possible to construct even an approximation to lexical chains using them.", 
        "196": "5.2 L1-based Segmentation  Having verified that the Bayesian segmentation approach is effective for topic segmentation on this data, we now turn to the L1SEG model for segmenting by the native language.", 
        "197": "From the results in Table 1 we see very poor performance with a Pk value of 0.466 for segmenting the texts in L1SEG-PTB-GI-DEV using the unigrams as is.", 
        "198": "This was a somewhat unexpected result given than we know POS unigram distributions are able to capture differences between L1groups (Malmasi and Cahill, 2015), albeit with limited accuracy.", 
        "199": "Moreover, neither bigram nor trigram encodings, which perform better at NLI, resulted in any improvement in our results.", 
        "200": "7This requires an extension of the BAYESSEG software to support asymmetric priors.", 
        "201": "We will make this extended version of the code available under the same conditions as BAYESSEG.", 
        "202": "Please contact the first or second author for this.", 
        "203": "5.3 Incorporating Discriminative Features  Filtering the bigrams results in some minor improvements over the best results from the L1SEG model.", 
        "204": "However, there are substantial improvements when using the filtered POS trigrams, with a Pk value of 0.393.", 
        "205": "We did not test unigrams as they were the weakest NLI feature of the three.", 
        "206": "This improvement is, we believe, because the Bayesian modelling of lexical cohesion over the input tokens requires that each segment concentrates its probability mass on a compact subset of words.", 
        "207": "In the context of the n-gram tokenization method tested in the previous section, the L1SEG model with n-grams would most likely exacerbate the issue by substantially increasing the number of tokens in the language model: while the unigrams do not capture enough information to distinguish non-lexical shifts, the n-grams provide too\nmany features.", 
        "208": "We also see that using the CLAWS2 tagset outperforms the PTB tagset.", 
        "209": "The results achieved for bigrams are much higher, while the trigram results are also better, with Pk = 0.370.", 
        "210": "NLI experiments using different POS tagsets have established that more fine-grained tagsets (i.e.", 
        "211": "those with more tag categories) provide greater classification accuracy when used as n-gram features for classification.8 Results here comport with the previous findings.", 
        "212": "As one of the two best models, we run it on the held-out test data, using the best priors found from the grid search on the devset data (Table 2); we find the Pk and WD values are comparable (and in fact slightly better), so the model still works if the filtering uses discriminative NLI features from the devset.", 
        "213": "Looking at results across all 55 L1 pairs (Table 3), we also see similar mean Pk and WD values with only a small standard deviation, indicating the approach works just as well across all language pairs.", 
        "214": "Priors here are all also weak, in the range [0.1, 0.9].", 
        "215": "In sum, the results here demonstrate the importance of inducing a compact distribution, which we did here by reducing the vocabulary size by stripping non-informative features.", 
        "216": "5.4 Applying Two Asymmetric Priors  Our final model, L1SEG-ASYMP, assesses whether setting different priors for each L1 can improve performance.", 
        "217": "Our grid search over two priors gives 900 possible prior combinations.", 
        "218": "These combinations also include cases where θa and θb are symmetric, which is equivalent to the L1SEG-COMP model.", 
        "219": "We observe (Table 1) that\n8In §2 we noted the comparison of PTB and CLAWS2 tagsets in Malmasi and Cahill (2015); also, Gyawali et al.", 
        "220": "(2013) compared Penn Treebank and Universal POS tagsets and found that the more fine-grained PTB ones did better.", 
        "221": "the prior pair of (0.6, 0.3) achieves a Pk value of 0.321, a substantial improvement over the previous best result of 0.370.", 
        "222": "Inspecting priors (see Figure 1 for a heatmap over priors) shows that the best results are in the region of weak priors for both values, which is consistent with the emphasis on compactness since weak priors result in more compact models (noted by e.g.", 
        "223": "Wang and Blei (2009)).", 
        "224": "Moreover, they are away from the diagonal, i.e.", 
        "225": "the L1SEG-COMP model will not produce the best results.", 
        "226": "A more fine-grained grid search, focusing on the range that provided the best results in the coarse search, can improve the results further still: over the interval [0.3, 0.9], partitioned into 60 evenly spaced values, finds a prior pair of (0.64, 0.32) that provides a slight improvement of the Pk value to 0.316.", 
        "227": "As with L1SEG-COMP, we also evaluate this on the same held-out test set (Table 2).", 
        "228": "Applying the best asymmetric prior from the devset grid search, this improves to 0.266.", 
        "229": "Again, results across all 55 L1 pairs (Table 3) show the same pattern, and much as for L1SEG-COMP, priors are all weak or neutral (range [0.1, 1.0]).", 
        "230": "These results thus demonstrate that setting an asymmetric prior gives the best performance on this task.", 
        "231": "6 Conclusion and Future Work  Applying the approach to our two illustrative applications of §1, patchwriting and literary analysis, would require development of relevant corpora.", 
        "232": "In both cases the distinction would be between native writing and writing that shows characteristics of a non-native speaker, rather than between two non-\nnative L1s.", 
        "233": "There isn’t yet a topic-balanced corpus like TOEFL11 which includes native speaker writing for evaluation, although we expect (given recent results on distinguishing native from nonnative text in Malmasi and Dras (2015)) that the techniques should carry over.", 
        "234": "For the literary analysis, as well, to bridge the gap between work like Morzinski (1994) and a computational application, it remains to be seen how precise an annotation is possible for this task.", 
        "235": "Additionally, the granularity of segmentation may need to be finer than sentence-level, as suggested by the examples in §1; this level of granularity hasn’t previously been tackled in unsupervised segmentation.", 
        "236": "In terms of possible developments for the models presented for the task here, previous NLI work has shown that other, syntactic features can be useful for capturing L1-based differences.", 
        "237": "The incorporation of these features for this segmentation task could be a potentially fruitful avenue for future work.", 
        "238": "We have taken a fairly straightforward approach which modifies the generative story.", 
        "239": "A more sophisticated approach would be to incorporate features into the unsupervised model.", 
        "240": "One such example is the work of Berg-Kirkpatrick et al.", 
        "241": "(2010) which demonstrates that each component multinomial of a generative model can be turned into a miniature logistic regression model with the use of a modified EM algorithm.", 
        "242": "Their results showed that the feature-enhanced unsupervised models which incorporate linguisticallymotivated features achieve substantial improvements for tasks such as POS induction and word segmentation.", 
        "243": "We note also that the models are potentially applicable to other stylistic segmentation tasks beyond L1 influence.", 
        "244": "As far as this initial work is concerned we have shown that, framed as a segmentation task, it is possible to identify units of text that differ stylistically in their L1 influence.", 
        "245": "We demonstrated that it is possible to define a generative story and associated Bayesian models for stylistic segmentation, and further that segmentation results improve substantially by compacting the n-gram distributions, achieved by incorporating knowledge about discriminative features extracted from NLI models.", 
        "246": "Our best results come from a model that uses alternating asymmetric priors for each L1, with the priors selected using a grid search and then evaluated on a held-out test set.", 
        "247": "Acknowledgements  The authors thank John Pate for very helpful discussions in the early stages of the paper, and the three anonymous referees for useful suggestions.", 
        "248": "A Details on Dataset Generation and Evaluation  A.1 Document Generation\nFor our L1-varying datasets, we construct composite documents to be segmented as alternating segments drawn from TOEFL11 from two different L1s.", 
        "249": "Broadly following a standard approach (Brooke et al., 2012, for example), to generate such a document, we randomly draw TOEFL11 essays — each of which constitutes a segment — from the appropriate L1s and concatenate them, alternating the L1 class after each segment.", 
        "250": "This is repeated until the maximum number of segments per document, s, is reached.", 
        "251": "We generate multiple composite documents until all TOEFL11 have been used.", 
        "252": "In this work we use datasets generated with s = 5.9 We follow the same process for our topic-varying datasets, but hold the L1 constant while alternating the topic (prompt).", 
        "253": "A.2 Encoding n-gram information\nLau et al.", 
        "254": "(2013) investigated the importance of n-grams within topic models over lexical items.", 
        "255": "They note that in topic modelling each token receives a topic label and that the words in a collocation — e.g.", 
        "256": "stock market, White House or health care — may receive different topic assignments despite forming a single semantic unit.", 
        "257": "They found that identifying collocations (via a t-test) and preprocessing the text to turn these into single tokens provides a notable improvement over a unigram bag of words.", 
        "258": "We implement a similar preprocessing step that converts each sentence within each document to a set of bigrams or trigrams using a sliding window, where each n-gram is represented by a single token.", 
        "259": "So, for example, the trigram DT JJ NN becomes a single token: DT-JJ-NN.", 
        "260": "A.3 Evaluation: Metric Definitions\nGiven two segmentations r (reference) and h (hypothesis) for a corpus of N sentences,\n9This is the average number of segments per chapter in the written text used by Eisenstein and Barzilay (2008).", 
        "261": "However, we have also successfully replicated our results using s = 7, 9.", 
        "262": "PD(r, h) = ∑\n1≤i≤j≤N D(i, j)(δr(i, j) ⊕̄ δh(i, j)) (6)\nwhere δr(i, j) is an indicator function specifying whether i and j lie in the same reference segment, δh(i, j) similarly for a hypothesised segment, ⊕̄ is the XNOR function, and D is a distance probability distribution over the set of possible distances between sentences.", 
        "263": "For Pk, this D is defined by a fixed window of size k which contains all the probability mass, and k is set to be half the average reference segment length.", 
        "264": "The WD definition is:\nWD(r, h) =\n1 N − k N−k∑\ni=1\n(|b(ri, ri+k)− b(hi, hi+k)| > 0) (7)\nwhere b(ri, rj) represents the number of boundaries between positions i and j in the reference text (similarly, the hypothesis text).", 
        "265": "A.4 Visualisation of Discriminative Features\nFigure 2 shows a visualization of the discriminative features of a single segment where each row represents a sentence and each token is represented by a square.", 
        "266": "Tokens that are part of a trigram which is considered discriminative for either of our two L1 classes are shown in blue or red.", 
        "267": "Note that discriminative n-grams can overlap with each other within the same class (e.g.", 
        "268": "on lines 1 and 2 where two overlapping trigrams form a group of four consecutive tokens) and also between two classes (e.g.", 
        "269": "on lines 10 and 11)."
    }, 
    "document_id": "P17-1134.pdf.json"
}
