{
    "abstract_sentences": {
        "1": "Implicit discourse relation classification is of great challenge due to the lack of connectives as strong linguistic cues, which motivates the use of annotated implicit connectives to improve the recognition.", 
        "2": "We propose a feature imitation framework in which an implicit relation network is driven to learn from another neural network with access to connectives, and thus encouraged to extract similarly salient features for accurate classification.", 
        "3": "We develop an adversarial model to enable an adaptive imitation scheme through competition between the implicit network and a rival feature discriminator.", 
        "4": "Our method effectively transfers discriminability of connectives to the implicit features, and achieves state-of-the-art performance on the PDTB benchmark."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1006–1017 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1093  1 Introduction  Discourse relations connect linguistic units such as clauses and sentences to form coherent semantics.", 
        "2": "Identification of discourse relations can benefit a variety of downstream applications including question answering (Liakata et al., 2013), machine translation (Li et al., 2014), text summarization (Gerani et al., 2014), opinion spam detection (Chen and Zhao, 2015), and so forth.", 
        "3": "∗Corresponding authors.", 
        "4": "This paper was partially supported by Cai Yuanpei Program (CSC No.", 
        "5": "201304490199 and No.", 
        "6": "201304490171), National Natural Science Foundation of China (No.", 
        "7": "61170114, No.", 
        "8": "61672343 and No.", 
        "9": "61272248), National Basic Research Program of China (No.", 
        "10": "2013CB329401), Major Basic Research Program of Shanghai Science and Technology Committee (No.", 
        "11": "15JC1400103), Art and Science Interdisciplinary Funds of Shanghai Jiao Tong University (No.", 
        "12": "14JCRZ04), and Key Project of National Society Science Foundation of China (No.", 
        "13": "15- ZDA041).", 
        "14": "Connectives (e.g., but, so, etc) are one of the most critical linguistic cues for identifying discourse relations.", 
        "15": "When explicit connectives are present in the text, a simple frequency-based mapping is sufficient to achieve over 85% classification accuracy (Xue et al., 2016; Li et al., 2016).", 
        "16": "In contrast, implicit discourse relation recognition has long been seen as a challenging problem, with the best accuracy so far still lower than 50% (Chen et al., 2015).", 
        "17": "In the implicit case, discourse relations are not lexicalized by connectives, but to be inferred from relevant sentences (i.e., arguments).", 
        "18": "For example, the following two adjacent sentences Arg1 and Arg2 imply relation Cause (i.e., Arg2 is the cause of Arg1).", 
        "19": "[Arg1]: Never mind.", 
        "20": "[Arg2]: You already know the answer.", 
        "21": "[Implicit connective]: Because\n[Discourse relation]: Cause\nVarious attempts have been made to directly infer underlying relations by modeling the semantics of the arguments, ranging from feature-based methods (Lin et al., 2009; Pitler et al., 2009) to the very recent end-to-end neural models (Chen et al., 2016a; Qin et al., 2016c).", 
        "22": "Despite impressive performance, the absence of strong explicit connective cues has made the inference extremely hard and hindered further improvement.", 
        "23": "In fact, even the human annotators would make use of connectives to aid relation annotation.", 
        "24": "For instance, the popular Penn Discourse Treebank (PDTB) benchmark data (Prasad et al., 2008) was annotated by first inserting a connective expression (i.e., implicit connective, as shown in the above example) manually, and determining the abstract relation by combining both the implicit connective and contextual semantics.", 
        "25": "1006\nTherefore, the huge performance gap between explicit and implicit parsing (namely, 85% vs 50%), as well as the human annotation practice, strongly motivates to incorporate connective information to guide the reasoning process.", 
        "26": "This paper aims to advance implicit parsing by making use of annotated implicit connectives available in training data.", 
        "27": "Few recent work has explored such combination.", 
        "28": "Zhou et al.", 
        "29": "(2010) developed a two-step approach by first predicting implicit connectives whose sense is then disambiguated to obtain the relation.", 
        "30": "However, the pipeline approach usually suffers from error propagation, and the method itself has relied on hand-crafted features which do not necessarily generalize well.", 
        "31": "Other research leveraged explicit connective examples for data augmentation (Rutherford and Xue, 2015; Braud and Denis, 2015; Ji et al., 2015; Braud and Denis, 2016).", 
        "32": "Our work is orthogonal and complementary to this line.", 
        "33": "In this paper, we propose a novel neural method that incorporates implicit connectives in a principled adversarial framework.", 
        "34": "We use deep neural models for relation classification, and take the intuition that, sentence arguments integrated with connectives would enable highly discriminative neural features for accurate relation inference, and an ideal implicit relation classifier, even though without access to connectives, should mimic the connective-augmented reasoning behavior by extracting similarly salient features.", 
        "35": "We therefore setup a secondary network in addition to the implicit relation classifier, building upon connectiveaugmented inputs and serving as a feature learning model for the implicit classifier to emulate.", 
        "36": "Methodologically, however, feature imitation in our problem is challenging due to the semantic gap induced by adding the connective cues.", 
        "37": "It is necessary to develop an adaptive scheme to flexibly drive learning and transfer discriminability.", 
        "38": "We devise a novel adversarial approach which enables a self-calibrated imitation mechanism.", 
        "39": "Specifically, we build a discriminator which distinguishes between the features by the two counterpart networks.", 
        "40": "The implicit relation network is then trained to correctly classify relations and simultaneously to fool the discriminator, resulting in an adversarial framework.", 
        "41": "The adversarial mechanism has been an emerging method in different context, especially for image generation (Goodfellow et al., 2014) and domain adaptation (Ganin\net al., 2016; Chen et al., 2016c).", 
        "42": "Our adversarial framework is unique to address neural feature emulation between two models.", 
        "43": "Besides, to the best of our knowledge, this is the first adversarial approach in the context of discourse parsing.", 
        "44": "Compared to previous connective exploiting work (Zhou et al., 2010; Xu et al., 2012), our method provides a new integration paradigm and an end-to-end procedure that avoids inefficient feature engineering and error propagation.", 
        "45": "Our method is evaluated on the PDTB 2.0 benchmark in a variety of experimental settings.", 
        "46": "The proposed adversarial model greatly improves over standalone neural models and previous bestperforming approaches.", 
        "47": "We also demonstrate that our implicit recognition network successfully imitates and extracts crucial hidden representations.", 
        "48": "We begin by briefly reviewing related work in section 2.", 
        "49": "Section 3 presents the proposed adversarial model.", 
        "50": "Section 4 shows substantially improved experimental results over previous methods.", 
        "51": "Section 5 discusses extensions and future work.", 
        "52": "2 Related Work    2.1 Implicit Discourse Relation Recognition  There has been a surge of interest in implicit discourse parsing since the release of PDTB (Prasad et al., 2008), the first large discourse corpus distinguishing implicit examples from explicit ones.", 
        "53": "A large set of work has focused on direct classification based on observed sentences, including structured methods with linguistically-informed features (Lin et al., 2009; Pitler et al., 2009; Zhou et al., 2010), end-to-end neural models (Qin et al., 2016b,c; Chen et al., 2016a; Liu and Li, 2016), and combined approaches (Ji and Eisenstein, 2015; Ji et al., 2016).", 
        "54": "However, the lacking of connective cues makes learning purely from contextual semantics full of challenges.", 
        "55": "Prior work has attempted to leverage connective information.", 
        "56": "Zhou et al.", 
        "57": "(2010) also incorporate implicit connectives, but in a pipeline manner by first predicting the implicit connective with a language model and determining discourse relation accordingly.", 
        "58": "Instead of treating implicit connectives as intermediate prediction targets which can suffer from error propagation, we use the connectives to induce highly discriminative features to guide the learning of an implicit network, serving as an adaptive regularization mechanism for en-\nhanced robustness and generalization.", 
        "59": "Our framework is also end-to-end, avoiding costly feature engineering.", 
        "60": "Another notable line aims at adapting explicit examples for data synthesis (Biran and McKeown, 2013; Rutherford and Xue, 2015; Braud and Denis, 2015; Ji et al., 2015), multi-task learning (Lan et al., 2013; Liu et al., 2016), and word representation (Braud and Denis, 2016).", 
        "61": "Our work is orthogonal and complementary to these methods, as we use implicit connectives which have been annotated for implicit examples.", 
        "62": "2.2 Adversarial Networks  Deep neural networks have gained impressive success in various natural language processing tasks (Wang et al., 2016; Zhang et al., 2016b; Cai et al., 2017), in which adversarial networks have been shown especially effective in deep generative modeling (Goodfellow et al., 2014) and domain adaptation (Ganin et al., 2016).", 
        "63": "Generative adversarial nets (Goodfellow et al., 2014) learn to produce realistic samples through competition between a generator and a real/fake discriminator.", 
        "64": "Professor forcing (Lamb et al., 2016) applies a similar idea to improve long-term generation of a recurrent neural language model.", 
        "65": "Other approaches (Chen et al., 2016b; Hu et al., 2017; Liang et al., 2017) extend the framework for controllable image/text generation.", 
        "66": "Li et al.", 
        "67": "(2015); Salimans et al.", 
        "68": "(2016) propose feature matching which trains generators to match the statistics of real/fake examples.", 
        "69": "Their features are extracted by the discriminator rather than the classifier networks as in our case.", 
        "70": "Our work differs from the above since we consider the context of discriminative modeling.", 
        "71": "Adversarial domain adaptation forces a neural network to learn domain-invariant features using a classifier that distinguishes the domain of the network’s input data based on the hidden feature.", 
        "72": "Our adversarial framework is distinct in that besides the implicit relation network we construct a second neural network serving as a teacher model for feature emulation.", 
        "73": "To the best of our knowledge, this is the first to employ the idea of adversarial learning in the context of discourse parsing.", 
        "74": "We propose a novel connective exploiting scheme based on feature imitation, and to this end derive a new adversarial framework, achieving substantial performance gain over existing methods.", 
        "75": "The proposed approach is generally applicable to other tasks for\nutilizing any indicative side information.", 
        "76": "We give more discussions in section 5.", 
        "77": "3 Adversarial Method  Discourse connectives are key indicators for discourse relation.", 
        "78": "In the annotation procedure of the PDTB implicit relation benchmark, annotators inserted implicit connective expressions between adjacent sentences to lexicalize abstract relations and help with final decisions.", 
        "79": "Our model aims at making full use of the provided implicit connectives at training time to regulate learning of implicit relation recognizer, encouraging extraction of highly discriminative semantics from raw arguments, and improving generalization at test time.", 
        "80": "Our method provides a novel adversarial framework that leverages connective information in a flexible adaptive manner, and is efficiently trained end-to-end through standard back-propagation.", 
        "81": "The basic idea of the proposed approach is simple.", 
        "82": "We want our implicit relation recognizer, which predicts the underlying relation of sentence arguments without discourse connective, to have prediction behaviors close to a connectiveaugmented relation recognizer which is provided with a discourse connective in addition to the arguments.", 
        "83": "The connective-augmented recognizer is in analogy to an annotator with the help of connectives as in the human annotation process, and the implicit recognizer would be improved by learning from such an “informed” annotator.", 
        "84": "Specifically, we want the latent features extracted by the two models to match as closely as possible, which explicitly transfers the discriminability of the connective-augmented representations to implicit ones.", 
        "85": "To this end, instead of manually selecting a closeness metric, we take advantage of the adversarial framework by constructing a two-player zero-sum game between the implicit recognizer and a rival discriminator.", 
        "86": "The discriminator attempts to distinguish between the features extracted by the two relation models, while the implicit relation model is trained to maximize the accuracy on implicit data, and at the same time to confuse the discriminator.", 
        "87": "In the next we first present the overall architecture of the proposed approach (section 3.1), then develop the training procedure (section 3.2).", 
        "88": "The components are realized as deep (convolutional) neural networks, with detailed modeling choices\ndiscussed in section 3.3.", 
        "89": "3.1 Model Architecture  Let (x, y) be a pair of input and output of implicit relation classification, where x = (x1,x2) is a pair of sentence arguments, and y is the underlying discourse relation.", 
        "90": "Each training example also includes an annotated implicit connective c that best expresses the relation.", 
        "91": "Figure 1 shows the architecture of our framework.", 
        "92": "The neural model for implicit relation classification (i-CNN in the figure) extracts latent representation from the arguments, denoted as HI(x1,x2), and feeds the feature into a classifier C for final prediction C(HI(x1,x2)).", 
        "93": "For ease of notation, we will also use HI(x) to denote the latent feature on data x.", 
        "94": "The second relation network (a-CNN) takes as inputs the sentence arguments along with an implicit connective, to induce the connectiveaugmented representation HA(x1,x2, c), and obtains relation prediction C(HA(x1,x2, c)).", 
        "95": "Note that the same final classifierC is used for both networks, so that the feature representations by the two networks are ensured to be within the same semantic space, enabling feature emulation as presented shortly.", 
        "96": "We further pair the implicit network with a rival discriminator D to form our adversarial game.", 
        "97": "The discriminator is to differentiate between the reasoning behaviors of the implicit network i-CNN and the augmented network a-CNN.", 
        "98": "Specifically, D is a binary classifier that takes as inputs a la-\ntent feature H derived from either i-CNN or aCNN given appropriate data (where implicit connectives is either missing or present, respectively).", 
        "99": "The output D(H) estimates the probability that H comes from the connective-augmented a-CNN rather than i-CNN.", 
        "100": "3.2 Training Procedure  The system is trained through an alternating optimization procedure that updates the components in an interleaved manner.", 
        "101": "In this section, we first present the training objective for each component, and then give the overall training algorithm.", 
        "102": "Let θD denote the parameters of the discriminator.", 
        "103": "The training objective ofD is straightforward, i.e., to maximize the probability of correctly distinguishing the input features:\nmax θD LD = E(x,c,y)∼data\n[ logD(HA(x, c);θD)+\nlog(1−D(HI(x);θD)) ] , (1)\nwhere E(x,c,y)∼data[·] denotes the expectation in terms of the data distribution.", 
        "104": "We denote the parameters of the implicit network i-CNN and the classifier C as θI and θC , respectively.", 
        "105": "The model is then trained to (a) correctly classify relations in training data and (b) produce salient features close to connectiveaugmented ones.", 
        "106": "The first objective can be fulfilled by minimizing the usual cross-entropy loss:\nLI,C(θI ,θC) = E(x,y)∼data [ J ( C(HI(x;θI);θC), y )] ,\n(2)\nAlgorithm 1 Adversarial Model for Implicit Recognition Input: Training data {(x, c, y)n}\nParameters: λ1, λ2 – balancing parameters 1: Initialize {θI ,θC} and {θA} by minimizing\nEq.", 
        "107": "(2) and Eq.", 
        "108": "(4), respectively 2: repeat 3: Train the discriminator through Eq.", 
        "109": "(1) 4: Train the relation models through Eq.", 
        "110": "(5) 5: until convergence\nOutput: Adversarially enhanced implicit relation network i-CNN with classifier C for prediction\nwhere J(p, y) = −∑k I(y = k) log pk is the cross-entropy loss between predictive distribution p and ground-truth label y.", 
        "111": "We achieve objective (b) by minimizing the discriminator’s chance of correctly telling apart the features:\nLI(θI) = Ex∼data [ log ( 1−D(HI(x;θI)) )] .", 
        "112": "(3)\nThe parameters of the augmented network aCNN, denoted as θA, can be learned by simply fitting to the data, i.e., minimizing the cross-entropy loss as follows:\nLA(θA) = E(x,c,y)∼data [ J ( C(HA(x, c;θA)), y )] .", 
        "113": "(4)\nAs mentioned above, here we use the same classifierC as for the implicit network, forcing a unified feature space of both networks.", 
        "114": "We combine the above objectives Eqs.", 
        "115": "(2)-(4) of the relation classifiers and minimize the joint loss:\nmin θI ,θA,θC LI,A,C = LI,C(θI ,θC) + λ1LI(θI) + λ2LA(θA), (5)\nwhere λ1 and λ2 are two balancing parameters calibrating the weights of the classification losses and the feature-regulating loss.", 
        "116": "In practice, we pretrain the implicit and augmented networks independently by minimizing Eq.", 
        "117": "(2) and Eq.", 
        "118": "(4), respectively.", 
        "119": "In the adversarial training process, we found setting λ2 = 0 gives stable convergence.", 
        "120": "That is, the connective-augmented features are fixed after the pre-training stage.", 
        "121": "Algorithm 1 summarizes the training procedure, where we interleave the optimization of Eq.", 
        "122": "(1) and Eq.", 
        "123": "(5) at each iteration.", 
        "124": "More practical details are provided in section 4.", 
        "125": "We instantiate all modules as neural networks (section 3.3) which are differentiable, and perform the optimization efficiently through standard stochastic gradient descent and back-propagation.", 
        "126": "Through Eq.", 
        "127": "(1) and Eq.", 
        "128": "(3), the discriminator and the implicit relation network follow a minimax competition, which drives both to improve until the implicit feature representations are close to the connective-augmented latent representations, encouraging the implicit network to extract highly discriminative features from raw sentence arguments for relation classification.", 
        "129": "Alternatively, we can see Eq.", 
        "130": "(3) as an adaptive regularization on the implicit model, which, compared to pre-fixed regularizors such as `2-regularization, provides a more flexible, self-calibrated mechanism to improve generalization ability.", 
        "131": "3.3 Component Structures  We have presented our adversarial framework for implicit relation classification.", 
        "132": "We now discuss the model realization of each component.", 
        "133": "All components of the framework are parameterized with neural networks.", 
        "134": "Distinct roles of the modules in the framework lead to different modeling choices.", 
        "135": "Relation Classification Networks Figure 2 illustrates the structure of the implicit relation network i-CNN.", 
        "136": "We use a convolutional network as it is a common architectural choice for discourse parsing.", 
        "137": "The network takes as inputs the word vectors of the tokens in each sentence argument, and maps each argument to intermediate features through a shared convolutional layer.", 
        "138": "The resulting representations are then concatenated and fed into a max pooling layer to select most salient features as the final representation.", 
        "139": "The final classifier C is a simple fully-connected layer followed by a softmax classifier.", 
        "140": "The connective-augmented network a-CNN has a similar structure as i-CNN, wherein implicit connective is appended to the second sentence as input.", 
        "141": "The key difference from i-CNN is that here we adopt average k-max pooling, which takes the average of the top-k maximum values in each pooling window.", 
        "142": "The reason is to prevent the network from solely selecting the connective induced features (which are typically the most salient features) which would be the case when using max pooling, but instead force it to also attend to contextual features derived from the arguments.", 
        "143": "This facilitates more homogeneous output features of the two networks, and thus facilitates feature imitation.", 
        "144": "In all the experiments we fixed k = 2.", 
        "145": "Discriminator The discriminator is a binary classifier to identify the correct source of an input feature vector.", 
        "146": "To make it a strong rival to the feature imitating network (i-CNN), we model the discriminator as a multi-layer perceptron (MLP) enhanced with gated mechanism for efficient information flow (Srivastava et al., 2015; Qin et al., 2016c), as shown in Figure 3.", 
        "147": "4 Experiments  We demonstrate the effectiveness of our approach both quantitatively and qualitatively with extensive experiments.", 
        "148": "We evaluate prediction performance on the PDTB benchmark in different settings.", 
        "149": "Our method substantially improves over a\ndiverse set of previous models, especially in the practical multi-class classification task.", 
        "150": "We perform in-depth analysis of the model behaviors, and show our adversarial framework successfully enables the implicit relation model to imitate and learn discriminative features.", 
        "151": "4.1 Experiment Setup  We use PDTB 2.01, one of the largest manually annotated discourse relation corpus.", 
        "152": "The dataset contains 16,224 implicit relation instances in total, with three levels of senses: Level-1 Class, Level-2 Type, and Level-3 Subtypes.", 
        "153": "The 1st level consists of four major relation Classes: COMPARISON, CONTINGENCY, EXPANSION and TEMPORAL.", 
        "154": "The 2nd level contains 16 Types.", 
        "155": "To make extensive comparison with prior work of implicit discourse relation classification, we evaluate on two popular experimental settings: 1) multi-class classification for 2nd-level types (Lin et al., 2009; Ji and Eisenstein, 2015), and 2) oneversus-others binary classifications for 1st-level classes (Pitler et al., 2009).", 
        "156": "We describe the detailed configurations in the following respective sections.", 
        "157": "We will focus our analysis on the multiclass classification setting, which is most realistic in practice and serves as a building block for a complete discourse parser such as that for the shared tasks of CoNLL-2015 and 2016 (Xue et al., 2015, 2016).", 
        "158": "Model Training Here we provide the detailed architecture configurations of each component we used in the experiments.", 
        "159": "• Throughout the experiments i-CNN and aCNN contain 3 sets of convolutional filters with the filter sizes selected on the dev set.", 
        "160": "Table 1 lists the filter configurations of the convolutional layer in i-CNN and a-CNN in different tasks.", 
        "161": "As described in section 3.3, following the convolutional layer is a max pooling layer in i-CNN, and an average kmax pooling layer with k = 2 in a-CNN.", 
        "162": "• The final single-layer classifier C contains 512 neurons with tanh activation function.", 
        "163": "• The discriminator D consists of 4 fullyconnected layers, with 2 gated pathways from layer 1 to layer 3 and layer 4 (see Figure 3).", 
        "164": "1http://www.seas.upenn.edu/∼pdtb/\nThe size of each layer is set to 1024 and is fixed in all the experiments.", 
        "165": "• We set the dimension of the input word vectors to 300 and initialize with pre-trained word2vec (Mikolov et al., 2013).", 
        "166": "The maximum length of sentence argument is set to 80.", 
        "167": "Truncation and zero-padding are applied when necessary.", 
        "168": "All experiments were performed on a TITAN-X GPU and 128GB RAM, with neural implementation based on Tensorflow2.", 
        "169": "For adversarial model training, it is critical to keep balance between the progress of the two players.", 
        "170": "We use a simple strategy which at each iteration optimizes the discriminator and the implicit relation network on a randomly-sampled minibatch.", 
        "171": "We found this is enough to stabilize the training.", 
        "172": "The neural parameters are trained using AdaGrad (Duchi et al., 2011) with an initial learning rate of 0.001.", 
        "173": "For the balancing parameters in Eq.", 
        "174": "(5), we set λ1 = 0.1, while λ2 = 0.", 
        "175": "That is, after the initialization stage the weights of the connective-augmented network a-CNN are fixed.", 
        "176": "This has been shown capable of giving stable and good predictive performance for our system.", 
        "177": "4.2 Implicit Relation Classification  We will mainly focus on the general multi-class classification problem in two alternative settings adopted in prior work, showing the superiority of our model over previous state of the arts.", 
        "178": "We perform in-depth comparison with carefully designed baselines, providing empirical insights into the working mechanism of the proposed framework.", 
        "179": "For broader comparisons we also report the performance in the one-versus-all setting.", 
        "180": "2https://www.tensorflow.org\nMulti-class Classifications We first adopt the standard PDTB splitting convention following (Lin et al., 2009), denoted as PDTB-Lin, where sections 2-21, 22, and 23 are used as training, dev, and test sets, respectively.", 
        "181": "The most frequent 11 types of relations are selected in the task.", 
        "182": "During training, instances with more than one annotated relation types are considered as multiple instances, each of which has one of the annotations.", 
        "183": "At test time, a prediction that matches one of the gold types is considered as correct.", 
        "184": "The test set contains 766 examples.", 
        "185": "More details are in (Lin et al., 2009).", 
        "186": "An alternative, slightly different multi-class setting is used in (Ji and Eisenstein, 2015), denoted as PDTB-Ji, where sections 2-20, 0-1, and 21-22 are used as training, dev, and test sets, respectively.", 
        "187": "The resulting test set contains 1039 examples.", 
        "188": "We also evaluate in this setting for thorough comparisons.", 
        "189": "Table 2 shows the classification accuracy in both of the settings.", 
        "190": "We see that our model (Row 10) achieves state-of-the-art performance, greatly outperforming previous methods (Rows 6- 9) with various modeling paradigms, including the linguistic feature-based model (Lin et al., 2009), pure neural methods (Qin et al., 2016c), and combined approach (Ji and Eisenstein, 2015).", 
        "191": "To obtain better insights into the working mechanism of our method, we further compare with a set of carefully selected baselines as shown in Rows 1-5.", 
        "192": "1) “Word-vector” sums over the word vectors for sentence representation, showing the base effect of word embeddings.", 
        "193": "2) “CNN” is a standalone convolutional net having the exact same architecture with our implicit rela-\ntion network.", 
        "194": "Our model trained within the proposed framework provides significant improvement, showing the benefits of utilizing implicit connectives at training time.", 
        "195": "3) “Ensemble” has the same neural architecture with the proposed framework except that the input of a-CNN is not augmented with implicit connectives.", 
        "196": "This essentially is an ensemble of two implicit recognition networks.", 
        "197": "We see that the method performs even inferior to the single CNN model.", 
        "198": "This further confirms the necessity of exploiting connective information.", 
        "199": "4) “Multi-task” is the convolutional net augmented with an additional task of simultaneously predicting the implicit connectives based on the network features.", 
        "200": "As a straightforward way of incorporating connectives, we see that the method slightly improves over the stand-alone CNN, while falling behind our approach with a large margin.", 
        "201": "This indicates that our proposed feature imitation is a more effective scheme for making use of implicit connectives.", 
        "202": "5) At last, “`2-reg” also implements feature mimicking by imposing an `2 distance penalty between the implicit relation features and connective-augmented features.", 
        "203": "We see that the simple model has obtained improvement over previous best-performing systems in both settings, further validating the idea of imitation.", 
        "204": "However, in contrast to the fixed `2 regularization, our adversarial framework provides an adaptive mechanism, which is more flexible and performs better as shown in the table.", 
        "205": "One-versus-all Classifications We also report the results of four one-versus-all binary classifications for more comparisons with prior work.", 
        "206": "We follow the conventional experimental setting (Pitler et al., 2009) by selecting sections 2-20, 21-22, and 0-1 as training, dev, and test sets.", 
        "207": "Table 4 lists the statistics of the data.", 
        "208": "Following previous work, Table 3 reports the F1\nscores.", 
        "209": "Our method outperforms most of the prior systems in all the tasks.", 
        "210": "We achieve state-of-theart performance in recognition of the Expansion relation, and obtain comparable scores with the best-performing methods in each of the other relations, respectively.", 
        "211": "Notably, our feature imitation scheme greatly improves over (Zhou et al., 2010) which leverages implicit connectives as an intermediate prediction task.", 
        "212": "This provides additional evidence for the effectiveness of our approach.", 
        "213": "4.3 Qualitative Analysis  We now take a closer look into the modeling behavior of our framework, by investigating the process of the adversarial game during training, as well as the feature imitation effects.", 
        "214": "Figure 4 demonstrates the training progress of different components.", 
        "215": "The a-CNN network keeps high predictive accuracy as implicit connectives are given, showing the importance of connective cues.", 
        "216": "The rise-and-fall patterns in the accuracy of the discriminator clearly show its competition with the implicit relation network i-CNN as training goes.", 
        "217": "At first few iterations the accuracy of the discriminator increases quickly to over 0.9, while at late stage the accuracy drops to around 0.6, showing that the discriminator is getting confused by i-CNN (an accuracy of 0.5 indicates full confusion).", 
        "218": "The i-CNN network keeps improving in terms of implicit relation classification accuracy, as it is gradually fitting to the data and simultaneously learning increasingly discriminative features by mimicking a-CNN.", 
        "219": "The system exhibits similar learning patterns in the two different settings, showing the stability of the training strategy.", 
        "220": "We finally visualize the output feature vectors of i-CNN and a-CNN using the t-SNE method (Maaten and Hinton, 2008) in Figure 5.", 
        "221": "Without feature imitation, the extracted features by the two networks are clearly separated (Figure 5(a)).", 
        "222": "In contrast, as shown in Figures 5(b)(c), the feature vectors are increasingly mixed as training proceeds.", 
        "223": "Thus our framework has suc-\ncessfully driven i-CNN to induce similar representations with a-CNN, even though connectives are not present.", 
        "224": "5 Discussions  We have developed an adversarial neural framework that facilitates an implicit relation network to extract highly discriminative features by mimicking a connective-augmented network.", 
        "225": "Our method achieved state-of-the-art performance for implicit discourse relation classification.", 
        "226": "Besides implicit connective examples, our model can naturally exploit enormous explicit connective data to further improve discourse parsing.", 
        "227": "The proposed adversarial feature imitation scheme is also generally applicable to other context to incorporate indicative side information\navailable at training time for enhanced inference.", 
        "228": "Our framework shares a similar spirit of the iterative knowledge distillation method (Hu et al., 2016a,b) which train a “student” network to mimic the classification behavior of a knowledgeinformed “teacher” network.", 
        "229": "Our approach encourages imitation on the feature level instead of the final prediction level.", 
        "230": "This allows our approach to apply to regression tasks, and more interestingly, the context in which the student and teacher networks have different prediction outputs, e.g., performing different tasks, while transferring knowledge between each other can be beneficial.", 
        "231": "Besides, our adversarial mechanism provides an adaptive metric to measure and drive the imitation procedure."
    }, 
    "document_id": "P17-1093.pdf.json"
}
