{
    "abstract_sentences": {
        "1": "Type-level word embeddings use the same set of parameters to represent all instances of a word regardless of its context, ignoring the inherent lexical ambiguity in language.", 
        "2": "Instead, we embed semantic concepts (or synsets) as defined in WordNet and represent a word token in a particular context by estimating a distribution over relevant semantic concepts.", 
        "3": "We use the new, context-sensitive embeddings in a model for predicting prepositional phrase (PP) attachments and jointly learn the concept embeddings and model parameters.", 
        "4": "We show that using context-sensitive embeddings improves the accuracy of the PP attachment model by 5.4% absolute points, which amounts to a 34.4% relative reduction in errors."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 2089–2098 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1191  1 Introduction  Type-level word embeddings map a word type (i.e., a surface form) to a dense vector of real numbers such that similar word types have similar embeddings.", 
        "2": "When pre-trained on a large corpus of unlabeled text, they provide an effective mechanism for generalizing statistical models to words which do not appear in the labeled training data for a downstream task.", 
        "3": "In accordance with standard terminology, we make the following distinction between types and tokens in this paper: By word types, we mean the surface form of the word, whereas by tokens we mean the instantiation of the surface form in a context.", 
        "4": "For example, the same word type ‘pool’ occurs as two different tokens in the sentences “He sat by the pool,” and “He played a game of pool.”\nMost word embedding models define a single vector for each word type.", 
        "5": "However, a fundamen-\ntal flaw in this design is their inability to distinguish between different meanings and abstractions of the same word.", 
        "6": "In the two sentences shown above, the word ‘pool’ has different meanings, but the same representation is typically used for both of them.", 
        "7": "Similarly, the fact that ‘pool’ and ‘lake’ are both kinds of water bodies is not explicitly incorporated in most type-level embeddings.", 
        "8": "Furthermore, it has become a standard practice to tune pre-trained word embeddings as model parameters during training for an NLP task (e.g., Chen and Manning, 2014; Lample et al., 2016), potentially allowing the parameters of a frequent word in the labeled training data to drift away from related but rare words in the embedding space.", 
        "9": "Previous work partially addresses these problems by estimating concept embeddings in WordNet (e.g., Rothe and Schütze, 2015), or improving word representations using information from knowledge graphs (e.g., Faruqui et al., 2015).", 
        "10": "However, it is still not clear how to use a lexical ontology to derive context-sensitive token embeddings.", 
        "11": "In this work, we represent a word token in a given context by estimating a context-sensitive probability distribution over relevant concepts in WordNet (Miller, 1995) and use the expected value (i.e., weighted sum) of the concept embeddings as the token representation (see §2).", 
        "12": "We take a task-centric approach towards doing this, and learn the token representations jointly with the task-specific parameters.", 
        "13": "In addition to providing context-sensitive token embeddings, the proposed method implicitly regularizes the embeddings of related words by forcing related words to share similar concept embeddings.", 
        "14": "As a result, the representation of a rare word which does not appear in the training data for a downstream task benefits from all the updates to related words which share one or more concept embeddings.", 
        "15": "2089\nOur approach to context-sensitive embeddings assumes the availability of a lexical ontology.", 
        "16": "While this work relies on WordNet, and we exploit the order of senses given by WordNet, our model is, in principle applicable to any ontology, with appropriate modifications.", 
        "17": "In this work, we do not assume the inputs are sense tagged.", 
        "18": "We use the proposed embeddings to predict prepositional phrase (PP) attachments (see §3), a challenging problem which emphasizes the selectional preferences between words in the PP and each of the candidate head words.", 
        "19": "Our empirical results and detailed analysis (see §4) show that the proposed embeddings effectively use WordNet to improve the accuracy of PP attachment predictions.", 
        "20": "2 WordNet-Grounded Context-Sensitive Token Embeddings  In this section, we focus on defining our contextsensitive token embeddings.", 
        "21": "We first describe our grounding of word types using WordNet concepts.", 
        "22": "Then, we describe our model of contextsensitive token-level embeddings as a weighted sum of WordNet concept embeddings.", 
        "23": "2.1 WordNet Grounding  We use WordNet to map each word type to a set of synsets, including possible generalizations or ab-\nstractions.", 
        "24": "Among the labeled relations defined in WordNet between different synsets, we focus on the hypernymy relation to help model generalization and selectional preferences between words, which is especially important for predicting PP attachments (Resnik, 1993).", 
        "25": "To ground a word type, we identify the set of (direct and indirect) hypernyms of the WordNet senses of that word.", 
        "26": "A simplified grounding of the word ‘pool’ is illustrated in Figure 1.", 
        "27": "This grounding is key to our model of token embeddings, to be described in the following subsections.", 
        "28": "2.2 Context-Sensitive Token Embeddings  Our goal is to define a context-sensitive model of token embeddings which can be used as a dropin replacement for traditional type-level word embeddings.", 
        "29": "Notation.", 
        "30": "Let Senses(w) be the list of synsets defined as possible word senses of a given word type w in WordNet, and Hypernyms(s) be the list of hypernyms for a synset s.1 For example, according to Figure 1:\nSenses(pool) = [pond.n.01, pool.n.09], and\nHypernyms(pond.n.01) = [pond.n.01, lake.n.01,\nbody of water.n.01, entity.n.01]\nEach WordNet synset s is associated with a set of parameters vs ∈ Rn which represent its embedding.", 
        "31": "This parameterization is similar to that of Rothe and Schütze (2015).", 
        "32": "Embedding model.", 
        "33": "Given a sequence of tokens t and their corresponding word types w, let ui ∈ Rn be the embedding of the word token ti at position i.", 
        "34": "Unlike most embedding models, the token embeddings ui are not parameters.", 
        "35": "Rather, ui is computed as the expected value of concept embeddings used to ground the word type wi corresponding to the token ti: ui = ∑\ns∈Senses(wi)\n∑\ns′∈Hypernyms(s) p(s, s′ | t,w, i) vs′\n(1)\nsuch that ∑\ns∈Senses(wi)\n∑\ns′∈Hypernyms(s) p(s, s′ | t,w, i) = 1\n1For notational convenience, we assume that s ∈ Hypernyms(s).", 
        "36": "The distribution which governs the expectation over synset embeddings factorizes into two components:\np(s, s′ | t,w, i) ∝λwi exp−λwi rank(s,wi)× MLP([vs′ ; context(i, t)]) (2)\nThe first component, λwi exp −λwi rank(s,wi), is a sense prior which reflects the prominence of each word sense for a given word type.", 
        "37": "Here, we exploit2 the fact that WordNet senses are ordered in descending order of their frequencies, obtained from sense tagged corpora, and parameterize the sense prior like an exponential distribution.", 
        "38": "rank(s, wi) denotes the rank of sense s for the word type wi, thus rank(s, wi) = 0 corresponds to s being the first sense of wi.", 
        "39": "The scalar parameter (λwi) controls the decay of the probability mass, which is learned along with the other parameters in the model.", 
        "40": "Note that sense priors are defined for each word type (wi), and are shared across all tokens which have the same word type.", 
        "41": "MLP([vs′ ; context(i, t)]), the second component, is what makes the token representations context-sensitive.", 
        "42": "It scores each concept in the WordNet grounding of wi by feeding the concatenation of the concept embedding and a dense vec-\n2Note that for ontologies where such information is not available, our method is still applicable but without this component.", 
        "43": "We show the effect of using a uniform sense prior in §4.2.", 
        "44": "tor that summarizes the textual context into a multilayer perceptron (MLP) with two tanh layers followed by a softmax layer.", 
        "45": "This component is inspired by the soft attention often used in neural machine translation (Bahdanau et al., 2014).3 The definition of the context function is dependent on the encoder used to encode the context.", 
        "46": "We describe a specific instantiation of this function in §3.", 
        "47": "To summarize, Figure 2 illustrates how to compute the embedding of a word token ti = ‘pool’ in a given context:\n1. compute a summary of the context context(i, t),\n2. enumerate related concepts for ti,\n3. compute p(s, s′ | t,w, i) for each pair (s, s′), and\n4. compute ui = E[vs′ ].", 
        "48": "In the following section, we describe our model for predicting PP attachments, including our definition for context.", 
        "49": "3 PP Attachment  Disambiguating PP attachments is an important and challenging NLP problem.", 
        "50": "Since modeling hypernymy and selectional preferences is critical for successful prediction of PP attachments (Resnik, 1993), it is a good fit for evaluating our WordNet-grounded context-sensitive embeddings.", 
        "51": "Figure 3, reproduced from Belinkov et al.", 
        "52": "(2014), illustrates an example of the PP attachment prediction problem.", 
        "53": "The accuracy of a competitive English dependency parser at predicting the head word of an ambiguous prepositional phrase is 88.5%, significantly lower than the overall unlabeled attachment accuracy of the same parser (94.2%).4\nThis section formally defines the problem of PP attachment disambiguation, describes our baseline model, then shows how to integrate the token-level embeddings in the model.", 
        "54": "3.1 Problem Definition  We follow Belinkov et al.", 
        "55": "(2014)’s definition of the PP attachment problem.", 
        "56": "Given a preposition p and\n3Although soft attention mechanism is typically used to explicitly represent the importance of each item in a sequence, it can also be applied to non-sequential items.", 
        "57": "4See Table 2 in §4 for detailed results.", 
        "58": "its direct dependent d in the prepositional phrase (PP), our goal is to predict the correct head word for the PP among an ordered list of candidate head words h. Each example in the train, validation, and test sets consists of an input tuple 〈h, p, d〉 and an output index k to identify the correct head among the candidates in h. Note that the order of words that form each 〈h, p, d〉 is the same as that in the corresponding original sentence.", 
        "59": "3.2 Model Definition  Both our proposed and baseline models for PP attachment use bidirectional RNN with LSTM cells (bi-LSTM) to encode the sequence t = 〈h1, .", 
        "60": ".", 
        "61": ".", 
        "62": ", hK , p, d〉.", 
        "63": "We score each candidate head by feeding the concatenation of the output bi-LSTM vectors for the head hk, the preposition p and the direct dependent d through an MLP, with a fully connected tanh layer to obtain a non-linear projection of the concatenation, followed by a fully-connected softmax layer:\np(hkis head) = MLPattach([lstm out(hk);\nlstm out(p);\nlstm out(d)]) (3)\nTo train the model, we use cross-entropy loss at the output layer for each candidate head in the\ntraining set.", 
        "64": "At test time, we predict the candidate head with the highest probability according to the model in Eq.", 
        "65": "3, i.e.,\nk̂ = argmax k p(hkis head = 1).", 
        "66": "(4)\nThis model is inspired by the Head-Prep-ChildTernary model of Belinkov et al.", 
        "67": "(2014).", 
        "68": "The main difference is that we replace the input features for each token with the output bi-RNN vectors.", 
        "69": "We now describe the difference between the proposed and the baseline models.", 
        "70": "Generally, let lstm in(ti) and lstm out(ti) represent the input and output vectors of the bi-LSTM for each token ti ∈ t in the sequence.", 
        "71": "The outputs at each timestep are obtained by concatenating those of the forward and backward LSTMs.", 
        "72": "Baseline model.", 
        "73": "In the baseline model, we use type-level word embeddings to represent the input vector lstm in(ti) for a token ti in the sequence.", 
        "74": "The word embedding parameters are initialized with pre-trained vectors, then tuned along with the parameters of the bi-LSTM and MLPattach.", 
        "75": "We call this model LSTM-PP.", 
        "76": "Proposed model.", 
        "77": "In the proposed model, we use token level word embedding as described in §2 as the input to the bi-LSTM, i.e., lstm in(ti) = ui.", 
        "78": "The context used for the attention component is simply the hidden state from the previous timestep.", 
        "79": "However, since we use a bi-LSTM, the model essentially has two RNNs, and accordingly we have two context vectors, and associated attentions.", 
        "80": "That is, contextf (i, t) = lstm in(ti−1) for the forward RNN and contextb(i, t) = lstm in(ti+1) for the backward RNN.", 
        "81": "Consequently, each token gets two representations, one from each RNN.", 
        "82": "The synset embedding parameters are initialized with pre-trained vectors and tuned along with the sense decay (λw) and MLP parameters from Eq.", 
        "83": "2, the parameters of the biLSTM and those of MLPattach.", 
        "84": "We call this model OntoLSTM-PP.", 
        "85": "4 Experiments  Dataset and evaluation.", 
        "86": "We used the English PP attachment dataset created and made available by Belinkov et al.", 
        "87": "(2014).", 
        "88": "The training and test splits contain 33,359 and 1951 labeled examples respectively.", 
        "89": "As explained in §3.1, the input for each example is 1) an ordered list of candidate head words, 2) the preposition, and 3) the direct\ndependent of the preposition.", 
        "90": "The head words are either nouns or verbs and the dependent is always a noun.", 
        "91": "All examples in this dataset have at least two candidate head words.", 
        "92": "As discussed in Belinkov et al.", 
        "93": "(2014), this dataset is a more realistic PP attachment task than the RRR dataset (Ratnaparkhi et al., 1994).", 
        "94": "The RRR dataset is a binary classification task with exactly two head word candidates in all examples.", 
        "95": "The context for each example in the RRR dataset is also limited which defeats the purpose of our context-sensitive embeddings.", 
        "96": "Model specifications and hyperparameters.", 
        "97": "For efficient implementation, we use mini-batch updates with the same number of senses and hypernyms for all examples, padding zeros and truncating senses and hypernyms as needed.", 
        "98": "For each word type, we use a maximum of S senses and H indirect hypernyms from WordNet.", 
        "99": "In our initial experiments on a held-out development set (10% of the training data), we found that values greater than S = 3 and H = 5 did not improve performance.", 
        "100": "We also used the development set to tune the number of layers in MLPattach separately for the OntoLSTM-PP and LSTM-PP, and the number of layers in the attention MLP in OntoLSTM-PP.", 
        "101": "When a synset has multiple hypernym paths, we use the shortest one.", 
        "102": "Finally, words types which do not appear in WordNet are assumed to have one unique sense per word type with no hypernyms.", 
        "103": "Since the POS tag for each word is included in the dataset, we exclude WordNet synsets which are incompatible with the POS tag.", 
        "104": "The synset embedding parameters are initialized using the synset vectors obtained by running AutoExtend (Rothe and Schütze, 2015) on 100- dimensional GloVe (Pennington et al., 2014) vectors for WordNet 3.1.", 
        "105": "We refer to this embedding as GloVe-extended.", 
        "106": "Representation for the OOV word types in LSTM-PP and OOV synset types in OntoLSTM-PP were randomly drawn from a uniform 100-d distribution.", 
        "107": "Initial sense prior parameters (λw) were also drawn from a uniform 1-d distribution.", 
        "108": "Baselines.", 
        "109": "In our experiments, we compare our proposed model, OntoLSTM-PP with three baselines – LSTM-PP initialized with GloVe embedding, LSTM-PP initialized with GloVe vectors retrofitted to WordNet using the approach of Faruqui et al.", 
        "110": "(2015) (henceforth referred to as GloVe-retro), and finally the best performing stan-\ndalone PP attachment system from Belinkov et al.", 
        "111": "(2014), referred to as HPCD (full) in the paper.", 
        "112": "HPCD (full) is a neural network model that learns to compose the vector representations of each of the candidate heads with those of the preposition and the dependent, and predict attachments.", 
        "113": "The input representations are enriched using syntactic context information, POS, WordNet and VerbNet (Kipper et al., 2008) information and the distance of the head word from the PP is explicitly encoded in composition architecture.", 
        "114": "In contrast, we do not use syntactic context, VerbNet and distance information, and do not explicitly encode POS information.", 
        "115": "4.1 PP Attachment Results  Table 1 shows that our proposed token level embedding scheme OntoLSTM-PP outperforms the better variant of our baseline LSTM-PP (with GloVe-retro intialization) by an absolute accuracy difference of 4.9%, or a relative error reduction of 32%.", 
        "116": "OntoLSTM-PP also outperforms HPCD (full), the previous best result on this dataset.", 
        "117": "Initializing the word embeddings with GloVeretro (which uses WordNet as described in Faruqui et al.", 
        "118": "(2015)) instead of GloVe amounts to a small improvement, compared to the improvements obtained using OntoLSTM-PP.", 
        "119": "This result illustrates that our approach of dynamically choosing a context sensitive distribution over synsets is a more effective way of making use of WordNet.", 
        "120": "Effect on dependency parsing.", 
        "121": "Following Belinkov et al.", 
        "122": "(2014), we used RBG parser (Lei et al., 2014), and modified it by adding a binary feature indicating the PP attachment predictions from our model.", 
        "123": "We compare four ways to compute the additional binary features: 1) the predictions of the best standalone system HPCD (full) in Belinkov et al.", 
        "124": "(2014), 2) the predictions of our baseline model LSTM-PP, 3) the predictions of our improved model OntoLSTM-PP, and 4) the gold labels Oracle PP.", 
        "125": "Table 2 shows the effect of using the PP attachment predictions as features within a dependency parser.", 
        "126": "We note there is a relatively small difference in unlabeled attachment accuracy for all dependencies (not only PP attachments), even when gold PP attachments are used as additional features to the parser.", 
        "127": "However, when gold PP attachment are used, we note a large potential improve-\nment of 10.46 points in PP attachment accuracies (between the PPA accuracy for RBG and RBG + Oracle PP), which confirms that adding PP predictions as features is an effective approach.", 
        "128": "Our proposed model RBG + OntoLSTM-PP recovers 15% of this potential improvement, while RBG + HPCD (full) recovers 10%, which illustrates that PP attachment remains a difficult problem with plenty of room for improvements even when using a dedicated model to predict PP attachments and using its predictions in a dependency parser.", 
        "129": "We also note that, although we use the same predictions of the HPCD (full) model in Belinkov et al.", 
        "130": "(2014)5, we report different results than Belinkov et al.", 
        "131": "(2014).", 
        "132": "For example, the unlabeled attachment score (UAS) of the baselines RBG and RBG + HPCD (full) are 94.17 and 94.19, respectively, in Table 2, compared to 93.96 and 94.05, respectively, in Belinkov et al.", 
        "133": "(2014).", 
        "134": "This is due to the use of different versions of the RBG parser.6  4.2 Analysis  In this subsection, we analyze different aspects of our model in order to develop a better understand-\n5The authors kindly provided their predictions for 1942 test examples (out of 1951 examples in the full test set).", 
        "135": "In Table 2, we use the same subset of 1942 test examples and will include a link to the subset in the final draft.", 
        "136": "6We use the latest commit (SHA: e07f74) on the GitHub repository of the RGB parser.", 
        "137": "ing of its behavior.", 
        "138": "Effect of context sensitivity and sense priors.", 
        "139": "We now show some results that indicate the relative strengths of two components of our contextsensitive token embedding model.", 
        "140": "The second row in Table 3 shows the test accuracy of a system trained without sense priors (that is, making p(s|wi) from Eq.", 
        "141": "1 a uniform distribution), and the third row shows the effect of making the token representations context-insensitive by giving a similar attention score to all related concepts, essentially making them type level representations, but still grounded in WordNet.", 
        "142": "As it can be seen, removing context sensitivity has an adverse effect on the results.", 
        "143": "This illustrates the importance of the sense priors and the attention mechanism.", 
        "144": "It is interesting that, even without sense priors and attention, the results with WordNet grounding is still higher than that of the two LSTM-PP systems in Table 1.", 
        "145": "This result illustrates the regularization behavior of sharing concept embeddings across multiple words, which is especially important for rare words.", 
        "146": "Effect of training data size.", 
        "147": "Since OntoLSTMPP uses external information, the gap between the model and LSTM-PP is expected to be more pronounced when the training data sizes are smaller.", 
        "148": "To test this hypothesis, we trained the two models with different amounts of training data and measured their accuracies on the test set.", 
        "149": "The plot is shown in Figure 4.", 
        "150": "As expected, the gap tends to be larger at smaller data sizes.", 
        "151": "Surprisingly, even with 2000 sentences in the training data set, OntoLSTM-PP outperforms LSTM-PP trained with the full data set.", 
        "152": "When both the models are trained with the full dataset, LSTM-PP reaches a training accuracy of 95.3%, whereas OntoLSTMPP reaches 93.5%.", 
        "153": "The fact that LSTM-PP is overfitting the training data more, indicates the regular-\nization capability of OntoLSTM-PP.", 
        "154": "Qualitative analysis.", 
        "155": "To better understand the effect of WordNet grounding, we took a sample of 100 sentences from the test set whose PP attachments were correctly predicted by OntoLSTMPP but not by LSTM-PP.", 
        "156": "A common pattern observed was that those sentences contained words not seen frequently in the training data.", 
        "157": "Figure 5 shows two such cases.", 
        "158": "In both cases, the weights assigned by OntoLSTM-PP to infrequent words are also shown.", 
        "159": "The word types soapsuds and buoyancy do not occur in the training data, but OntoLSTM-PP was able to leverage the parameters learned for the synsets that contributed to their token representations.", 
        "160": "Another important observation is that the word type buoyancy has four senses in WordNet (we consider the first three), none of which is the metaphorical sense that is applicable to markets as shown in the example here.", 
        "161": "Selecting a combination of relevant hypernyms from various senses may have helped OntoLSTM-PP make the right prediction.", 
        "162": "This shows the value of using hypernymy information from WordNet.", 
        "163": "Moreover, this indicates the strength of the hybrid nature of the model, that lets it augment ontological information with distributional information.", 
        "164": "Parameter space.", 
        "165": "We note that the vocabulary sizes in OntoLSTM-PP and LSTM-PP are comparable as the synset types are shared across word types.", 
        "166": "In our experiments with the full PP attachment dataset, we learned embeddings for 18k synset types with OntoLSTM-PP and 11k word types with LSTM-PP.", 
        "167": "Since the biggest contribution to the parameter space comes from the embedding layer, the complexities of both the models are comparable.", 
        "168": "5 Related Work  This work is related to various lines of research within the NLP community: dealing with synonymy and homonymy in word representations both in the context of distributed embeddings and more traditional vector spaces; hybrid models of distributional and knowledge based semantics; and selectional preferences and their relation with syntactic and semantic relations.", 
        "169": "The need for going beyond a single vector per word-type has been well established for a while, and many efforts were focused on building multi-prototype vector space models of meaning (Reisinger and Mooney, 2010; Huang et al., 2012; Chen et al., 2014; Jauhar et al., 2015; Neelakantan et al., 2015; Arora et al., 2016, etc.).", 
        "170": "However, the target of all these approaches is obtaining multisense word vector spaces, either by incorporating sense tagged information or other kinds of external context.", 
        "171": "The number of vectors learned is still fixed, based on the preset number of senses.", 
        "172": "In contrast, our focus is on learning a context dependent distribution over those concept representations.", 
        "173": "Other work not necessarily related to multisense vectors, but still related to our work includes Belanger and Kakade (2015)’s work which proposed a Gaussian linear dynamical system for estimating token-level word embeddings, and Vilnis and McCallum (2015)’s work which proposed mapping each word type to a density instead of a point in a space to account for uncertainty in meaning.", 
        "174": "These approaches do not make use of lexical ontologies and are not amenable for joint training with a downstream NLP task.", 
        "175": "Related to the idea of concept embeddings is Rothe and Schütze (2015) who estimated WordNet synset representations, given pre-trained typelevel word embeddings.", 
        "176": "In contrast, our work focuses on estimating token-level word embeddings as context sensitive distributions of concept em-\nbeddings.", 
        "177": "There is a large body of work that tried to improve word embeddings using external resources.", 
        "178": "Yu and Dredze (2014) extended the CBOW model (Mikolov et al., 2013) by adding an extra term in the training objective for generating words conditioned on similar words according to a lexicon.", 
        "179": "Jauhar et al.", 
        "180": "(2015) extended the skipgram model (Mikolov et al., 2013) by representing word senses as latent variables in the generation process, and used a structured prior based on the ontology.", 
        "181": "Faruqui et al.", 
        "182": "(2015) used belief propagation to update pre-trained word embeddings on a graph that encodes lexical relationships in the ontology.", 
        "183": "Similarly, Johansson and Pina (2015) improved word embeddings by representing each sense of the word in a way that reflects the topology of the semantic network they belong to, and then representing the words as convex combinations of their senses.", 
        "184": "In contrast to previous work that was aimed at improving type level word representations, we propose an approach for obtaining context-sensitive embeddings at the token level, while jointly optimizing the model parameters for the NLP task of interest.", 
        "185": "Resnik (1993) showed the applicability of semantic classes and selectional preferences to resolving syntactic ambiguity.", 
        "186": "Zapirain et al.", 
        "187": "(2013) applied models of selectional preferences auto-\nmatically learned from WordNet and distributional information, to the problem of semantic role labeling.", 
        "188": "Resnik (1993); Brill and Resnik (1994); Agirre (2008) and others have used WordNet information towards improving prepositional phrase attachment predictions.", 
        "189": "6 Conclusion  In this paper, we proposed a grounding of lexical items which acknowledges the semantic ambiguity of word types using WordNet and a method to learn a context-sensitive distribution over their representations.", 
        "190": "We also showed how to integrate the proposed representation with recurrent neural networks for disambiguating prepositional phrase attachments, showing that the proposed WordNetgrounded context-sensitive token embeddings outperforms standard type-level embeddings for predicting PP attachments.", 
        "191": "We provided a detailed qualitative and quantitative analysis of the proposed model.", 
        "192": "Implementation and code availability.", 
        "193": "The models are implemented using Keras (Chollet, 2015), and the functionality is available at https://github.com/pdasigi/ onto-lstm in the form of Keras layers to make it easier to use the proposed embedding model in other NLP problems.", 
        "194": "Future work.", 
        "195": "This approach may be extended to other NLP tasks that can benefit from using encoders that can access WordNet information.", 
        "196": "WordNet also has some drawbacks, and may not always have sufficient coverage given the task at hand.", 
        "197": "As we have shown in §4.2, our model can deal with missing WordNet information by augmenting it with distributional information.", 
        "198": "Moreover, the methods described in this paper can be extended to other kinds of structured knowledge sources like Freebase which may be more suitable for tasks like question answering.", 
        "199": "Acknowledgements  The first author is supported by a fellowship from the Allen Institute for Artificial Intelligence.", 
        "200": "We would like to thank Matt Gardner, Jayant Krishnamurthy, Julia Hockenmaier, Oren Etzioni, Hector Liu, Filip Ilievski, and anonymous reviewers for their comments."
    }, 
    "document_id": "P17-1191.pdf.json"
}
