{
    "abstract_sentences": {
        "1": "Knowing the quality of reading comprehension (RC) datasets is important for the development of natural-language understanding systems.", 
        "2": "In this study, two classes of metrics were adopted for evaluating RC datasets: prerequisite skills and readability.", 
        "3": "We applied these classes to six existing datasets, including MCTest and SQuAD, and highlighted the characteristics of the datasets according to each metric and the correlation between the two classes.", 
        "4": "Our dataset analysis suggests that the readability of RC datasets does not directly affect the question difficulty and that it is possible to create an RC dataset that is easy to read but difficult to answer."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 806–817 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1075  1 Introduction  A major goal of natural language processing (NLP) is to develop agents that can understand natural language.", 
        "2": "Such an ability can be tested with a reading comprehension (RC) task that requires the agent to read open-domain documents and answer questions about them.", 
        "3": "Constructing systems with RC competence is challenging because RC comprises multiple processes including parsing, understanding cohesion, and inference with linguistic and general knowledge.", 
        "4": "Clarifying what a system achieves is important in the development of RC systems.", 
        "5": "To achieve robust improvement, systems should be measured according to a variety of metrics beyond simple accuracy.", 
        "6": "However, a current problem is that most RC datasets are presented only with superficial categories, such as question types (e.g., what, where, and who) and answer types (e.g., numeric, location, and person).", 
        "7": "In addition, Chen et al.", 
        "8": "(2016) noted that some questions in datasets may not be suited to the testing of RC systems.", 
        "9": "In such\nsituations, it is difficult to obtain an accurate assessment of the RC system.", 
        "10": "Norvig (1989) argued that questions that are easy for humans to answer often turn out to be difficult for machines.", 
        "11": "For example, consider the two RC questions in Figure 1.", 
        "12": "The first example is from SQuAD (Rajpurkar et al., 2016), although the document is taken from a Wikipedia article and was therefore written for adults.", 
        "13": "The question is answerable simply by noticing one sentence, without needing to fully understand the content of the text.", 
        "14": "On the other hand, consider the second example from MCTest (Richardson et al., 2013), which was written for children and is easy to read.", 
        "15": "Here, answering the question involves gathering information from multiple sentences and utilizing a combination of several skills, such as understanding causal relations (Sara wanted... → they went to...), coreference resolution (Sara and Her Dad = they), and complementing ellipsis (baseball team = team).", 
        "16": "These two examples show that the readability of the text does not necessarily correlate with the difficulty of answering questions about it.", 
        "17": "806\nFurthermore, the accompanying categories of existing RC datasets cannot help with the analysis of this issue.", 
        "18": "In this study, our goal is to investigate how these two types of difficulty, namely “answering questions” and “reading text,” are correlated in RC.", 
        "19": "Corresponding to each type, we formalize two classes of evaluation metrics, prerequisite skills and readability, and analyze existing RC datasets.", 
        "20": "Our intention is to provide the basis of an evaluation methodology of RC systems to help their robust development.", 
        "21": "Our two classes of metrics are inspired by the analysis in McNamara and Magliano (2009) of human text comprehension in psychology.", 
        "22": "They considered two aspects of text comprehension, namely “strategic/skilled comprehension” and “text ease of processing.”\nOur first class defines metrics for “strategic/skilled comprehension,” namely the difficulty of comprehending the context when answering questions.", 
        "23": "We adopted the set of prerequisite skills that Sugawara et al.", 
        "24": "(2017) proposed for the finegrained analysis of RC capability.", 
        "25": "Their study also presented an important observation of the relation between the difficulty of an RC task and prerequisite skills: the more skills that are required to answer a question, the more difficult is the question.", 
        "26": "Based on this observation, in this work, we assume that the number of skills required to answer a question is a reasonable indication of the difficulty of the question.", 
        "27": "This is because each skill corresponds to one of the functions of an NLP system, which has to be capable of that functionality.", 
        "28": "Our second class defines metrics for “text ease of processing,” namely the difficulty of reading the text.", 
        "29": "We regard it as readability of the text in terms of syntactic and lexical complexity.", 
        "30": "From among readability studies in NLP, we adopt a wide range of linguistic features proposed by Vajjala and Meurers (2012), which can be used for texts with no available annotations.", 
        "31": "The contributions of this paper are as follows.", 
        "32": "1.", 
        "33": "We adopt two classes of evaluation metrics to show the qualitative features of RC datasets.", 
        "34": "Through analyses of RC datasets, we demonstrate that there is only a weak correlation between the difficulty of questions and the readability of context texts in RC datasets.", 
        "35": "2.", 
        "36": "We revise a previous classification of pre-\nrequisite skills for RC.", 
        "37": "Specifically, skills of knowledge reasoning are organized by using insights of entailment phenomena in NLP and human text comprehension in psychology.", 
        "38": "3.", 
        "39": "We annotate six existing RC datasets, compared to the two datasets considered in Sugawara and Aizawa (2016), with our organized metrics being used in the comparison.", 
        "40": "We have made the results publicly available1 and report on the characteristics of the datasets and the differences between them.", 
        "41": "We should note that, in this study, RC datasets with different task formulations were annotated with prerequisite skills under the same conditions.", 
        "42": "Annotators first saw a context, a question, and its answer.", 
        "43": "They selected the sentences required to provide the answer, and then annotated them with appropriate prerequisite skills.", 
        "44": "That is, the datasets were annotated from the point of view of whether the context entailed the hypothesis constructed from the pair of the question and answer.", 
        "45": "This means that our methodology cannot quantify the systems’ competence in searching the context for necessary sentences and answer candidates.", 
        "46": "In other words, our methodology can be only used to evaluate the competence of understanding RC questions as contextual entailments.", 
        "47": "The remainder of this paper is divided into the following sections.", 
        "48": "First, we discuss related work in Section 2.", 
        "49": "Next, we specify our two classes of metrics in Section 3.", 
        "50": "In Section 4, we annotate existing RC datasets with the prerequisite skills.", 
        "51": "Section 5 gives the results of our dataset analysis and Section 6 discusses their implications.", 
        "52": "Section 7 presents our conclusions.", 
        "53": "2 Related Work    2.1 Reading Comprehension Datasets  In this section, we present a short history of RC datasets.", 
        "54": "To our knowledge, Hirschman et al.", 
        "55": "(1999) were the first to use NLP methods for RC.", 
        "56": "Their dataset comprised reading materials for grades 3–6 with simple 5W (wh-) questions.", 
        "57": "Subsequent investigations into questions of natural language understanding focused on other formulations, such as question answering (Yang et al., 2015; Wang et al., 2007; Voorhees et al., 1999) and\n1http://www-al.nii.ac.jp/rc_dataset_ analysis\ntextual entailment (Bentivogli et al., 2010; Sammons et al., 2010; Dagan et al., 2006).", 
        "58": "One of the RC tasks of the time was QA4MRE (Sutcliffe et al., 2013).", 
        "59": "The highest accuracy achieved for this task was 59% and the size of the dataset was very limited: there were only 224 gold-standard questions, which is insufficient for machine learning methods.", 
        "60": "This means that an important issue for designing RC datasets is their scalability.", 
        "61": "Richardson et al.", 
        "62": "(2013) presented MCTest, which is an opendomain narrative dataset for gauging comprehension at a child’s level.", 
        "63": "This dataset was created by crowdsourcing and was based on a scalable methodology.", 
        "64": "Since then, additional large-scale datasets have been proposed with the development of machine learning methods in NLP.", 
        "65": "For example, the CNN/Daily Mail dataset (Hermann et al., 2015) and CBTest (Hill et al., 2016) have approximately 1.4M and 688K passages, respectively.", 
        "66": "These context texts and questions were automatically curated and generated from large corpora.", 
        "67": "However, Chen et al.", 
        "68": "(2016) indicated that approximately 25% of the questions in the CNN/Daily Mail dataset are either unsolvable or nonsensical.", 
        "69": "This dataset-quality issue highlights the demand for more stable and robust sourcing methods.", 
        "70": "Several additional RC datasets were presented in the last half of 2016, involving large documents and sensible queries that were guaranteed by crowdsourcing or other human testing.", 
        "71": "They were intended to provide large and high-quality content for machine learning models.", 
        "72": "Nonetheless, as shown in the examples of Figure 1, they were not offered with metrics that could evaluate NLP systems adequately with respect to the difficulty of questions and the surface features of texts.", 
        "73": "2.2 Reading Comprehension in Psychology  In psychology, there is a rich tradition of research on human text comprehension.", 
        "74": "The construction– integration (C–I) model (Kintsch, 1988) is one of the most basic and influential theories.", 
        "75": "This model assumes a connectional and computational architecture for text comprehension.", 
        "76": "It assumes that comprehension is the processing of information based on the following two steps.2\n1.", 
        "77": "Construction: read sentences or clauses as inputs; form and elaborate concepts and propositions corresponding to the inputs.", 
        "78": "2Note that this is a very simplified overview.", 
        "79": "2.", 
        "80": "Integration: associate the contents to understand them consistently (e.g., coreference, discourse, and coherence).", 
        "81": "During these steps, three levels of representation are constructed (van Dijk and Kintsch, 1983): the surface code (i.e., wording and syntax), the textbase (i.e., text propositions with cohesion), and the situation model (i.e., mental representation).", 
        "82": "Based on these assumptions, McNamara and Magliano (2009) proposed two aspects of text comprehension, namely “strategic/skilled comprehension” and “text ease of processing.” We adopted these assumptions as the basis of our two classes of evaluation metrics (Section 3).", 
        "83": "In an alternative approach, Kintsch (1993) proposed two dichotomies for the classification of human inferences, including the knowledge-based inference assumed in the C–I model.", 
        "84": "The first dichotomy is between inferences that are automatic and those that are controlled.", 
        "85": "However, Graesser et al.", 
        "86": "(1994) indicated that this distinction is ambiguous, because there is a continuum between the two states that depends on individuals.", 
        "87": "Therefore, this dichotomy is unsuited to empirical evaluation, which is our focus.", 
        "88": "The second dichotomy is between inferences that are retrieved and those that are generated.", 
        "89": "Retrieved means that the information used for inference is retrieved entirely from the context.", 
        "90": "In contrast, when inferences are generated, the reader uses external knowledge that goes beyond the context.", 
        "91": "A similar distinction was proposed by McNamara and Magliano (2009), namely that between bridging and elaboration.", 
        "92": "A bridging inference connects current information to other information that has been encountered previously.", 
        "93": "Elaboration connects current information to external knowledge that is not included in the context.", 
        "94": "We use these two types of inference in the classification of knowledge reasoning.", 
        "95": "3 Evaluation Metrics for Datasets  Following the depiction of text comprehension by McNamara and Magliano (2009), we adopted two classes for the evaluation of RC datasets: prerequisite skills and readability.", 
        "96": "For the prerequisite skills class (Section 3.1), we refined RC skills that were proposed by Sugawara et al.", 
        "97": "(2017) and Sugawara and Aizawa (2016).", 
        "98": "However, a problem in these studies is that their categorization of knowledge reasoning\nwas provisional and with a weak theoretical background.", 
        "99": "Therefore, in this study, we reorganized the category of knowledge reasoning in terms of textual entailment in NLP and human text comprehension in psychology.", 
        "100": "In research on textual entailment, several methodologies have been proposed for the precise analysis of entailment phenomena (Dagan et al., 2013; LoBue and Yates, 2011).", 
        "101": "In psychology research, as described in Section 2.2, McNamara and Magliano (2009) proposed a similar distinction for inferences: bridging versus elaboration.", 
        "102": "We utilized these insights in developing a comprehensive but not overly specific classification of knowledge reasoning.", 
        "103": "Our prerequisite skills class includes the textbase and situation model (van Dijk and Kintsch, 1983).", 
        "104": "In our terminology, this means understanding each fact and associating multiple facts in a text, such as the relations of events, characters, or the topic of a story.", 
        "105": "The skills also involve knowledge reasoning, which is divided into several metrics according to the distinctions of human inferences.", 
        "106": "This point is discussed by Kintsch (1993) and McNamara and Magliano (2009).", 
        "107": "It also accords with the classification of entailment phenomena by Dagan et al.", 
        "108": "(2013) and LoBue and Yates (2011).", 
        "109": "Readability metrics (Section 3.2) are quantitative measures used to assess the difficulty of reading, with respect to vocabulary and the complexity of texts.", 
        "110": "In this study, they measure the competence in understanding the first basic representation of a text, called the surface code (van Dijk and Kintsch, 1983).", 
        "111": "3.1 Prerequisite Skills  Based on the 10 RC skills in Sugawara et al.", 
        "112": "(2017), we identified 13 prerequisite skills, which are presented below.", 
        "113": "(We use ∗ and † to indicate skills that have been modified/elaborated from the original definition or have been newly introduced in this study, respectively.)", 
        "114": "1.", 
        "115": "Object tracking∗: jointly tracking or grasping of multiple objects, including sets or memberships (Clark, 1975).", 
        "116": "This skill is a version of the list/enumeration used in the original classification, renamed to emphasize its scope with respect to multiple objects.", 
        "117": "2.", 
        "118": "Mathematical reasoning∗: we merged statistical and quantitative reasoning with mathemat-\nical reasoning.", 
        "119": "This skill is a renamed version of mathematical operations.", 
        "120": "3.", 
        "121": "Coreference resolution∗: this skill has a small modification to include an anaphora (Dagan et al., 2013).", 
        "122": "It is similar to direct reference (Clark, 1975).", 
        "123": "4.", 
        "124": "Logical reasoning∗: we identified this skill as the understanding of predicate logic, e.g., conditionals, quantifiers, negation, and transitivity.", 
        "125": "Note that this skill, together with mathematical reasoning, is intended to align with the offline skills described by Graesser et al.", 
        "126": "(1994).", 
        "127": "5.", 
        "128": "Analogy∗: understanding of metaphors including metonymy and synecdoche (see LoBue and Yates (2011) for examples of synecdoche.)", 
        "129": "6.", 
        "130": "Causal relation: understanding of causality that is represented by explicit expressions such as “why,” “because,” and “the reason for” (only if they exist).", 
        "131": "7.", 
        "132": "Spatiotemporal relation: understanding of spatial and/or temporal relationships between multiple entities, events, and states.", 
        "133": "In addition, we propose the following four categories by refining the “commonsense reasoning” category proposed originally in Sugawara et al.", 
        "134": "(2017).", 
        "135": "8.", 
        "136": "Ellipsis†: recognizing implicit/omitted information (argument, predicate, quantifier, time, or place).", 
        "137": "This skill is inspired by Dagan et al.", 
        "138": "(2013) and the discussion in Sugawara et al.", 
        "139": "(2017).", 
        "140": "9.", 
        "141": "Bridging†: inference supported by grammatical and lexical knowledge (e.g., synonymy, hypernymy, thematic role, part of events, idioms, and apposition).", 
        "142": "This skill is inspired by the concept of indirect reference in the literature (Clark, 1975).", 
        "143": "Note that we exclude direct reference because it is covered by coreference resolution (pronominalization) and elaboration (epithets).", 
        "144": "10.", 
        "145": "Elaboration†: inference using known facts, general knowledge (e.g., kinship, exchange, typical event sequence, and naming), and implicit relations (e.g., noun compounds and possessives) (see Dagan et al.", 
        "146": "(2013) for details).", 
        "147": "Bridging and elaboration are distinguished by the knowledge used in inferences being grammatical/lexical or general/commonsense, respectively.", 
        "148": "11.", 
        "149": "Meta-knowledge†: using knowledge that includes a reader, writer, or text genre (e.g., narratives and expository documents) from metaviewpoints (e.g., Who are the principal characters of the story?", 
        "150": "or What is the main subject of\nthis article?).", 
        "151": "Although this skill can be regarded as part of elaboration, we defined it as an independent skill because this knowledge is specific to RC.", 
        "152": "We were motivated by the discussion in Smith et al.", 
        "153": "(2015).", 
        "154": "Whereas the above 11 skills involve multiple items, the final pair of skills involve only a single sentence.", 
        "155": "12.", 
        "156": "Schematic clause relation: understanding of complex sentences that have coordination or subordination, including relative clauses.", 
        "157": "13.", 
        "158": "Punctuation∗: understanding of punctuation marks (e.g., parenthesis, dash, quotation, colon, or semicolon).", 
        "159": "This skill is a renamed version of special sentence structure.", 
        "160": "Concerning the original definition, we regarded “scheme” in figures of speech as ambiguous and excluded it.", 
        "161": "We defined ellipsis as a independent skill, and apposition was merged into bridging.", 
        "162": "Similarly, understanding of constructions was merged into the idioms in bridging.", 
        "163": "Note that we did not construct this classification to be dependent on particular RC systems in NLP.", 
        "164": "This was because our methodology is intended to be general and applicable to many kinds of architectures.", 
        "165": "For example, we did not consider the dichotomy between automatic and controlled inferences because the usage of knowledge is not necessarily the same for all RC systems.", 
        "166": "3.2 Readability Metrics  In this study, we evaluated the readability of texts based on metrics in NLP.", 
        "167": "Several studies have examined readability in various applications, such as second-language learning (Razon and Barnden, 2015) and text simplification (Aluisio et al., 2010), and from various aspects, such as development measures in second-language acquisition (Vajjala and Meurers, 2012) and discourse relations (Pitler and Nenkova, 2008).", 
        "168": "Of these, we adopted the classification of linguistic features proposed by Vajjala and Meurers (2012).", 
        "169": "This was because they presented a comparison of a wide range of linguistic features focusing on second-language acquisition and their method can be applied to plain text.3\nWe list the readability metrics in Table 1, which were reported by Vajjala and Meurers (2012) as\n3The classification in Pitler and Nenkova (2008) is more suited to measuring text quality.", 
        "170": "However, we could not use their results because we could not use discourse annotations.", 
        "171": "the top 10 features that affect human readability.", 
        "172": "To classify these metrics, we can identify three classes: lexical features (NumChar, NumSyll, AWL, AdvVar, and ModVar), syntactic features (MLS, CoOrd, DC/C, and CN/C), and traditional features (Coleman).", 
        "173": "We applied these metrics only to sentences that needed to be read in answering questions.", 
        "174": "However, because these metrics were proposed for human readability, they do not necessarily correlate with those used in RC systems.", 
        "175": "Therefore, in any system analysis, ideally we would have to consult a variety of features.", 
        "176": "4 Annotation of Reading Comprehension Datasets  We annotated six existing RC datasets with the prerequisite skills.", 
        "177": "We explain the annotation procedure in Section 4.1 and the annotated RC datasets in Section 4.2.", 
        "178": "4.1 Annotation Procedure  We prepared annotation guidelines according to Sugawara et al.", 
        "179": "(2017).", 
        "180": "The guidelines include the definitions and examples of the skills and annotation instructions.", 
        "181": "Four annotators were asked to simulate the process of answering questions in RC datasets, using only the prerequisite skills, and to annotate questions with one or more skills required in answering.", 
        "182": "For each task in the datasets, the annotators saw simultaneously the context, question, and its answer.", 
        "183": "When a dataset contained multiple-choice questions, we showed all candidate answers and labeled the correct one with an asterisk.", 
        "184": "The an-\n4http://en.wikipedia.org/wiki/ Academic_Word_List\nnotators then selected the sentences that needed to be read to be able to answer the question and decided on the set of prerequisite skills required.", 
        "185": "The annotators were allowed to select nonsense for unsolvable or unanswerable questions (e.g., the “coreference error” and “ambiguous” questions described in Chen et al.", 
        "186": "(2016)) to distinguish them from any solvable questions that required no skills.", 
        "187": "4.2 Datasets  As summarized in Table 2, the annotation was performed on six existing RC datasets: QA4MRE (Sutcliffe et al., 2013), MCTest (Richardson et al., 2013), SQuAD (Rajpurkar et al., 2016), Who-didWhat (Onishi et al., 2016), MS MARCO (Nguyen et al., 2016), and NewsQA (Trischler et al., 2016).", 
        "188": "We selected these datasets to enable coverage of a variety of genres, query sourcing methods, and task formulations.", 
        "189": "From each dataset, we randomly selected 100 questions.", 
        "190": "This number was considered sufficient for the degree of analysis of RC datasets performed by Chen et al.", 
        "191": "(2016).", 
        "192": "The questions were sampled from the gold-standard dataset of QA4MRE and the development sets of the other RC datasets.", 
        "193": "(We explain the method of choosing questions for the annotation in Appendix A.)", 
        "194": "For a variety of reasons, there were other datasets we did not annotate in this study.", 
        "195": "CNN/Daily Mail (Hermann et al., 2015) is anonymized and contains errors, according to Chen et al.", 
        "196": "(2016), making it unsuitable for annotation.", 
        "197": "We considered CBTest (Hill et al., 2016) to be devised as language-modeling tasks rather than RC-related tasks.", 
        "198": "LAMBADA (Paperno et al.,\n2016) texts are formatted for machine reading, with all tokens in lower case, which would seem to disallow inferences based on proper nouns and render them unsuitable for human reading and annotation.", 
        "199": "5 Results of the Dataset Analysis  We now present the results of evaluating the RC datasets according to the two classes of metrics.", 
        "200": "In the annotation of prerequisite skills, the interannotator agreement was 90.1% for 62 randomly sampled questions.", 
        "201": "The evaluation was performed with respect to the following four aspects: (i) frequencies of prerequisite skills required for each RC dataset; (ii) number of prerequisite skills required per question; (iii) readability metrics for each RC dataset; and (iv) correlation between readability metrics and the number of required prerequisite skills.", 
        "202": "(i) Frequencies of prerequisite skills (see Table 3): QA4MRE had the highest scores for frequencies among the datasets.", 
        "203": "This seems to reflect\nthe fact that QA4MRE involves technical documents that contain a wide range of knowledge, multiple clauses, and punctuation.", 
        "204": "Moreover, the questions are devised by experts.", 
        "205": "MCTest achieved a high score for several skills (best for causal relation and meta-knowledge and second-best for coreference resolution and spatiotemporal relation), but a low score for punctuation.", 
        "206": "These scores seem to be because the MCTest dataset consists of narratives.", 
        "207": "Another dataset that achieved notable scores is Who-did-What.", 
        "208": "This dataset achieved the highest score for ellipsis.", 
        "209": "This is because the questions of Who-did-What are automatically generated from articles not used as context.", 
        "210": "This methodology tends to avoid textual overlap between a question and its context, thereby requiring frequently the skills of ellipsis, bridging, and elaboration.", 
        "211": "With regard to nonsense, MS MARCO and Who-did-What received relatively high scores.", 
        "212": "This appears to have been caused by the automated sourcing methods, which may generate a separation between the contents of the context and question (i.e., web segments and a search query in MS MARCO, and a context article and question article in Who-did-What).", 
        "213": "In contrast, NewsQA had no nonsense questions.", 
        "214": "Although this result was affected by our filtering (described in Appendix A), it is important to note that the NewsQA dataset includes annotations of meta-information whether or not a question makes sense (is question bad).", 
        "215": "(ii) Number of required prerequisite skills (see Table 4): QA4MRE had the highest score.", 
        "216": "On average, each question required 3.25 skills.", 
        "217": "There were few questions in QA4MRE that re-\nquired zero or one skill, whereas such questions were contained more frequently in other datasets.", 
        "218": "Table 4 also indicates that more than 90% of the MS MARCO questions required fewer than three skills according to the annotation.", 
        "219": "(iii) Readability metrics for each dataset (see Table 5): SQuAD and QA4MRE achieved the highest scores for most metrics.", 
        "220": "This reflects the fact that Wikipedia articles and technical documents usually require a high-grade level of understanding.", 
        "221": "In contrast, MCTest had the lowest scores, with its dataset consisting of narratives for children.", 
        "222": "(iv) Correlation between numbers of required prerequisite skills and readability metrics (see Figures 2 and 3, and Table 6): our main interest was in the correlation between prerequisite skills and readability.", 
        "223": "To investigate this, we examined the relation between the number of required prerequisite skills and readability metrics.", 
        "224": "We used the Flesch–Kincaid grade level (Kincaid et al., 1975) as an intuitive reference for readability.", 
        "225": "This value represents the typical number of years of education required to understand texts based on counts of syllables, words, and sentences.", 
        "226": "Figures 2 and 3 show the relation between two values for each dataset and for each question, respectively.", 
        "227": "Figure 2 shows the trends of the datasets.", 
        "228": "QA4MRE was relatively difficult both to read and to answer, whereas SQuAD was difficult to read but easy to answer.", 
        "229": "For further investigation, we selected three datasets (QA4MRE, MCTest, and SQuAD) and plotted all of their questions in Figure 3.", 
        "230": "Three separate domains can be seen.", 
        "231": "Table 6 presents Pearson’s correlation coefficients between the number of required prerequisite skills and each readability metric for all questions in the RC datasets.", 
        "232": "Although there are weak correlations, from 0.025 to 0.416, these results demonstrate that there is not necessarily a strong correlation between the two values.", 
        "233": "This leads to the following two insights.", 
        "234": "First, the readability of RC datasets does not directly affect the difficulty of their questions.", 
        "235": "That is, RC datasets that are difficult to read are not necessarily difficult to answer.", 
        "236": "Second, it is possible to create difficult questions from the context that are easy to read.", 
        "237": "MCTest is a good example.", 
        "238": "The context texts in the MCTest dataset are easy to read, but the difficulty of its questions compares to that for the other datasets.", 
        "239": "To summarize our results in terms of each RC dataset, we can make the following observations.", 
        "240": "- QA4MRE is difficult both to read and to answer among the datasets analyzed.", 
        "241": "This would seem to follow its questions being devised by experts.", 
        "242": "- MCTest is a good example of an RC dataset that is easy to read but difficult to answer.", 
        "243": "We presume that this is because the corpus genre (i.e., narrative) reflects the trend in required skills for the questions.", 
        "244": "- SQuAD is difficult to read, along with QA4MRE, but relatively easy to answer compared with the other datasets.", 
        "245": "- Who-did-What performs well in terms of its query-sourcing method.", 
        "246": "Although its questions are created automatically, they are sophisticated in terms of knowledge reasoning.", 
        "247": "However, the automated sourcing method must be improved to exclude nonsense questions.", 
        "248": "- MS MARCO is a relatively easy dataset in terms of prerequisite skills.", 
        "249": "However, one problem is that the dataset contained nonsense questions.", 
        "250": "- NewsQA is advantageous in that it provides meta-information on the reliability of the questions.", 
        "251": "Such information enabled us to avoid using nonsense questions, as for the training of machine learning models.", 
        "252": "6 Discussion  In this section, we discuss several issues regarding the construction of RC datasets and the development of RC systems using our methodology.", 
        "253": "How to utilize the two classes of metrics for system development: one possible scenario for developing an RC system is that it is first built to solve an easy-to-read and easy-to-answer dataset.", 
        "254": "The next step would be to improve the system so that it can solve an easy-to-read but difficult-toanswer dataset (or its converse).", 
        "255": "Finally, only after it can solve such datasets should the system be applied to difficult-to-read and difficult-to-answer datasets.", 
        "256": "The metrics of this study may be useful in preparing appropriate datasets for each step by measuring their properties.", 
        "257": "The datasets can then be ordered according to the grades of the metrics and applied to each step of the development, as in curriculum learning (Bengio et al., 2009) and transfer learning (Pan and Yang, 2010).", 
        "258": "Corpus genre: attention should be paid to the genre of the corpus used to construct a dataset.", 
        "259": "Expository documents such as news articles tend to require factorial understanding.", 
        "260": "Most existing RC datasets use such texts because of their availability.", 
        "261": "On the other hand, narrative texts may have a\ncloser correspondence to our everyday experience, involving the emotions and intentions of characters (Graesser et al., 1994).", 
        "262": "To build agents that work in the real world, RC datasets may have to be constructed from narratives.", 
        "263": "Question type: in contrast to factorial understanding, comprehensive understanding of natural language texts needs a better grasp of global coherence (e.g., the main point or moral of the text, the goal of a story, or the intention of characters) from the broad context (Graesser et al., 1994).", 
        "264": "Most questions in current use require only local coherence (e.g., referential relations and thematic roles) within a narrow context.", 
        "265": "An example of a question based on global coherence would be to give a summary of the text, as used in Hermann et al.", 
        "266": "(2015).", 
        "267": "It could be generated automatically by techniques of abstractive text summarization (Rush et al., 2015; Ganesan et al., 2010).", 
        "268": "Annotation issues: we found questions for which there were disagreements regarding nonsense decisions.", 
        "269": "For example, some questions can be solved by external knowledge without even seeing their context.", 
        "270": "Therefore, we should clarify what constitutes a “solvable” or “reasonable” question for RC.", 
        "271": "In addition, annotators reported that the prerequisite skills did not easily treat questions whose answer was “none of the above” in QA4MRE.", 
        "272": "We considered these “no answer” questions difficult, in that systems have to decide not to select any of the candidate answers, and our methodology failed to specify them.", 
        "273": "Competence in selecting necessary sentences: as mentioned in Section 1, our methodology cannot evaluate competence in selecting sentences that need to be read to answer questions.", 
        "274": "In a brief analysis, we further investigated sentences in the context of the datasets that were selected in the annotation.", 
        "275": "Analyses were performed in two ways.", 
        "276": "For each question, we counted the number of required sentences and their distance apart.4 The first row of Table 7 gives the average number of required sentences per question for each RC dataset.", 
        "277": "Although the scores are reasonably close, MCTest required multiple sentences to be read most frequently.", 
        "278": "The second row gives the average dis-\n4The distance of sentences was calculated as follows.", 
        "279": "If a question required only one sentence to be read, its distance was zero.", 
        "280": "If a question required two adjacent sentences to be read, its distance was one.", 
        "281": "If a question required more than two sentences to be read, its distance was the sum of the distances of any two sentences.", 
        "282": "tance apart of the required sentences.", 
        "283": "QA4MRE required the longest distance because readers had to look for clues in the long context texts.", 
        "284": "In contrast, SQuAD and MS MARCO had lower scores.", 
        "285": "Most of their questions seemed to be answered by reading only a single sentence.", 
        "286": "Of course, the scores for distances will depend on the length of the context texts.", 
        "287": "Metrics of RC for machines: our underlying assumption in this study is that, in the development of interactive agents such as dialogue systems, it is important to make the systems behave in a human-like way.", 
        "288": "This has also become a distinguishing feature of recent RC task design, and one that has never been explicitly considered in conventional NLP tasks.", 
        "289": "To date, the difference between human and machine RC has not attracted much research attention.", 
        "290": "We believe that our human-based evaluation metrics and analysis will help researchers to develop a method for the step-by-step construction of better RC datasets and improved RC systems.", 
        "291": "7 Conclusion  In this study, we adopted evaluation metrics that comprise two classes, namely refined prerequisite skills and readability, for analyzing the quality of RC datasets.", 
        "292": "We applied these classes to six existing datasets and highlighted their characteristics according to each metric.", 
        "293": "Our dataset analysis suggests that the readability of RC datasets does not directly affect the difficulty of the questions and that it is possible to create an RC dataset that is easy to read but difficult to answer.", 
        "294": "In future work, we plan to use the analysis from the present study in constructing a system that can be applied to multiple datasets.", 
        "295": "Acknowledgments  We would like to thank anonymous reviewers for their insightful comments.", 
        "296": "This work was supported by JSPS KAKENHI Grant Numbers 15H02754 and 16K16120.", 
        "297": "A Sampling Methods for Questions  In this appendix, we explain the method of choosing questions for annotation.", 
        "298": "QA4MRE (Sutcliffe et al., 2013): the goldstandard dataset comprised four different topics and four documents for each topic.", 
        "299": "We randomly selected 100 main and auxiliary questions so that at least one question for each document was included.", 
        "300": "MCTest (Richardson et al., 2013): this dataset comprised two sets: MC160 and MC500.", 
        "301": "Their development sets had 80 tasks in total, with each containing context texts and four questions.", 
        "302": "We randomly chose 25 tasks (100 questions) from the development sets.", 
        "303": "SQuAD (Rajpurkar et al., 2016): this dataset included Wikipedia articles involving various topics, with the articles being divided into paragraphs.", 
        "304": "We randomly chose 100 paragraphs from 15 articles and used only one question from each paragraph for the annotation.", 
        "305": "Who-did-What (WDW) (Onishi et al., 2016): this dataset was constructed from the English Gigaword newswire corpus (v5).", 
        "306": "Its questions were automatically created using a different article from that used for context.", 
        "307": "In addition, questions that could be solved by a simple baseline method were excluded from the dataset.", 
        "308": "MS MARCO (MARCO) (Nguyen et al., 2016): each task in this dataset comprised several segments, one question, and its answer.", 
        "309": "We randomly chose 100 tasks (100 questions) and only used segments whose attribute was is selected = 1 as context.", 
        "310": "NewsQA (Trischler et al., 2016): we randomly chose questions that satisfied the following conditions: is answer absent = 0, is question bad = 0, and validated answers do not include bad question or none."
    }, 
    "document_id": "P17-1075.pdf.json"
}
