{
    "abstract_sentences": {
        "1": "We study automatic question generation for sentences from text passages in reading comprehension.", 
        "2": "We introduce an attention-based sequence learning model for the task and investigate the effect of encoding sentencevs.", 
        "3": "paragraph-level information.", 
        "4": "In contrast to all previous work, our model does not rely on hand-crafted rules or a sophisticated NLP pipeline; it is instead trainable end-to-end via sequenceto-sequence learning.", 
        "5": "Automatic evaluation results show that our system significantly outperforms the state-of-the-art rule-based system.", 
        "6": "In human evaluations, questions generated by our system are also rated as being more natural (i.e., grammaticality, fluency) and as more difficult to answer (in terms of syntactic and lexical divergence from the original text and reasoning needed to answer)."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1342–1352 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1123  1 Introduction  Question generation (QG) aims to create natural questions from a given a sentence or paragraph.", 
        "2": "One key application of question generation is in the area of education — to generate questions for reading comprehension materials (Heilman and Smith, 2010).", 
        "3": "Figure 1, for example, shows three manually generated questions that test a user’s understanding of the associated text passage.", 
        "4": "Question generation systems can also be deployed as chatbot components (e.g., asking questions to start a conversation or to request feedback (Mostafazadeh et al., 2016)) or, arguably, as a clinical tool for evaluating or improving mental health (Weizenbaum, 1966; Colby et al., 1971).", 
        "5": "In addition to the above applications, question generation systems can aid in the development of\nannotated data sets for natural language processing (NLP) research in reading comprehension and question answering.", 
        "6": "Indeed the creation of such datasets, e.g., SQuAD (Rajpurkar et al., 2016) and MS MARCO (Nguyen et al., 2016), has spurred research in these areas.", 
        "7": "For the most part, question generation has been tackled in the past via rule-based approaches (e.g., Mitkov and Ha (2003); Rus et al.", 
        "8": "(2010).", 
        "9": "The success of these approaches hinges critically on the existence of well-designed rules for declarative-to-interrogative sentence transformation, typically based on deep linguistic knowledge.", 
        "10": "To improve over a purely rule-based system, Heilman and Smith (2010) introduced an overgenerate-and-rank approach that generates multiple questions from an input sentence using a rule-based approach and then ranks them using a supervised learning-based ranker.", 
        "11": "Although the ranking algorithm helps to produce more ac-\n1342\nceptable questions, it relies heavily on a manually crafted feature set, and the questions generated often overlap word for word with the tokens in the input sentence, making them very easy to answer.", 
        "12": "Vanderwende (2008) point out that learning to ask good questions is an important task in NLP research in its own right, and should consist of more than the syntactic transformation of a declarative sentence.", 
        "13": "In particular, a natural sounding question often compresses the sentence on which it is based (e.g., question 3 in Figure 1), uses synonyms for terms in the passage (e.g., “form” for “produce” in question 2 and “get” for “produce” in question 3), or refers to entities from preceding sentences or clauses (e.g., the use of “photosynthesis” in question 2).", 
        "14": "Othertimes, world knowledge is employed to produce a good question (e.g., identifying “photosynthesis” as a “life process” in question 1).", 
        "15": "In short, constructing natural questions of reasonable difficulty would seem to require an abstractive approach that can produce fluent phrasings that do not exactly match the text from which they were drawn.", 
        "16": "As a result, and in contrast to all previous work, we propose here to frame the task of question generation as a sequence-to-sequence learning problem that directly maps a sentence from a text passage to a question.", 
        "17": "Importantly, our approach is fully data-driven in that it requires no manually generated rules.", 
        "18": "More specifically, inspired by the recent success in neural machine translation (Sutskever et al., 2014; Bahdanau et al., 2015), summarization (Rush et al., 2015; Iyer et al., 2016), and image caption generation (Xu et al., 2015), we tackle question generation using a conditional neural language model with a global attention mechanism (Luong et al., 2015a).", 
        "19": "We investigate several variations of this model, including one that takes into account paragraph- rather than sentence-level information from the reading passage as well as other variations that determine the importance of pre-trained vs. learned word embeddings.", 
        "20": "In evaluations on the SQuAD dataset (Rajpurkar et al., 2016) using three automatic evaluation metrics, we find that our system significantly outperforms a collection of strong baselines, including an information retrieval-based system (Robertson and Walker, 1994), a statistical machine translation approach (Koehn et al., 2007), and the overgenerate-and-rank approach of Heil-\nman and Smith (2010).", 
        "21": "Human evaluations also rated our generated questions as more grammatical, fluent, and challenging (in terms of syntactic divergence from the original reading passage and reasoning needed to answer) than the state-of-theart Heilman and Smith (2010) system.", 
        "22": "In the sections below we discuss related work (Section 2), specify the task definition (Section 3) and describe our neural sequence learning based models (Section 4).", 
        "23": "We explain the experimental setup in Section 5.", 
        "24": "Lastly, we present the evaluation results as well as a detailed analysis.", 
        "25": "2 Related Work  Reading Comprehension is a challenging task for machines, requiring both understanding of natural language and knowledge of the world (Rajpurkar et al., 2016).", 
        "26": "Recently many new datasets have been released and in most of these datasets, the questions are generated in a synthetic way.", 
        "27": "For example, bAbI (Weston et al., 2016) is a fully synthetic dataset featuring 20 different tasks.", 
        "28": "Hermann et al.", 
        "29": "(2015) released a corpus of cloze style questions by replacing entities with placeholders in abstractive summaries of CNN/Daily Mail news articles.", 
        "30": "Chen et al.", 
        "31": "(2016) claim that the CNN/Daily Mail dataset is easier than previously thought, and their system almost reaches the ceiling performance.", 
        "32": "Richardson et al.", 
        "33": "(2013) curated MCTest, in which crowdworker questions are paired with four answer choices.", 
        "34": "Although MCTest contains challenging natural questions, it is too small for training data-demanding question answering models.", 
        "35": "Recently, Rajpurkar et al.", 
        "36": "(2016) released the Stanford Question Answering Dataset1 (SQuAD), which overcomes the aforementioned small size and (semi-)synthetic issues.", 
        "37": "The questions are posed by crowd workers and are of relatively high quality.", 
        "38": "We use SQuAD in our work, and similarly, we focus on the generation of natural questions for reading comprehension materials, albeit via automatic means.", 
        "39": "Question Generation has attracted the attention of the natural language generation (NLG) community in recent years, since the work of Rus et al.", 
        "40": "(2010).", 
        "41": "Most work tackles the task with a rule-based approach.", 
        "42": "Generally, they first transform the input sentence into its syntactic representation, which\n1https://stanford-qa.com\nthey then use to generate an interrogative sentence.", 
        "43": "A lot of research has focused on first manually constructing question templates, and then applying them to generate questions (Mostow and Chen, 2009; Lindberg et al., 2013; Mazidi and Nielsen, 2014).", 
        "44": "Labutov et al.", 
        "45": "(2015) use crowdsourcing to collect a set of templates and then rank the relevant templates for the text of another domain.", 
        "46": "Generally, the rule-based approaches make use of the syntactic roles of words, but not their semantic roles.", 
        "47": "Heilman and Smith (2010) introduce an overgenerate-and-rank approach: their system first overgenerates questions and then ranks them.", 
        "48": "Although they incorporate learning to rank, their system’s performance still depends critically on the manually constructed generating rules.", 
        "49": "Mostafazadeh et al.", 
        "50": "(2016) introduce visual question generation task, to explore the deep connection between language and vision.", 
        "51": "Serban et al.", 
        "52": "(2016) propose generating simple factoid questions from logic triple (subject, relation, object).", 
        "53": "Their task tackles mapping from structured representation to natural language text, and their generated questions are consistent in terms of format and diverge much less than ours.", 
        "54": "To our knowledge, none of the previous works has framed QG for reading comprehension in an end-to-end fashion, and nor have them used deep sequence-to-sequence learning approach to generate questions.", 
        "55": "3 Task Definition  In this section, we define the question generation task.", 
        "56": "Given an input sentence x, our goal is to generate a natural question y related to information in the sentence, y can be a sequence of an arbitrary length: [y1, ..., y|y|].", 
        "57": "Suppose the length of the input sentence is M , x could then be represented as a sequence of tokens [x1, ..., xM ].", 
        "58": "The QG task is defined as finding y, such that:\ny = argmax y\nP (y|x) (1)\nwhere P (y|x) is the conditional log-likelihood of the predicted question sequence y, given the input x.", 
        "59": "In section 4.1, we will elaborate on the global attention mechanism for modeling P (y|x).", 
        "60": "4 Model  Our model is partially inspired by the way in which a human would solve the task.", 
        "61": "To ask a natural question, people usually pay attention to certain parts of the input sentence, as well as associating context information from the paragraph.", 
        "62": "We model the conditional probability using RNN encoder-decoder architecture (Bahdanau et al., 2015; Cho et al., 2014), and adopt the global attention mechanism (Luong et al., 2015a) to make the model focus on certain elements of the input when generating each word during decoding.", 
        "63": "Here, we investigate two variations of our models: one that only encodes the sentence and another that encodes both sentence and paragraphlevel information.", 
        "64": "4.1 Decoder  Similar to Sutskever et al.", 
        "65": "(2014) and Chopra et al.", 
        "66": "(2016), we factorize the the conditional in equation 1 into a product of word-level predictions:\nP (y|x) = |y|∏\nt=1\nP (yt|x, y<t)\nwhere probability of each yt is predicted based on all the words that are generated previously (i.e., y<t), and input sentence x.", 
        "67": "More specifically,\nP (yt|x, y<t) = softmax (Wstanh (Wt[ht; ct])) (2) with ht being the recurrent neural networks state variable at time step t, and ct being the attentionbased encoding of x at decoding time step t (Section 4.2).", 
        "68": "Ws and Wt are parameters to be learned.", 
        "69": "ht = LSTM1 (yt−1,ht−1) (3)\nhere, LSTM is the Long Short-Term Memory (LSTM) network (Hochreiter and Schmidhuber, 1997).", 
        "70": "It generates the new state ht, given the representation of previously generated word yt−1 (obtained from a word look-up table), and the previous state ht−1.", 
        "71": "The initialization of the decoder’s hidden state differentiates our basic model and the model that incorporates paragraph-level information.", 
        "72": "For the basic model, it is initialized by the sentence’s representation s obtained from the sentence encoder (Section 4.2).", 
        "73": "For our paragraphlevel model, the concatenation of the sentence\nencoder’s output s and the paragraph encoder’s output s′ is used as the initialization of decoder hidden state.", 
        "74": "To be more specific, the architecture of our paragraph-level model is like a “Y”shaped network which encodes both sentenceand paragraph-level information via two RNN branches and uses the concatenated representation for decoding the questions.", 
        "75": "4.2 Encoder  The attention-based sentence encoder is used in both of our models, while the paragraph encoder is only used in the model that incorporates paragraph-level information.", 
        "76": "Attention-based sentence encoder: We use a bidirectional LSTM to encode the sentence,\n−→ bt = −−−−→ LSTM2 ( xt, −−→ bt−1 ) ←− bt = ←−−−− LSTM2 ( xt, ←−− bt+1 )\nwhere −→ bt is the hidden state at time step t for the\nforward pass LSTM, ←− bt for the backward pass.", 
        "77": "To get attention-based encoding of x at decoding time step t, namely, ct, we first get the context dependent token representation by bt = [ −→ bt; ←− bt], then we take the weighted average over bt (t = 1, ..., |x|),\nct = ∑\ni=1,..,|x| ai,tbi (4)\nThe attention weight are calculated by the bilinear scoring function and softmax normalization,\nai,t = exp\n( hTt Wbbi ) ∑\nj exp ( hTt Wbbj ) (5)\nTo get the sentence encoder’s output for initialization of decoder hidden state, we concatenate last hidden state of the forward and backward pass, namely, s = [ −−→ b|x|; ←− b1].", 
        "78": "Paragraph encoder: Given sentence x, we want to encode the paragraph containing x.", 
        "79": "Since in practice the paragraph is very long, we set a length thresholdL, and truncate the paragraph at theLth token.", 
        "80": "We call the truncated paragraph “paragraph” henceforth.", 
        "81": "Denoting the paragraph as z, we use another bidirectional LSTM to encode z,\n−→ dt = −−−−→ LSTM3 ( zt, −−→ dt−1 ) ←− dt = ←−−−− LSTM3 ( zt, ←−− dt+1 )\nWith the last hidden state of the forward and backward pass, we use the concatenation [ −→ d|z|; ←− d1] as the paragraph encoder’s output s′.", 
        "82": "4.3 Training and Inference  Giving a training corpus of sentence-question pairs: S = {( x(i),y(i)\n)}S i=1\n, our models’ training objective is to minimize the negative loglikelihood of the training data with respect to all the parameters, as denoted by θ,\nL = − S∑\ni=1\nlogP ( y(i)|x(i); θ )\n= − S∑\ni=1\n|y(i)|∑\nj=1\nlogP ( y (i) j |x(i), y (i) <j ; θ )\nOnce the model is trained, we do inference using beam search.", 
        "83": "The beam search is parametrized by the possible paths number k.\nAs there could be many rare words in the input sentence that are not in the target side dictionary, during decoding many UNK tokens will be output.", 
        "84": "Thus, post-processing with the replacement of UNK is necessary.", 
        "85": "Unlike Luong et al.", 
        "86": "(2015b), we use a simpler replacing strategy for our task.", 
        "87": "For the decoded UNK token at time step t, we replace it with the token in the input sentence with the highest attention score, the index of which is argmaxi ai,t.", 
        "88": "5 Experimental Setup  We experiment with our neural question generation model on the processed SQuAD dataset.", 
        "89": "In this section, we firstly describe the corpus of the task.", 
        "90": "We then give implementation details of our neural generation model, the baselines to compare, and their experimental settings.", 
        "91": "Lastly, we introduce the evaluation methods by automatic metrics and human raters.", 
        "92": "5.1 Dataset  With the SQuAD dataset (Rajpurkar et al., 2016), we extract sentences and pair them with the ques-\ntions.", 
        "93": "We train our models with the sentencequestion pairs.", 
        "94": "The dataset contains 536 articles with over 100k questions posed about the articles.", 
        "95": "The authors employ Amazon Mechanical Turks crowd-workers to create questions based on the Wikipedia articles.", 
        "96": "Workers are encouraged to use their own words without any copying phrases from the paragraph.", 
        "97": "Later, other crowd-workers are employed to provide answers to the questions.", 
        "98": "The answers are spans of tokens in the passage.", 
        "99": "Since there is a hidden part of the original SQuAD that we do not have access to, we treat the accessible parts (∼90%) as the entire dataset henceforth.", 
        "100": "We first run Stanford CoreNLP (Manning et al., 2014) for pre-processing: tokenization and sentence splitting.", 
        "101": "We then lower-case the entire dataset.", 
        "102": "With the offset of the answer to each question, we locate the sentence containing the answer and use it as the input sentence.", 
        "103": "In some cases (< 0.17% in training set), the answer spans two or more sentences, and we then use the concatenation of the sentences as the input “sentence”.", 
        "104": "Figure 2 shows the distribution of the token overlap percentage of the sentence-question pairs.", 
        "105": "Although most of the pairs have over 50% overlap rate, about 6.67% of the pairs have no nonstop-words in common, and this is mostly because of the answer offset error introduced during annotation.", 
        "106": "Therefore, we prune the training set based on the constraint: the sentence-question pair must have at least one non-stop-word in common.", 
        "107": "Lastly we add <SOS> to the beginning of the sen-\ntences, and <EOS> to the end of them.", 
        "108": "We randomly divide the dataset at the articlelevel into a training set (80%), a development set (10%), and a test set (10%).", 
        "109": "We report results on the 10% test set.", 
        "110": "Table 1 provides some statistics on the processed dataset: there are around 70k training samples, the sentences are around 30 tokens, and the questions are around 10 tokens on average.", 
        "111": "For each sentence, there might be multiple corresponding questions, and, on average, there are 1.4 questions for each sentence.", 
        "112": "5.2 Implementation Details  We implement our models 2 in Torch7 3 on top of the newly released OpenNMT system (Klein et al., 2017).", 
        "113": "For the source side vocabulary V , we only keep the 45k most frequent tokens (including <SOS>, <EOS> and placeholders).", 
        "114": "For the target side vocabulary U , similarly, we keep the 28k most frequent tokens.", 
        "115": "All other tokens outside the vocabulary list are replaced by the UNK symbol.", 
        "116": "We choose word embedding of 300 dimensions and use the glove.840B.300d pre-trained embeddings (Pennington et al., 2014) for initialization.", 
        "117": "We fix the word representations during training.", 
        "118": "We set the LSTM hidden unit size to 600 and set the number of layers of LSTMs to 2 in both the encoder and the decoder.", 
        "119": "Optimization is performed using stochastic gradient descent (SGD), with an initial learning rate of 1.0.", 
        "120": "We start halving the learning rate at epoch 8.", 
        "121": "The mini-batch size for the update is set at 64.", 
        "122": "Dropout with probability\n2The code is available at https://github.com/ xinyadu/nqg.", 
        "123": "3http://torch.ch/\n0.3 is applied between vertical LSTM stacks.", 
        "124": "We clip the gradient when the its norm exceeds 5.", 
        "125": "All our models are trained on a single GPU.", 
        "126": "We run the training for up to 15 epochs, which takes approximately 2 hours.", 
        "127": "We select the model that achieves the lowest perplexity on the dev set.", 
        "128": "During decoding, we do beam search with a beam size of 3.", 
        "129": "Decoding stops when every beam in the stack generates the <EOS> token.", 
        "130": "All hyperparameters of our model are tuned using the development set.", 
        "131": "The results are reported on the test set.", 
        "132": "5.3 Baselines  To prove the effectiveness of our system, we compare it to several competitive systems.", 
        "133": "Next, we briefly introduce their approaches and the experimental setting to run them for our problem.", 
        "134": "Their results are shown in Table 2.", 
        "135": "IR stands for our information retrieval baselines.", 
        "136": "Similar to Rush et al.", 
        "137": "(2015), we implement the IR baselines to control memorizing questions from the training set.", 
        "138": "We use two metrics to calculate the distance between a question and the input sentence, i.e., BM-25 (Robertson and Walker, 1994) and edit distance (Levenshtein, 1966).", 
        "139": "According to the metric, the system retrieves the training set to find the question with the highest score.", 
        "140": "MOSES+ (Koehn et al., 2007) is a widely used phrase-based statistical machine translation system.", 
        "141": "Here, we treat sentences as source language text, we treat questions as target language text, and we perform the translation from sentences to ques-\ntions.", 
        "142": "We train a tri-gram language model on target side texts with KenLM (Heafield et al., 2013), and tune the system with MERT on dev set.", 
        "143": "Performance results are reported on the test set.", 
        "144": "DirectIn is an intuitive yet meaningful baseline in which the longest sub-sentence of the sentence is directly taken as the predicted question.", 
        "145": "4 To split the sentence into sub-sentences, we use a set of splitters, i.e., {“?”, “!”, “,”, “.”, “;”}.", 
        "146": "H&S is the rule-based overgenerate-and-rank system that was mentioned in Section 2.", 
        "147": "When running the system, we set the parameter just-wh true (to restrict the output of the system to being only wh-questions) and set max-length equal to the longest sentence in the training set.", 
        "148": "We also set downweight-pro true, to down weight questions with unresolved pronouns so that they appear towards the end of the ranked list.", 
        "149": "For comparison with our systems, we take the top question in the ranked list.", 
        "150": "Seq2seq (Sutskever et al., 2014) is a basic encoder-decoder sequence learning system for machine translation.", 
        "151": "We implement their model in Tensorflow.", 
        "152": "The input sequence is reversed before training or translating.", 
        "153": "Hyperparameters are tuned with dev set.", 
        "154": "We select the model with the lowest perplexity on the dev set.", 
        "155": "4We also tried using the entire input sentence as the prediction output, but the performance is worse than taking subsentence as the prediction, across all the automatic metrics except for METEOR.", 
        "156": "5.4 Automatic Evaluation  We use the evaluation package released by Chen et al.", 
        "157": "(2015), which was originally used to score image captions.", 
        "158": "The package includes BLEU 1, BLEU 2, BLEU 3, BLEU 4 (Papineni et al., 2002), METEOR (Denkowski and Lavie, 2014) and ROUGEL (Lin, 2004) evaluation scripts.", 
        "159": "BLEU measures the average n-gram precision on a set of reference sentences, with a penalty for overly short sentences.", 
        "160": "BLEU-n is BLEU score that uses up to n-grams for counting co-occurrences.", 
        "161": "METEOR is a recall-oriented metric, which calculates the similarity between generations and references by considering synonyms, stemming and paraphrases.", 
        "162": "ROUGE is commonly employed to evaluate n-grams recall of the summaries with goldstandard sentences as references.", 
        "163": "ROUGEL (measured based on longest common subsequence) results are reported.", 
        "164": "5.5 Human Evaluation  We also perform human evaluation studies to measure the quality of questions generated by our system and the H&S system.", 
        "165": "We consider two modalities: naturalness, which indicates the grammaticality and fluency; and difficulty, which measures the sentence-question syntactic divergence and the reasoning needed to answer the question.", 
        "166": "We randomly sampled 100 sentence-question pairs.", 
        "167": "We ask four professional English speakers to rate the pairs in terms of the modalities above on a 1–5 scale (5 for the best).", 
        "168": "We then ask the human raters to give a ranking of the questions according to the overall quality, with ties allowed.", 
        "169": "6 Results and Analysis  Table 2 shows automatic metric evaluation results for our models and baselines.", 
        "170": "Our model which only encodes sentence-level information achieves\nthe best performance across all metrics.", 
        "171": "We note that IR performs poorly, indicating that memorizing the training set is not enough for the task.", 
        "172": "The baseline DirectIn performs pretty well on BLEU and METEOR, which is reasonable given the overlap statistics between the sentences and the questions (Figure 2).", 
        "173": "H&S system’s performance is on a par with DirectIn’s, as it basically performs syntactic change without paraphrasing, and the overlap rate is also high.", 
        "174": "Looking at the performance of our three models, it’s clear that adding the pre-trained embeddings generally helps.", 
        "175": "While encoding the paragraph causes the performance to drop a little, this makes sense because, apart from useful information, the paragraph also contains much noise.", 
        "176": "Table 3 shows the results of the human evaluation.", 
        "177": "We see that our system outperforms H&S in all modalities.", 
        "178": "Our system is ranked best in 38.4% of the evaluations, with an average ranking of 1.94.", 
        "179": "An inter-rater agreement of Krippendorff’s Alpha of 0.236 is achieved for the overall ranking.", 
        "180": "The results imply that our model can generate questions of better quality than the H&S system.", 
        "181": "For our qualitative analysis, we examine the sample outputs and the visualization of the alignment between the input and the output.", 
        "182": "In Figure 3, we present sample questions generated by H&S and our best model.", 
        "183": "We see a large gap between our results and H&S’s.", 
        "184": "For example, in the first sample, in which the focus should be put on “the largest.” Our model successfully captures this information, while H&S only performs some syntactic transformation over the input without paraphrasing.", 
        "185": "However, outputs from our system are not always “perfect”, for example, in pair 6, our system generates a question about the reason why birds still grow, but the most related question would be why many species still grow.", 
        "186": "But from\na different perspective, our question is more challenging (readers need to understand that birds are one kind of species), which supports our system’s performance listed in human evaluations (See Table 3).", 
        "187": "It would be interesting to further investigate how to interpret why certain irrelavant words are generated in the question.", 
        "188": "Figure 4 shows the attention weights (αi,t) for the input sentence when generating each token in the question.", 
        "189": "We see that the key words in the output (“introduced”, “teletext”, etc.)", 
        "190": "aligns well with those in the input sentence.", 
        "191": "Finally, we do a dataset analysis and finegrained system performance analysis.", 
        "192": "We randomly sampled 346 sentence-question pairs from the dev set and label each pair with a category.", 
        "193": "5 The four categories are determined by how much information is needed to ask the question.", 
        "194": "To be specific, “w/ sentence” means it only requires\n5The IDs of the questions examined will be made available at https://github.com/xinyadu/nqg/ blob/master/examined-question-ids.txt.", 
        "195": "the sentence to ask the question; “w/ paragraph” means it takes other information in the paragraph to ask the question; “w/ article” is similar to “w/ paragraph”; and “not askable” means that world knowledge is needed to ask the question or there is mismatch of sentence and question caused by annotation error.", 
        "196": "Table 4 shows the per-category performance of the systems.", 
        "197": "Our model which encodes paragraph information achieves the best performance on the questions of “w/ paragraph” category.", 
        "198": "This verifies the effectiveness of our paragraph-level model on the questions concerning information outside the sentence.", 
        "199": "7 Conclusion and Future Work  We have presented a fully data-driven neural networks approach to automatic question generation for reading comprehension.", 
        "200": "We use an attentionbased neural networks approach for the task and investigate the effect of encoding sentence- vs. paragraph-level information.", 
        "201": "Our best model achieves state-of-the-art performance in both automatic evaluations and human evaluations.", 
        "202": "Here we point out several interesting future research directions.", 
        "203": "Currently, our paragraph-level model does not achieve best performance across all categories of questions.", 
        "204": "We would like to explore how to better use the paragraph-level information to improve the performance of QG system regarding questions of all categories.", 
        "205": "Besides this, it would also be interesting to consider to incorporate mechanisms for other language generation tasks (e.g., copy mechanism for dialogue generation) in our model to further improve the quality of generated questions.", 
        "206": "Acknowledgments  We thank the anonymous ACL reviewers, Kai Sun and Yao Cheng for their helpful suggestions.", 
        "207": "We thank Victoria Litvinova for her careful proofreading.", 
        "208": "We also thank Xanda Schofield, Wil Thomason, Hubert Lin and Junxian He for doing the human evaluations."
    }, 
    "document_id": "P17-1123.pdf.json"
}
