{
    "abstract_sentences": {
        "1": "We present a novel attention-based recurrent neural network for joint extraction of entity mentions and relations.", 
        "2": "We show that attention along with long short term memory (LSTM) network can extract semantic relations between entity mentions without having access to dependency trees.", 
        "3": "Experiments on Automatic Content Extraction (ACE) corpora show that our model significantly outperforms featurebased joint model by Li and Ji (2014).", 
        "4": "We also compare our model with an end-toend tree-based LSTM model (SPTree) by Miwa and Bansal (2016) and show that our model performs within 1% on entity mentions and 2% on relations.", 
        "5": "Our finegrained analysis also shows that our model performs significantly better on AGENTARTIFACT relations, while SPTree performs better on PHYSICAL and PARTWHOLE relations."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 917–928 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1085  1 Introduction  Extraction of entities and their relations from text belongs to a very well-studied family of structured prediction tasks in NLP.", 
        "2": "There are several NLP tasks such as fine-grained opinion mining (Choi et al., 2006), semantic role labeling (Gildea and Jurafsky, 2002), etc., which have a similar structure; thus making it an important and a challenging task.", 
        "3": "Several methods have been proposed for entity mention and relation extraction at the sentencelevel.", 
        "4": "These can be broadly categorized into – 1) pipeline models that treat the identification of entity mentions (Nadeau and Sekine, 2007) and relation classification (Zhou et al., 2005) as two separate tasks; and 2) joint models, also the more\nrecent, which simultaneously identify the entity mention and relations (Li and Ji, 2014; Miwa and Sasaki, 2014).", 
        "5": "Joint models have been argued to perform better than the pipeline models as knowledge of the typed relation can increase the confidence of the model on entity extraction and vice versa.", 
        "6": "Recurrent networks (RNNs) (Elman, 1990) have recently become very popular for sequence tagging tasks such as entity extraction that involves a set of contiguous tokens.", 
        "7": "However, their ability to identify relations between non-adjacent tokens in a sequence, e.g., the head nouns of two entities, is less explored.", 
        "8": "For these tasks, RNNs that make use of tree structures have been deemed more suitable.", 
        "9": "Miwa and Bansal (2016), for example, propose an RNN comprised of a sequencebased long short term memory (LSTM) for entity identification and a separate tree-based dependency LSTM layer for relation classification using shared parameters between the two components.", 
        "10": "As a result, their model depends critically on access to dependency trees, restricting it to sentencelevel extraction and to languages for which (good) dependency parsers exist.", 
        "11": "Also, their model does not jointly extract entities and relations; they first extract all entities and then perform relation classification on all pairs of entities in a sentence.", 
        "12": "In our previous work (Katiyar and Cardie, 2016), we address the same task in an opinion extraction context.", 
        "13": "Our LSTM-based formulation explicitly encodes distance between the head of entities into opinion relation labels.", 
        "14": "The output space of our model is quadratic in size of the entity and relation label set and we do not specifically identify the relation type.", 
        "15": "Unfortunately, adding relation type makes the output label space very sparse, making it difficult for the model to learn.", 
        "16": "In this paper, we propose a novel RNN-based model for the joint extraction of entity mentions\n917\nand relations.", 
        "17": "Unlike other models, our model does not depend on any dependency tree information.", 
        "18": "Our RNN-based model is a multi-layer bidirectional LSTM over a sequence.", 
        "19": "We encode the output sequence from left-to-right.", 
        "20": "At each time step, we use an attention-like model on the previously decoded time steps, to identify the tokens in a specified relation with the current token.", 
        "21": "We also add an additional layer to our network to encode the output sequence from right-to-left and find significant improvement on the performance of relation identification using bi-directional encoding.", 
        "22": "Our model significantly outperforms the feature-based structured perceptron model of Li and Ji (2014), showing improvements on both entity and relation extraction on the ACE05 dataset.", 
        "23": "In comparison to the dependency treebased LSTM model of Miwa and Bansal (2016), our model performs within 1% on entities and 2% on relations on ACE05 dataset.", 
        "24": "We also find that our model performs significantly better than their tree-based model on the AGENT-ARTIFACT relation, while their tree-based model performs better on PHYSICAL and PART-WHOLE relations; the two models perform comparably on all other relation types.", 
        "25": "The very competitive performance of our non-tree-based model bodes well for relation extraction of non-adjacent entities in low-resource languages that lack good parsers.", 
        "26": "In the sections that follow, we describe related work (Section 2); our bi-directional LSTM model with attention (Section 3); the training (Section 4); the experiments on ACE dataset (Section 5); results (Section 6); error analysis (Section 7) and conclusion (Section 8).", 
        "27": "2 Related Work  RNNs (Hochreiter and Schmidhuber, 1997) have been recently applied to many sequential modeling and prediction tasks, such as machine translation (Bahdanau et al., 2015; Sutskever et al., 2014), named entity recognition (NER) (Hammerton, 2003), opinion mining (Irsoy and Cardie, 2014).", 
        "28": "Variants such as adding CRF-like objective on top of LSTMs have been found to produce state-of-the-art results on several sequence prediction NLP tasks (Collobert et al., 2011; Huang et al., 2015; Katiyar and Cardie, 2016).", 
        "29": "These models assume conditional independence at the output layer whereas the model we propose in this paper does not assume any conditional indepen-\ndence at the output layer, allowing it to model an arbitrary distribution over output sequences.", 
        "30": "Relation classification has been widely studied as a stand-alone task, assuming that the arguments of the relations are known in advance.", 
        "31": "There have been several models proposed including featurebased models (Bunescu and Mooney, 2005; Zelenko et al., 2003) and neural network based models (Socher et al., 2012; dos Santos et al., 2015; Hashimoto et al., 2015; Xu et al., 2015a,b).", 
        "32": "For joint-extraction of entities and relations, feature-based structured prediction models (Li and Ji, 2014; Miwa and Sasaki, 2014), joint inference integer linear programming models(Yih and Roth, 2007; Yang and Cardie, 2013), card-pyramid parsing (Kate and Mooney, 2010) and probabilistic graphical models (Yu and Lam, 2010; Singh et al., 2013) have been proposed.", 
        "33": "In contrast, we propose a neural network model which does not depend on the availability of any features such as part of speech (POS) tags, dependency trees, etc.", 
        "34": "Recently, Miwa and Bansal (2016) proposed an end-to-end LSTM based sequence and treestructured model.", 
        "35": "They extract entities via a sequence layer and relations between the entities via the shortest path dependency tree network.", 
        "36": "In this paper, we try to investigate recurrent neural networks with attention for extracting semantic relations between entity mentions without using any dependency parse tree features.", 
        "37": "We also present the first neural network based joint model that can extract entity mentions and relations along with the relation type.", 
        "38": "In our previous work (Katiyar and Cardie, 2016), as explained earlier, we proposed a LSTM-based model for joint extraction of opinion entities and relations, but no relation types.", 
        "39": "This model cannot be directly extended to include relation types as the output space becomes sparse making it difficult for the model to learn.", 
        "40": "Recent advances in recurrent neural network has seen the application of attention on recurrent neural networks to obtain a representation weighted by the importance of tokens in the sequence model.", 
        "41": "Such models have been very frequently used in question-answering tasks (for recent examples, see Chen et al.", 
        "42": "(2016) and Lee et al.", 
        "43": "(2016)), machine translation (Luong et al., 2015; Bahdanau et al., 2015), and many other NLP applications.", 
        "44": "Pointer networks (Vinyals et al., 2015), an adaptation of attention models, use these tokenlevel weights as pointers to the input elements.", 
        "45": "Zhai et al.", 
        "46": "(2017), for example, have used these for neural chunking, and Nallapati et al.", 
        "47": "(2016) and Cheng and Lapata (2016), for summarization.", 
        "48": "However, to the best of our knowledge, these networks have not been used for joint extraction of entity mentions and relations.", 
        "49": "We present first such attempt to use these attention models with recurrent neural networks for joint extraction of entity mentions and relations.", 
        "50": "3 Model  Our model comprises of a multi-layer bidirectional recurrent network which learns a representation for each token in the sequence.", 
        "51": "We use the hidden representation from the top layer for joint entity and relation extraction.", 
        "52": "For each token in the sequence, we output an entity tag and a relation tag.", 
        "53": "The entity tag corresponds to the entity type, whereas the relation tag is a tuple of pointers to related entities and their respective relation types.", 
        "54": "Figure 1 shows the annotation for an example sentence from the dataset.", 
        "55": "We transform the relation tags from entity level to token level.", 
        "56": "For example, we separately model the relation “ORG-AFF” for each token in the entity “ITV News”.", 
        "57": "Thus, we model the relations between “ITV” and “Martin Geissler”, and “News” and “Martin Geissler” separately.", 
        "58": "We employ a pointer-like network on top of the sequence layer in order to find the relation tag for each token as shown in Figure 2.", 
        "59": "At each time step, the network utilizes the information available about all output tags from the previous time steps in order to output the entity tag and relation tag jointly for the current token.", 
        "60": "3.1 Multi-layer Bi-directional Recurrent Network  We use multi-layer bi-directional LSTMs for sequence tagging because LSTMs are more capable of capturing long-term dependencies between tokens, making it ideal for both entity mention and\nrelation extraction.", 
        "61": "Using LSTMs, we can compute the hidden state−→\nht in the forward direction and ←− ht in the backward direction for every token as below: −→ h t = LSTM(xt, −→ h t−1)\n←− h t = LSTM(xt, ←− h t+1)\nFor every token t in the subsequent layer l, we combine the representations −→ h l−1t and ←− h l−1t from previous layer l-1 and feed it as an input.", 
        "62": "In this paper, we only use the hidden state from the last layer L for output layer and compute the top hidden layer representation as below:\nz ′ t = −→ V −→ h (L) t + ←− V ←− h (L) t + c\n−→ V and ←− V are weight matrices for combining hidden representations from the two directions.", 
        "63": "3.2 Entity detection  We formulate entity detection as a sequence labeling task using BILOU scheme similar to Li and Ji (2014) and Miwa and Bansal (2016).", 
        "64": "We assign each token in the entity with the tag B appended with the entity type if it is the beginning of the entity, I for inside of an entity, L for the end of the entity or U if there is only one token in the entity.", 
        "65": "Figure 1 shows an example of the entity tag sequence assigned to the sentence.", 
        "66": "For each token in the sequence, we perform a softmax over all candidate tags to output the most likely tag:\nyt = softmax(Uz ′ t + b)\nOur network structure as shown in Figure 2 also contains connections from the output yt−1 of the previous time step to the current top hidden layer.", 
        "67": "Thus our outputs are not conditionally independent from each other.", 
        "68": "In order to add connections from yt−1, we transform this output k into a label embedding bkt−1\n1.", 
        "69": "We represent each label type 1We can also add relation label embeddings using the re-\nlation tag output from the previous time step.", 
        "70": "k with a dense representation bk.", 
        "71": "We compute the output layer representations as:\nzt = LSTM([z ′ t; b k t−1], ht−1) yt = softmax(Uzt + b ′ )\nWe decode the output sequence from left to right in a greedy manner.", 
        "72": "3.3 Attention Model  We use attention model for relation extraction.", 
        "73": "Attention models, over an encoder sequence of representations z, can compute a soft probability distribution p over these learned representations, where di is the ith token in decoder sequence.", 
        "74": "These probabilities are an indication of the importance of different tokens in the encoder sequence:\nuit = v T tanh(W1z +W2di) pit = softmax(u i t)\nv is a weight matrix for attention which transforms the hidden representations into attention scores.", 
        "75": "We use pointer networks (Vinyals et al., 2015) in our approach, which are a variation of these attention models.", 
        "76": "Pointer networks interpret these pit as the probability distribution over the input encoding sequence and use uit as pointers to the input elements.", 
        "77": "We can use these pointers to encode relation between the current token and the previous predicted tokens, making it fit for relation extraction as explained in Section 3.4.", 
        "78": "3.4 Relation detection  We formulate relation extraction also as a sequence labeling task.", 
        "79": "For each token, we want to find the tokens in the past that the current token is related to along with its relation type.", 
        "80": "In Figure 1, “Safwan” is related to the tokens “Martin” as well as “Geissler” by the relation type “PHYS”.", 
        "81": "For simplicity, let us assume that there is only one previous token the current token is related to when training, i.e., “Safwan” is related to “Geissler” via PHYS relation.", 
        "82": "We can extend our approach to output multiple relations as explained in Section 4.", 
        "83": "We use pointer networks as described in Sec-\ntion 3.3.", 
        "84": "At each time step, we stack the top hidden layer representations from the previous time steps z≤t2 and its corresponding label embeddings b≤t.", 
        "85": "We only stack the top hidden layer representations for the tokens which were predicted as non-O’s for previous time steps as shown in Figure 2.", 
        "86": "Our decoding representation at time t is the concatenation of zt and bt.", 
        "87": "The attention probabilities can now be computed as below:\nut≤t = v T tanh(W1[z≤t; b≤t] +W2[zt; bt]) pt≤t = softmax(u t ≤t)\nThus, pt≤t corresponds to the probability of each token, in the sequence so far, being related to the current token at time step t. For the case of NONE relations, the token at t is related to itself.", 
        "88": "We also want to find the type of the relations.", 
        "89": "In order to achieve this, we add an extra dimension to v corresponding to the size of relation types R space.", 
        "90": "Thus, uit is no longer a score but a R dimensional vector.", 
        "91": "We then take softmax over this vector of size O(|z≤t|×R) to find the most likely tuple of pointer to the related entity and its relation type.", 
        "92": "3.5 Bi-directional Encoding  Bi-directional LSTMs have been found to be able to capture context better than plain left-to-right LSTMs, based on their performance on various NLP tasks (Irsoy and Cardie, 2014).", 
        "93": "Also, Sutskever et al.", 
        "94": "(2014) found that their performance on machine translation task improved on reversing the input sentences during training.", 
        "95": "Inspired by these developments, we experiment with bi-directional encoding at the output layer.", 
        "96": "We add another top hidden layer on Bi-LSTM in Figure 2 which encodes the output sequence from rightto-left.", 
        "97": "The two encoding share the same multilayer bi-directional LSTM except for the top hidden layer.", 
        "98": "Thus, we have two output layers in our network which output the entity tags and relation tags separately.", 
        "99": "At inference time, we employ heuristics to combine the output from the two directions.", 
        "100": "2The notation ≤ is used to denote the stacking of the representations from the previous time steps.", 
        "101": "Thus, if zt is a 2-dimensional matrix then z≤t will be a 3-dimensional tensor.", 
        "102": "The size along the first dimension will now correspond to the number of 2-dimensional matrices stacked.", 
        "103": "4 Training  We train our network by maximizing the logprobability of the correct entity E and relation R tag sequences jointly given the sentence S as below:\nlog p(E,R|S, θ)\n= 1 |S| ∑\ni∈|S| log p(ei, ri|e<i, r<i, S, θ)\n= 1 |S| ∑\ni∈|S| log p(ei|e<i, r<i) + log p(ri|e≤i, r<i)\nThus, we can decompose our objective into the sum of log-probabilities over entity sequence and relation sequence.", 
        "104": "We use the gold entity tags while training.", 
        "105": "As shown in Figure 2, we input the label embedding from the previous time step to the top hidden layer at the current time step along with the other recurrent inputs.", 
        "106": "During training, we pass the gold label embedding to the next time step which enables better training of our model.", 
        "107": "However, at test time when the gold label is not available we use the predicted label at previous time step as input to the current step.", 
        "108": "At inference time, we can greedily decode the sequence to find the most likely entity Ê and relation R̂ tag sequences:\n(Ê, R̂) = argmax E,R p(E,R)\nSince, we add another top layer to encode tag sequences in the reverse order as explained in Section 3.5, there may be conflicts in the output.", 
        "109": "We select the positive and more confident label similar to Miwa and Bansal (2016).", 
        "110": "Multiple Relations Our approach to relation extraction is different from Miwa and Bansal (2016).", 
        "111": "Miwa and Bansal (2016) present each pair of entities to their model for relation classification.", 
        "112": "In our approach, we use pointer networks to identify the related entities.", 
        "113": "Thus, for our approach described so far if we only compute the argmax on our objective then we limit our model to output only one relation label per token.", 
        "114": "However, from our analysis of the dataset, an entity may be related to more than one entity in the sentence.", 
        "115": "Hence, we modify our objective to include multiple relations.", 
        "116": "In Figure 2, token “Safwan” is related to both tokens “Martin” and “Geissler” of the entity “Martin Geissler”, hence we assign probability of 0.5\nto both these tokens.", 
        "117": "This can be easily expanded to include tokens from other related entities, such that we assign equal probability 1N to all tokens 3 depending on the number N of these related tokens.", 
        "118": "The log-probability for the entity part remain the same as in our objective discussed in Section 4, however we modify the relation log-probability as below:\n∑\n|j:r′i,j>0|\nr ′ i,j log p(ri,j|e≤i, r<i, S, θ)\nwhere, r ′ i is the true distribution over relation label space and ri is the softmax output from our model.", 
        "119": "From empirical analysis, we find that r\n′ i is\ngenerally sparse and hence using a cross entropy objective like this can be useful to find multiple relations.", 
        "120": "We can also use Sparsemax (Martins and Astudillo, 2016) instead of softmax which is more suitable for sparse distributions.", 
        "121": "However, we leave it for future work.", 
        "122": "At inference time, we output all the labels with probability value above a certain threshold.", 
        "123": "We adapt this threshold based on the validation set.", 
        "124": "5 Experiments    5.1 Data  We evaluate our proposed model on the two datasets from the Automatic Content Extraction (ACE) program – ACE05 and ACE04.", 
        "125": "There are 7 main entity types namely Person (PER), Organization (ORG), Geographical Entities (GPE), Location (LOC), Facility (FAC), Weapon (WEA) and Vehicle (VEH).", 
        "126": "For each entity, both entity mentions and its head phrase are annotated.", 
        "127": "For the scope of this paper, we only use the entity head phrase similar to Li and Ji (2014) and Miwa and Bansal (2016).", 
        "128": "Also, there are relation types namely Physical (PHYS), Person-Social (PER-SOC), Organization-Affiliation (ORG-AFF), Agent-Artifact (ART), GPE-Affiliation (GPEAFF).", 
        "129": "ACE05 has a total of 6 relation types including PART-WHOLE.", 
        "130": "We use the same data splits as Li and Ji (2014) and Miwa and Bansal (2016) such that there are 351 documents for training, 80 for\n3In this paper, we only identify mention heads and hence the span is limited to a few tokens.", 
        "131": "We can also include only the last token of the gold entity span in the gold probability distribution.", 
        "132": "development and the remaining 80 documents for the test set.", 
        "133": "ACE04 has 7 relation types with an additional Discourse (DISC) type and split ORG-AFF relation type into ORG-AFF and OTHER-AFF.", 
        "134": "We perform 5-fold cross validation similar to Chan and Roth (2011) for fair comparison with the state-of-theart.", 
        "135": "5.2 Evaluation Metrics  In order to compare our system with the previous systems, we report micro F1-scores, Precision and Recall on both entities and relations similar to Li and Ji (2014) and Miwa and Bansal (2016).", 
        "136": "An entity is considered correct if we can identify its head and the entity type correctly.", 
        "137": "A relation is considered correct if we can identify the head of the argument entities and also the relation type.", 
        "138": "We also report a combined score when both argument entities and relations are correct.", 
        "139": "5.3 Baselines and Previous Models  We compare our approach with two previous approaches.", 
        "140": "The model proposed by Li and Ji (2014) is a feature-based structured perceptron model with efficient beam-search.", 
        "141": "They employ a segment-based decoder instead of token-based decoding.", 
        "142": "Their model outperformed previous stateof-the-art pipelined models.", 
        "143": "Miwa and Sasaki (2014) (SPTree) recently proposed a LSTM-based model with a sequence layer for entity identification, and a tree-based dependency layer which identifies relations between pairs of candidate entities using the shortest dependency path between them.", 
        "144": "We also employed our previous approach (Katiyar and Cardie, 2016) for extraction of opinion entities and relations to this task.", 
        "145": "We found that the performance was not competitive with the two approaches mentioned above, performing upto 10 points lower on relations.", 
        "146": "Hence, we do not include the results in Table 1.", 
        "147": "Also, Li and Ji (2014) showed that the joint model performs better than the pipelined approaches.", 
        "148": "Thus, we do not include any pipeline baselines.", 
        "149": "5.4 Hyperparameters and Training Details  We train our model using Adadelta (Zeiler, 2012) with gradient clipping.", 
        "150": "We regularize our network using dropout (Srivastava et al., 2014) with the drop-out rate tuned using development set.", 
        "151": "We initialized our word embeddings\n1 We ran the system made publicly available by Miwa and Bansal (2016), on ACE05 dataset for filling in the missing values and comparing our system with theirs at fine-grained level.", 
        "152": "with 300-dimensional word2vec (Mikolov et al., 2013) word embeddings trained on Google News dataset.", 
        "153": "We have 3 hidden layers in our network and the dimensionality of the hidden units is 100.", 
        "154": "All the weights in the network are initialized from small random uniform noise.", 
        "155": "We tune our hyperparameters based on ACE05 development set and use them for training on ACE04 dataset.", 
        "156": "6 Results  Table 1 compares the performance of our system with respect to the baselines on ACE05 dataset.", 
        "157": "We find that our joint model significantly outperforms the joint structured perceptron model (Li and Ji, 2014) on both entities and relations, despite the unavailability of features such as dependency trees, POS tags, etc.", 
        "158": "However, if we compare our model to the SPTree models, then we find that their model has better recall on both entities and relations.", 
        "159": "In Section 7, we perform error analysis to understand the difference in the performance of the two models in detail.", 
        "160": "We also compare the performance of various encoding schemes in Table 2.", 
        "161": "We compare the benefits of introducing multiple relations in our objective and bi-directional encoding compared to leftto-right encoding.", 
        "162": "Multiple Relations We find that modifying our objective to include multiple relations improves the recall of our system on relations, leading to slight improvement on the overall performance on\nrelations.", 
        "163": "However, careful tuning of the threshold may further improve precision.", 
        "164": "Bi-directional Encoding By adding bidirectional encoding to our system, we find that we can significantly improve the performance of our system compared to left-to-right encoding.", 
        "165": "It also improves precision compared to left-toright decoding combined with multiple relations objective.", 
        "166": "We find that for some relations it is easier to detect them with respect to one of the entities in the entity pair.", 
        "167": "PHYS relation is easier identified with respect to GPE entity than PER entity.", 
        "168": "Thus, our bi-directional encoding of relations allows us to encode these relations with respect to both entities in the relation.", 
        "169": "Table 3 shows the performance of our model on ACE04 dataset.", 
        "170": "We believe that tuning the hyperparameters of our model can further improve the results on this dataset.", 
        "171": "As also pointed out by Li and Ji (2014) that ACE05 has better annotation quality, we focused on ACE05 dataset for this work.", 
        "172": "7 Error Analysis  In this section, we perform a fine-grained comparison of our model with respect to the SPTree (Miwa and Bansal, 2016) model.", 
        "173": "We compare the performance of the two models with respect to entities, relation types and the distance between the relation arguments and provide examples from the test set in Table 6.", 
        "174": "7.1 Entities  We find that our model has lower recall on entity extraction than SPTree as shown in Table 1.", 
        "175": "Miwa and Bansal (2016), in one of the ablation tests on ACE05 development set, show that their model can gain upto 2% improvement in recall by entity pretraining.", 
        "176": "Since we propose a jointmodel, we cannot directly apply their pretraining trick on entities separately.", 
        "177": "We leave it for future work.", 
        "178": "Li and Ji (2014) mentioned in their analysis of the dataset that there were many “UNK” tokens in the test set which were never seen during training.", 
        "179": "We verified the same and we hypothesize that for this reason the performance on the entities depends largely on the pretrained word embeddings being used.", 
        "180": "We found considerable improvements on entity recall when using pretrained word embeddings, if available, for these “UNK” tokens.", 
        "181": "Miwa and Bansal (2016) also use additional features such as POS tags in addition to pretrained word embeddings at the input layer.", 
        "182": "7.2 Relation Types  We evaluate our model on different relation types and compare the performance with SPTree model\nin Table 4.", 
        "183": "Interestingly, we find that the performance of the two models is varied over different relation types.", 
        "184": "The dependency tree-based model significantly outperforms our joint-model on PHYS and PART-WHOLE relations, whereas our model is significantly better than tree-based model on ART relation.", 
        "185": "We show an example sentence (S1) in Table 6, where SPTree model identifies the entities in ART relation correctly but fails to identify ART relation.", 
        "186": "We compare the performance with respect to PHYS relation in Section 7.3.", 
        "187": "7.3 Distance-based Analysis  We also compare the performance of the two models on relations based on the distance between the entities in a relation in Table 5.", 
        "188": "We find that the performance of both the models is very low for distance greater than 7.", 
        "189": "SPTree model can identify 36 relations out of 131 such relations correctly, while our model can only identify 20 relations in this category.", 
        "190": "We manually compare the output of the two systems on these cases on several examples to understand the gain of using dependency tree on longer distances.", 
        "191": "Interestingly, the majority of these relations belong to PHYS type, thus resulting in lower performance on PHYS as discussed in Section 7.2.", 
        "192": "We found that there were a few instances of co-reference errors as shown in S2 in Table 6.", 
        "193": "Our model identifies a PHYS relation between “here” and “baghdad”, whereas the gold annotation has PHYS relation between “location” and “baghdad”.", 
        "194": "We think that\nincorporating these co-reference information during both training and evaluation will further improve the performance of both systems.", 
        "195": "Another source of error that we found was the inability of our system to extract entities (lower recall) as in S3.", 
        "196": "Our model could not identify the FAC entity “residence”.", 
        "197": "Hence, we think an improvement on entity performance via methods like pretraining might be helpful in identifying more relations.", 
        "198": "For distance less than 7, we find that our model has better recall but lower precision, as expected.", 
        "199": "8 Conclusion  In this paper, we propose a novel attention-based LSTM model for joint extraction of entity mentions and relations.", 
        "200": "Experimentally, we found that our model significantly outperforms feature-rich structured perceptron joint model by Li and Ji (2014).", 
        "201": "We also compare our model to an endto-end LSTM model by Miwa and Bansal (2016) which comprises of a sequence layer for entity extraction and a tree-based dependency layer for relation classification.", 
        "202": "We find that our model, without access to dependency trees, POS tags, etc performs within 1% on entities and 2% on relations on ACE05 dataset.", 
        "203": "We also find that our model performs significantly better than their treebased model on the ART relation, while their treebased model performs better on PHYS and PARTWHOLE relations; the two models perform com-\nparably on all other relation types.", 
        "204": "In future, we plan to explore pretraining methods for our model which were shown to improve recall on entity and relation performance by Miwa and Bansal (2016).", 
        "205": "We introduce bi-directional output encoding as well as an objective to learn multiple relations in this paper.", 
        "206": "However, this presents the challenge of combining predictions from the two directions.", 
        "207": "We use heuristics in this paper to combine the predictions.", 
        "208": "We think that using probabilistic methods to combine model predictions from both directions may further improve the performance.", 
        "209": "We also plan to use Sparsemax (Martins and Astudillo, 2016) instead of Softmax for multiple relations, as the former is more suitable for multi-label classification for sparse labels.", 
        "210": "It would also be interesting to see the effect of reranking (Collins and Koo, 2005) on our joint model.", 
        "211": "We also plan to extend the identification of entities to full entity mention span instead of only the head phrase as in Lu and Roth (2015).", 
        "212": "Acknowledgments  We thank Qi Li and Makoto Miwa for their help with the dataset and sharing their code for analysis.", 
        "213": "We also thank Xilun Chen, Xanda Schofield, Yiqing Hua, Vlad Niculae, Tianze Shi and the three anonymous reviewers for their helpful feedback and discussion."
    }, 
    "document_id": "P17-1085.pdf.json"
}
