{
    "abstract_sentences": {
        "1": "Lexical features are a major source of information in state-of-the-art coreference resolvers.", 
        "2": "Lexical features implicitly model some of the linguistic phenomena at a fine granularity level.", 
        "3": "They are especially useful for representing the context of mentions.", 
        "4": "In this paper we investigate a drawback of using many lexical features in state-of-the-art coreference resolvers.", 
        "5": "We show that if coreference resolvers mainly rely on lexical features, they can hardly generalize to unseen domains.", 
        "6": "Furthermore, we show that the current coreference resolution evaluation is clearly flawed by only evaluating on a specific split of a specific dataset in which there is a notable overlap between the training, development and test sets."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 14–19 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2003  1 Introduction  Similar to many other tasks, lexical features are a major source of information in current coreference resolvers.", 
        "2": "Coreference resolution is a set partitioning problem in which each resulting partition refers to an entity.", 
        "3": "As shown by Durrett and Klein (2013), lexical features implicitly model some linguistic phenomena, which were previously modeled by heuristic features, but at a finer level of granularity.", 
        "4": "However, we question whether the knowledge that is mainly captured by lexical features can be generalized to other domains.", 
        "5": "The introduction of the CoNLL dataset enabled a significant boost in the performance of coreference resolvers, i.e.", 
        "6": "about 10 percent difference between the CoNLL score of the currently best coreference resolver, deep-coref by Clark and Manning (2016b), and the winner of the CoNLL 2011 shared task, the Stanford rule-based system\nby Lee et al.", 
        "7": "(2013).", 
        "8": "However, this substantial improvement does not seem to be visible in downstream tasks.", 
        "9": "Worse, the difference between stateof-the-art coreference resolvers and the rule-based system drops significantly when they are applied on a new dataset, even with consistent definitions of mentions and coreference relations (Ghaddar and Langlais, 2016a).", 
        "10": "In this paper, we show that if we mainly rely on lexical features, as it is the case in state-of-theart coreference resolvers, overfitting become more sever.", 
        "11": "Overfitting to the training dataset is a problem that cannot be completely avoided.", 
        "12": "However, there is a notable overlap between the CoNLL training, development and test sets that encourages overfitting.", 
        "13": "Therefore, the current coreference evaluation scheme is flawed by only evaluating on this overlapped validation set.", 
        "14": "To ensure meaningful improvements in coreference resolution, we believe an out-of-domain evaluation is a must in the coreference literature.", 
        "15": "2 Lexical Features  The large difference in performance between coreference resolvers that use lexical features and ones which do not, implies the importance of lexical features.", 
        "16": "Durrett and Klein (2013) show that lexical features implicitly capture some phenomena, e.g.", 
        "17": "definiteness and syntactic roles, which were previously modeled by heuristic features.", 
        "18": "Durrett and Klein (2013) use exact surface forms as lexical features.", 
        "19": "However, when word embeddings are used instead of surface forms, the use of lexical features is even more beneficial.", 
        "20": "Word embeddings are an efficient way of capturing semantic relatedness.", 
        "21": "Especially, they provide an efficient way for describing the context of mentions.", 
        "22": "Durrett and Klein (2013) show that the addition of some heuristic features like gender, num-\n14\nber, person and animacy agreements and syntactic roles on top of their lexical features does not result in a significant improvement.", 
        "23": "deep-coref, the state-of-the-art coreference resolver, follows the same approach.", 
        "24": "Clark and Manning (2016b) capture the required information for resolving coreference relations by using a large number of lexical features and a small set of nonlexical features including string match, distance, mention type, speaker and genre features.", 
        "25": "The main difference is that Clark and Manning (2016b) use word embeddings instead of the exact surface forms that are used by Durrett and Klein (2013).", 
        "26": "Based on the error analysis by cort (Martschat and Strube, 2014), in comparison to systems that do not use word embeddings, deep-coref has fewer recall and precision errors especially for pronouns.", 
        "27": "For example, deep-coref correctly recognizes around 83 percent of non-anaphoric “it” in the CoNLL development set.", 
        "28": "This could be a direct result of a better context representation by word embeddings.", 
        "29": "3 Out-of-Domain Evaluation  Aside from the evident success of lexical features, it is debatable how well the knowledge that is mainly captured by the lexical information of the training data can be generalized to other domains.", 
        "30": "As reported by Ghaddar and Langlais (2016b), state-of-the-art coreference resolvers trained on the CoNLL dataset perform poorly, i.e.", 
        "31": "worse than the rule-based system (Lee et al., 2013), on the new dataset, WikiCoref (Ghaddar and Langlais, 2016b), even though WikiCoref is annotated with the same annotation guidelines as the CoNLL dataset.", 
        "32": "The results of some of recent coreference resolvers on this dataset are listed in Table 1.", 
        "33": "The results are reported using MUC (Vilain\net al., 1995), B3 (Bagga and Baldwin, 1998), CEAFe (Luo, 2005), the average F1 score of these three metrics, i.e.", 
        "34": "CoNLL score, and LEA (Moosavi and Strube, 2016).", 
        "35": "berkeley is the mention-ranking model of Durrett and Klein (2013) with the FINAL feature set including the head, first, last, preceding and following words of a mention, the ancestry, length, gender and number of a mention, distance of two mentions, whether the anaphor and antecedent are nested, same speaker and a small set of string match features.", 
        "36": "cort is the mention-ranking model of Martschat and Strube (2015).", 
        "37": "cort uses the following set of features: the head, first, last, preceding and following words of a mention, the ancestry, length, gender, number, type, semantic class, dependency relation and dependency governor of a mention, the named entity type of the head word, distance of two mentions, same speaker, whether the anaphor and antecedent are nested, and a set of string match features.", 
        "38": "berkeley and cort scores in Table 1 are taken from Ghaddar and Langlais (2016a).", 
        "39": "deep-coref is the mention-ranking model of Clark and Manning (2016b).", 
        "40": "deep-coref incorporates a large set of embeddings, i.e.", 
        "41": "embeddings of the head, first, last, two previous/following words, and the dependency governor of a mention in addition to the averaged embeddings of the five previous/following words, all words of the mention, sentence words, and document words.", 
        "42": "deep-coref also incorporates type, length, and position of a mention, whether the mention is nested in any other mention, distance of two mentions, speaker features and a small set of string match features.", 
        "43": "For deep-coref [conll] the averaged CoNLL score is used to select the best trained model on the development set.", 
        "44": "deep-coref [lea] uses the LEA\nmetric (Moosavi and Strube, 2016) for choosing the best model.", 
        "45": "It is worth noting that the results of deep-coref ’s ranking model may be slightly different at various experiments.", 
        "46": "However, the performance of deep-coref [lea] is always higher than that of deep-coref [conll].", 
        "47": "We add WikiCoref’s words to deep-coref ’s dictionary for both deep-coref [conll] and deep-coref [lea].", 
        "48": "deep-coref− reports the performance of deep-coref [lea] in which WikiCoref’s words are not incorporated into the dictionary.", 
        "49": "Therefore, for deep-coref−, WikiCoref’s words that do not exist in CoNLL will be initialized randomly instead of using pre-trained word2vec word embeddings.", 
        "50": "The performance gain of deep-coref [lea] in comparison to deep-coref− indicates the benefit of using pre-trained word embeddings and word embeddings in general.", 
        "51": "Henceforth, we refer to deep-coref [lea] as deep-coref.", 
        "52": "4 Why do Improvements Fade Away?", 
        "53": "In this section, we investigate how much lexical features contribute to the fact that current improvements in coreference resolution do not properly apply to a new domain.", 
        "54": "Table 2 shows the ratio of non-pronominal coreferent mentions in the CoNLL test set that also appear as coreferent mentions in the training data.", 
        "55": "These high ratios indicate a high degree of overlap between the mentions of the CoNLL datasets.", 
        "56": "The highest overlap between the training and test sets exists in genre pt (Bible).", 
        "57": "The tc (telephone conversation) genre has the lowest overlap for non-pronominal mentions.", 
        "58": "However, this genre includes a large number of pronouns.", 
        "59": "We choose wb (weblog) and pt for our analysis as two genres with low and high degree of overlap.", 
        "60": "Table 3 shows the results of the examined coreference resolvers when the test set only includes one genre, i.e.", 
        "61": "pt or wb, in two different settings: (1) the training set includes all genres (in-domain\nevaluation), and (2) the corresponding genre of the test set is excluded from the training and development sets (out-of-domain evaluation).", 
        "62": "berkeley-final is the coreference resolver of Durrett and Klein (2013) with the FINAL feature set explained in Section 3. berkeley-surface is the same coreference resolver with only surface features, i.e.", 
        "63": "ancestry, gender, number, same speaker and nested features are excluded from the FINAL feature set.", 
        "64": "cort−lexical is a version of cort in which no lexical feature is used, i.e.", 
        "65": "the head, first, last, governor, preceding and following words of a mention are excluded.", 
        "66": "For in-domain evaluations we train deep-coref ’s ranking model for 100 iterations, i.e.", 
        "67": "the setting used by Clark and Manning (2016a).", 
        "68": "However, based on the performance on the development set, we only train the model for 50 iterations in out-ofdomain evaluations.", 
        "69": "The results of the pt genre show that when there is a high overlap between the training and test datasets, the performance of all learning-based classifiers significantly improves.", 
        "70": "deep-coref has the largest gain from including pt in the training data that is more than 13% based on the LEA score.", 
        "71": "cort uses both lexical and a relatively large number of non-lexical features while berkeley-surface is a pure lexicalized system.", 
        "72": "However, the difference between the berkeley-surface’s performances when pt is included or excluded from the training data is lower than that of cort.", 
        "73": "berkeley uses feature-value pruning so lexical features that occur fewer than 20 times are pruned from the training data.", 
        "74": "Maybe, this is the reason that berkeley’s performance difference is less than other lexicalized systems in highly overlapping datasets.", 
        "75": "For a less overlapping genre, i.e.", 
        "76": "wb, the performance gain of including the genre in the training data is significantly lower for all lexicalized systems.", 
        "77": "Interestingly, the performance of berkeleyfinal, cort and cort−lexical increases for the wb genre when this genre is excluded from the training set.", 
        "78": "deep-coref, which uses a complex deep neural network and mainly lexical features, has the highest gain from the redundancy in the training and test datasets.", 
        "79": "As we use more complex neural networks, there is more capacity for brute-force memorization of the training dataset.", 
        "80": "It is also worth noting that the performance gains and drops in out-of-domain evaluations are\nnot entirely because of lexical features, as the performance of cort−lexical also drops significantly in pt out-of-domain evaluation.", 
        "81": "The classifier may also memorize other properties of the seen mentions in the training data.", 
        "82": "However, in comparison to features like gender and number agreement or syntactic roles, lexical features have the highest potential for overfitting.", 
        "83": "We further analyze the output of deep-coref on the development set.", 
        "84": "The all rows in Table 4 show the number of pairwise links that are created by deep-coref on the development set for different mention types.", 
        "85": "The seen rows show the ratio of each category of links for which the (antecedent head, anaphor head) pair is seen in the training set.", 
        "86": "All ratios are surprisingly high.", 
        "87": "The most worrisome cases are those in which both mentions are either a proper name or a common noun.", 
        "88": "Table 5 further divides the links of Table 4 based on whether they are correct coreferent links.", 
        "89": "The results of Table 5 show that most of the incorrect links are also made between the mentions that are both seen in the training data.", 
        "90": "The high ratios indicate that (1) there is a high\noverlap between the mention pairs of the training and development sets, and (2) even though that deep-coref uses generalized word embeddings instead of exact surface forms, it is strongly biased towards the seen mentions.", 
        "91": "We analyze the links that are created by Stanford’s rule-based system and compute the ratio of the links that exist in the training set.", 
        "92": "All corresponding ratios are lower than those of deep-coref in Table 5.", 
        "93": "However, the ratios are surprisingly high for a system that does not use the training data.", 
        "94": "This analysis emphasizes the overlap in the CoNLL datasets.", 
        "95": "Because of this high overlap, it is not easy to assess the generalizability of a coreference resolver to unseen mentions on the CoNLL dataset given its official split.", 
        "96": "We also compute the ratios of Table 5 for the missing links that are associated with the recall er-\nrors of deep-coref.", 
        "97": "We compute the recall errors by cort error analysis tool (Martschat and Strube, 2014).", 
        "98": "Table 6 shows the corresponding ratios for recall errors.", 
        "99": "The lower ratios of Table 6 in comparison to those of Table 4 emphasize the bias of deep-coref towards the seen mentions.", 
        "100": "For example, the deep-coref links include 31 cases in which both mentions are either proper names or common nouns and the head of one of the mentions is “country”.", 
        "101": "For all these links, “country” is linked to a mention that is seen in the training data.", 
        "102": "Therefore, this raises the question how the classifier would perform on a text about countries not mentioned in the training data.", 
        "103": "Memorizing the pairs in which one of them is a common noun could help the classifier to capture world knowledge to some extent.", 
        "104": "From the seen pairs like (Haiti, his country), and (Guangzhou, the city) the classifier could learn that “Haiti” is a country and “Guangzhou” is a city.", 
        "105": "However, it is questionable how useful word knowledge is if it is mainly based on the training data.", 
        "106": "The coreference relation of two nominal noun phrases with no head match can be very hard to resolve.", 
        "107": "The resolution of such pairs has been referred to as capturing semantic similarity (Clark and Manning, 2016b).", 
        "108": "deep-coref links 49 such pairs on the development set.", 
        "109": "Among all these links, only 5 pairs are unseen on the training set and all of them are incorrect links.", 
        "110": "The effect of lexical features is also analyzed by Levy et al.", 
        "111": "(2015) for tasks like hypernymy and entailment.", 
        "112": "They show that state-of-the-art classifiers memorize words from the training data.", 
        "113": "The classifiers benefit from this lexical memorization when there are common words between the training and test sets.", 
        "114": "5 Discussion  We show the extensive use of lexical features biases coreference resolvers towards seen mentions.", 
        "115": "This bias holds us back from developing more robust and generalizable coreference resolvers.", 
        "116": "After all, while coreference resolution is an important step for text understanding, it is not an endtask.", 
        "117": "Coreference resolvers are going to be used in tasks and domains for which coreference annotated corpora may not be available.", 
        "118": "Therefore, generalizability should be brought into attention in developing coreference resolvers.", 
        "119": "Moreover, we show that there is a significant overlap between the training and validation sets in the CoNLL dataset.", 
        "120": "The LEA metric (Moosavi and Strube, 2016) is introduced as an attempt to make coreference evaluations more reliable.", 
        "121": "However, in order to ensure valid developments on coreference resolution, it is not enough to have reliable evaluation metrics.", 
        "122": "The validation set on which the evaluations are performed also needs to be reliable.", 
        "123": "A dataset is reliable for evaluations if a considerable improvement on this dataset indicates a better solution for the coreference problem instead of a better exploitation of the dataset itself.", 
        "124": "This paper is not intended to argue against the use of lexical features.", 
        "125": "Especially, when word embeddings are used as lexical features.", 
        "126": "The incorporation of word embeddings is an efficient way for capturing semantic relatedness.", 
        "127": "Maybe we should use them more for describing the context and less for describing the mentions themselves.", 
        "128": "Pruning rare lexical features plus incorporating more generalizable features could also help to prevent overfitting.", 
        "129": "To ensure more meaningful improvements, we ask to incorporate out-of-domain evaluations in the current coreference evaluation scheme.", 
        "130": "Outof-domain evaluations could be performed by using either the existing genres of the CoNLL dataset or by using other existing coreference annotated datasets like WikiCoref, MUC or ACE.", 
        "131": "Acknowledgments  The authors would like to thank Kevin Clark for answering all of our questions regarding deepcoref.", 
        "132": "We would also like to thank the three anonymous reviewers for their thoughtful comments.", 
        "133": "This work has been funded by the Klaus Tschira Foundation, Heidelberg, Germany.", 
        "134": "The first author has been supported by a Heidelberg Institute for Theoretical Studies PhD.", 
        "135": "scholarship."
    }, 
    "document_id": "P17-2003.pdf.json"
}
