{
    "abstract_sentences": {
        "1": "Volatility prediction—an essential concept in financial markets—has recently been addressed using sentiment analysis methods.", 
        "2": "We investigate the sentiment of annual disclosures of companies in stock markets to forecast volatility.", 
        "3": "We specifically explore the use of recent Information Retrieval (IR) term weighting models that are effectively extended by related terms using word embeddings.", 
        "4": "In parallel to textual information, factual market data have been widely used as the mainstream approach to forecast market risk.", 
        "5": "We therefore study different fusion methods to combine text and market data resources.", 
        "6": "Our word embedding-based approach significantly outperforms state-ofthe-art methods.", 
        "7": "In addition, we investigate the characteristics of the reports of the companies in different financial sectors."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1712–1721 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1157  1 Introduction  Financial volatility is an essential indicator of instability and risk of a company, sector or economy.", 
        "2": "Volatility forecasting has gained considerable attention during the last three decades.", 
        "3": "In addition to using historic stock prices, new methods in this domain use sentiment analysis to exploit various text resources, such as financial reports (Kogan et al., 2009; Wang et al., 2013; Tsai and Wang, 2014; Nopp and Hanbury, 2015), news (Kazemian et al., 2014; Ding et al., 2015), message boards (Nguyen and Shirai, 2015), and earning calls (Wang and Hua, 2014).", 
        "4": "An interesting resource of textual information are the companies’ annual disclosures, known as 10-K filing reports.", 
        "5": "They contain comprehensive information about the companies’ business as well as risk factors.", 
        "6": "Specifically, section Item 1A - Risk Factors of the reports contains information about\nthe most significant risks for the company.", 
        "7": "These reports are however long, redundant, and written in a style that makes them complex to process.", 
        "8": "Dyer et al.", 
        "9": "(2016) notes that: “10-K reports are getting more redundant and complex [...] (it) requires a reader to have 21.6 years of formal education to fully comprehend”.", 
        "10": "Dyer et al.", 
        "11": "also analyse the topics discussed in the reports and observe a constant increase over the years in both the length of the documents as well as the number of topics.", 
        "12": "They claim that the increase in length is not the result of economic factors but is due to verboseness and redundancy in the reports.", 
        "13": "They suggest that only the risk factors topic appears to be useful and informative to investors.", 
        "14": "Their analysis motivates us to study the effectiveness of the Risk Factors section for volatility prediction.", 
        "15": "Our research builds on previous studies on volatility prediction and information analysis of 10-K reports using sentiment analysis (Kogan et al., 2009; Tsai and Wang, 2014; Wang et al., 2013; Nopp and Hanbury, 2015; Li, 2010; Campbell et al., 2014), in the sense that since the reports are long (average length of 5000 words), different approaches are required, compared with studies of sentiment analysis on short-texts.", 
        "16": "Such previous studies on 10-K reports have mostly used the data before 2008 and there is little work on the analysis of the informativeness and effectiveness of the recent reports with regards to volatility prediction.", 
        "17": "We will indeed show that the content of the reports changes significantly not only before and after 2008, but rather in a cycle of 3-4 years.", 
        "18": "In terms of use of the textual content for volatility prediction, this paper shows that state-ofthe-art Information Retrieval (IR) term weighting models, which benefit from word embedding information, have a significantly positive impact on prediction accuracy.", 
        "19": "The most recent study on the topic (Tsai and Wang, 2014) used related terms obtained by word embeddings to expand the\n1712\nlexicon of sentiment terms.", 
        "20": "In contrast, similar to Rekabsaz et al.", 
        "21": "(2016b), we define the weight of each lexicon term by extending it to the similar terms in the document.", 
        "22": "The significant improvement of this approach for document retrieval by capturing the importance of the terms motivates us to apply it on sentiment analysis.", 
        "23": "We extensively evaluate various state-of-the-art sentiment analysis methods to investigate the effectiveness of our approach.", 
        "24": "In addition to text, factual market data (i.e.", 
        "25": "historical prices) provide valuable resources for volatility prediction e.g.", 
        "26": "in the framework of GARCH models (Engle, 1982).", 
        "27": "An emerging question is how to approach the combination of the textual and factual market information.", 
        "28": "We propose various methods for this issue and show the performance and characteristics of each.", 
        "29": "The financial system covers a wide variety of industries, from daily-consumption products to space mission technologies.", 
        "30": "It is intuitive to consider that the factors of instability and uncertainty are different between the various sectors while similar inside them.", 
        "31": "We therefore also analyse the sentiment of the reports of each sector separately and study their particular characteristics.", 
        "32": "The present study shows the value of information in the 10-K reports for volatility prediction.", 
        "33": "Our proposed approach to sentiment analysis significantly outperforms state-of-the-art methods (Kogan et al., 2009; Tsai and Wang, 2014; Wang et al., 2013).", 
        "34": "We also show that performance can be further improved by effectively combining textual and factual market information.", 
        "35": "In addition, we shed light on the effects of tailoring the analysis to each sector: despite the reasonable expectation that domain-specific training would lead to improvements, we show that our general model generalizes well and outperforms sector-specific trained models.", 
        "36": "The remainder of the paper is organized as follows: in the next section, we review the state-ofthe-art and related studies.", 
        "37": "Section 3 formulates the problem, followed by a detailed explanation of our approach in Section 4.", 
        "38": "We explain the dataset and settings of the experiments in Section 5, followed by the full description of the experiments in Section 6.", 
        "39": "We conclude the work in Section 7.", 
        "40": "2 Related Work  Market prediction has been attracting much attention in recent years in the natural language processing community.", 
        "41": "Kazemian et al.", 
        "42": "(2014) use sentiment analysis for predicting stock price movements in a simulated security trading system using news data, showing the advantages of the method against simple trading strategies.", 
        "43": "Ding et al.", 
        "44": "(2015) address a similar objective while using deep learning to extract and learn events in the news.", 
        "45": "Xie et al.", 
        "46": "(2013) introduce a semantic treebased model to represent news data for predicting stock price movement.", 
        "47": "Luss et al.", 
        "48": "(2015) also exploit news in combination with return prices to predict intra-day price movements.", 
        "49": "They use the Multi Kernel Learning (MKL) algorithm for combining the two features.", 
        "50": "The combination shows improvement in final prediction in comparison to using each of the features alone.", 
        "51": "Motivated by this study, we investigate the performance of the MKL algorithm as one of the methods to combine the textual with non-textual information.", 
        "52": "Other data resources, such as stocks’ message boards, are used by Nguyen and Shirai (2015) to study topic modelling for aspect-based sentiment analysis.", 
        "53": "Wang and Hua (2014) investigate the sentiment of the transcript of earning calls for volatility prediction using the Gaussian Copula regression model.", 
        "54": "While the mentioned studies use short-length texts (sentence or paragraph level), approaching long texts (document level) for market prediction is mainly based on n-gram bag of words methods.", 
        "55": "Nopp and Hanbury (2015) study the sentiment of banks’ annual reports to assess banking systems risk factors using a finance-specific lexicon, provided by Loughran and McDonald (2011), in both unsupervised and supervised manner.", 
        "56": "More directly related to the informativeness of the 10-K reports for volatility prediction, Kogan et al.", 
        "57": "(2009) use a linear Support Vector Machine (SVM) algorithm on the reports published between 1996–2006.", 
        "58": "Wang et al.", 
        "59": "(2013) improve upon this by using the Loughran and McDonald (2011) lexicon, observing improvement in the prediction.", 
        "60": "Later, Tsai and Wang (2014) apply the same method as Wang et al.", 
        "61": "(2013) while additionally using word embedding to expand the financial lexicon.", 
        "62": "We reproduce all the methods in these studies, and show the advantage of our sentiment analysis approach.", 
        "63": "3 Problem Formulation  In this section, we formulate the volatility forecasting problem and the prediction objectives of our experiments.", 
        "64": "Similar to previous studies (Christiansen et al., 2012; Kogan et al., 2009; Tsai and Wang, 2014), volatility is defined as the natural log of the standard deviation of (adjusted) return prices in a window of τ days.", 
        "65": "This definition is referred to as standard volatility (Li and Hong, 2011) or realized volatility (Liu and Tse, 2013), defined as follows:\nv[s,s+τ ] = ln\n  √∑s+τ\nt=s (rt − r̄)2 τ\n  (1)\nwhere rt is the return price and r̄ the mean of return prices.", 
        "66": "The return price is calculated by rt = ln(Pt)−ln(Pt−1), where Pt is the (adjusted) closing price of a given stock at the trading date t.\nGiven an arbitrary report i, we define a prediction label yki as the volatility of the stock of the reporting company in the kth quarter-sized window starting from the issue date of the report si:\nyki = v[si+64(k−1),si+64k] (2)\nEvery quarter is considered as per convention, 64 working days, while the full year is assumed to have 256 working days.", 
        "67": "We use 8 learners for labels y1 to y8.", 
        "68": "For brevity, unless otherwise mentioned, we report the volatility of the first year by calculating the mean of the first four quartiles after the publication of each report.", 
        "69": "4 Methodology  We first describe our text sentiment analysis methods, followed by the features obtained from factual market data, and finally explain the methods to combine textual and market feature sets.", 
        "70": "4.1 Sentiment Analysis  Similar to previous studies (Nopp and Hanbury, 2015; Wang et al., 2013), we extract the keyword set from a finance-specific lexicon (Loughran and McDonald, 2011) using the positive, negative, and uncertain groups, stemmed using the Porter stemmer.", 
        "71": "We refer to this keyword set as Lex.", 
        "72": "Tsai and Wang (2014) expanded this set by adding the top 20 related terms to each term to the original set.", 
        "73": "The related terms are obtained using the Word2Vec (Mikolov et al., 2013) model, built on\nthe corpus of all the reports, with Cosine similarity.", 
        "74": "We also use this expanded set in our experiments and refer to it as LexExt.", 
        "75": "The following word weighting schemes are commonly used in Information Retrieval and we consider them as well in our study: TC : log(1 + tcdi(t))\nTF : log(1+tcdi (t))\n‖di‖\nTFIDF : log(1+tcdi (t)) ‖di‖ log(1 + |di| df(t))\nBM25 : (k+1)tfdi (t)\nk+tfdi (t) , tfdi(t) =\ntcdi (t)\n(1−b)+b |di| avgdl\nwhere tcdi(t) is the number of occurrences of keyword t in report i, ‖di‖ denotes the Euclidean norm of the keyword weights of the report, |di| is the length of the report (number of the words in the report), avgdl is the average document length, and finally k and b are parameters.", 
        "76": "For them, we use the settings used in previous studies (Rekabsaz et al., 2016b) i.e.", 
        "77": "k = 1.2 and b = 0.65.", 
        "78": "In addition to the standard weighting schemes, we use state-of-the-art weighting methods in Information Retrieval (Rekabsaz et al., 2016b) which benefit directly from word embedding models: They exploit similarity values between words provided by the word embedding model into the weighting schemes by extending the weight of each lexicon keyword with its similar words:\nt̂cdi(t) = tcdi(t) + ∑\nt′∈R(t) sim(t, t′)tcdi(t ′) (3)\nwhere R(t) is the list of similar words to the keyword t, and sim(t, t′) is the Cosine similarity value between the vector representations of the words t and t′.", 
        "79": "As previously suggested by Rekabsaz et al.", 
        "80": "(2016a, 2017), we use the Cosine similarity function with threshold 0.70 for selecting the set R(t) of similar words.", 
        "81": "We define the extended versions of the standard weighting schemes as T̂C, T̂F, T̂FIDF, and B̂M25 by replacing tcdi(t) with t̂cdi(t) in each of the schemes.", 
        "82": "The feature vector generated by the weights of the Lex or LexExt lexicons is highly sparse, as the number of dimensions is larger than the number of data-points.", 
        "83": "We therefore reduce the dimensions by applying Principle Component Analysis (PCA).", 
        "84": "Our initial experiments show 400 dimen-\nsion as the optimum by trying on a range of dimensions from 50 to 1000.", 
        "85": "Given the final feature vector x with l dimensions, we apply SVM as a well-known method for training both regression and classification methods.", 
        "86": "Support Vector Regression (Drucker et al., 1997) formulates the training as the following optimization problem:\nmin w∈IRl\n1 2 ‖w‖2+C N\nN∑\ni=1\nmax(0, ‖yi − f(xi;w)‖ − )\n(4) Similar to previous studies (Tsai and Wang, 2014; Kogan et al., 2009), we set C = 1.0 and = 0.1.", 
        "87": "To solve the above problem, the function f can be re-parametrized in terms of a kernel function K with weights αi:\nf(xi;w) =\nN∑\ni=1\nαiK(xi, x) (5)\nThe kernel can be considered as a (similarity) function between the feature vector of the document and vectors of all the other documents.", 
        "88": "Our initial experiments showed better performance of the Radial Basis Function (RBF) kernel in comparison to linear and cosine kernels and is therefore used in this paper.", 
        "89": "In addition, motivated by Moraes et al.", 
        "90": "(Moraes et al., 2013), we use of an Artificial Neural Network (ANN) algorithm to test the effectiveness of neural networks for automatic feature learning.", 
        "91": "We tried several neural network architectures with different regularization methods (early-stopping, regularization term, dropout).", 
        "92": "The best performing results were achieved with two hidden layers (400 and 500 nodes respectively), tanh for activation function, and learning rate of 0.001 in gradient decent with early stopping.", 
        "93": "However, the networks could not provide superior results than the SVM regressors.", 
        "94": "Therefore, for this report, we only report the SVM methods.", 
        "95": "4.2 Market Features  In addition to textual features, we define three features using the factual market data and historical prices—referred to as market features—as follows: Current Volatility is calculated on the window of one quartile before the issue date of the report: v[si−64,si].", 
        "96": "GARCH (Bollerslev, 1986) is a common econometric time-series model used for predicting stock price volatility.", 
        "97": "We use a GARCH (1, 1) model, trained separately for each report on intra-day return prices.", 
        "98": "We use all price data available before the issue date of the report for fitting the model.", 
        "99": "The GARCH (1, 1) model used predicts the volatility of the next day by looking at the previous day’s volatility.", 
        "100": "When forecasting further than one day into the future one needs to use the model’s own predictions in order to be able to make predictions for more than one day ahead.", 
        "101": "When forecasting further into the future these conditional forecasts of the variance will converge to a value called unconditional variance.", 
        "102": "As our forecast period is one quarter, we will approximate the volatility of future quarters with the unconditional variance.", 
        "103": "Sector is the sector that the corresponding company of the report belongs to, namely energy (ene), basic industries (ind), finance (fin), technology (tech), miscellaneous (misc), consumer nondurables (n-dur), consumer durables (dur), capital goods (capt), consumer services (serv), public utilities (pub), and health care (hlth)1.", 
        "104": "The feature is converted to numerical representation using onehot encoding.", 
        "105": "4.3 Feature Fusion  To combine the text and market feature sets, the first approach, used also in previous studies ((Kogan et al., 2009; Wang et al., 2013)) is simply joining all the features in one feature space.", 
        "106": "In the context of multi-model learning, the method is referred to as early fusion.", 
        "107": "In contrast, late fusion approaches first learn a model on each feature set and then use/learn a meta model to combine their results.", 
        "108": "As our second approach, we use stacking (Wolpert, 1992), a special case of late fusion.", 
        "109": "In stacking, we first split the training set into two parts (70%-30% portions).", 
        "110": "Using the first portion, we train separate machine learning models for each of the text and market feature sets.", 
        "111": "Next, we predict labels of the second portion with the trained models and finally train another model to capture the combinations between the outputs of the base models.", 
        "112": "In our experiments, the final model is always trained with SVM with RBF kernel.", 
        "113": "Stacking is computationally inexpensive.", 
        "114": "How-\n1We follow NASDAQ categorization of sectors.", 
        "115": "ever, due to the split of the training set, the base models or the meta model may suffer from lack of training data.", 
        "116": "A potential approach to learn both the feature sets in one model is the MKL method.", 
        "117": "The MKL algorithm (also called intermediate fusion (Noble et al., 2004)) extends the kernel of the SVM model by learning (simultaneous to the parameter learning) an optimum combination of several kernels.", 
        "118": "The MKL algorithm as formulated in Lanckriet et al.", 
        "119": "(2004) adds the following criterion to Eq.", 
        "120": "5 for kernel learning:\nK∗ = ∑\ni\ndiKi where ∑\ni\ndi = 1, di ≥ 0 (6)\nwhere Ki is a predefined kernel.", 
        "121": "Gönen and Alpaydın (2011) mention two uses of MKL: learning the optimum kernel in SVM, and combining multiple modalities (feature sets) via each kernel.", 
        "122": "However, the optimization can be computationally challenging.", 
        "123": "We use the mklaren method (Stražar and Curk, 2016) which has linear complexity in the number of data instances and kernels.", 
        "124": "It has been shown to outperform recent multi kernel approximation approaches.", 
        "125": "We use RBF kernels for both the text and market feature sets.", 
        "126": "5 Experiment Setup  In this section, we first describe the data, followed by introducing the baselines.", 
        "127": "We report the parameters applied in various algorithms and describe the evaluation metrics.", 
        "128": "Dataset We download the reports of companies of the U.S. stock markets from 2006 to 2015 from the U.S. Securities and Exchange Commission (SEC) website2.", 
        "129": "We remove HTML tags and extract the text parts.", 
        "130": "We extract the Risk Factors section using term matching heuristics.", 
        "131": "Finally, the texts are stemmed using the Porter stemmer.", 
        "132": "We calculate the volatility values (Eq 1) and the volatility of the GARCH model based on the stock prices, collected from the Yahoo website.", 
        "133": "We filter the volatility values greater/smaller than the mean plus/minus three times the standard deviation of all the volatility values3.", 
        "134": "Baselines GARCH: although the GARCH model is of market factual information, we use\n2https://www.sec.gov 3The complete dataset is available in http://ifs.", 
        "135": "tuwien.ac.at/˜admire/financialvolatility\nit as a baseline to compare the effectiveness of text-based methods with mainstream approaches.", 
        "136": "Market: uses all the market features.", 
        "137": "For both the GARCH and Market baselines, we use an SVM learner with RBF kernel.", 
        "138": "Wang et al.", 
        "139": "(2013): they use the Lex keyword set with TC weighting scheme and the SVM method.", 
        "140": "They combine the textual features with current volatility using the early fusion method.", 
        "141": "Tsai et al.", 
        "142": "(2014): similar to Wang et al.", 
        "143": "(2013), while they use the LexExt keyword set.", 
        "144": "Evaluation Metrics As a common metric in volatility prediction, we use the r2 metric (square of the correlation coefficient) for evaluation:\nr2 =\n \n∑n i=1(ŷi − ¯̂y)(yi − ȳ)√∑n\ni=1(ŷi − ¯̂y)2 √∑n i=1(yi − ȳ)2\n  2\n(7) where ŷi is the predicted value, yi denotes the labels and ȳ, their mean.", 
        "145": "The r2 metric indicates the proportion of variance in the labels explained by the prediction.", 
        "146": "The measure is close to 1 when the predicted values can explain a large proportion of the variability in the labels and 0 when it fails to explain the labels’ variabilities.", 
        "147": "An alternative metric, used in previous studies (Wang et al., 2013; Tsai and Wang, 2014; Kogan et al., 2009) is Mean Squared Error MSE = ∑ i(ŷi − yi)2/n.", 
        "148": "However, especially when comparing models, applied on different test sets (e.g.", 
        "149": "performance of first quartile with second quartile), r2 has better interpretability since it is independent of the scale of y.", 
        "150": "We use r2 in all the experiments while the MSE measure is reported only when the models are evaluated on the same test set.", 
        "151": "6 Experiments and Results  In this section, first we analyse the contents of the reports, followed by studying our sentiment analysis methods for volatility prediction.", 
        "152": "Finally, we investigate the effect of sentiment analysis of the reports in different industry sectors.", 
        "153": "6.1 Content Analysis of 10-K Reports  Let us start our experiment with observing changes in the feature vectors of the reports over the years.", 
        "154": "To compare them, we use the state-ofthe-art sentiment analysis method, introduced by Tsai and Wang (2014).", 
        "155": "We first represent the feature vector of each year by calculating the centroid\n2015 2014 2013 2012 2011 2010 2009 2008 2007 2006\n0.8\n0.4\n0.0\n0.4\n0.8\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\nr 2\n(element-wise mean) of the feature vectors of all reports published that year and then calculate the Cosine similarity of each pair of centroid vectors, for the years 2006–2015.", 
        "156": "Figure 1a shows the similarity heat-map for each pair of the years.", 
        "157": "We observe a high similarity between three ranges of years: 2006–2008, 2009–2011, and 2012–2015.", 
        "158": "These considerable differences between the centroid reports in years across these three groups hints at probable issues when using the data of the older years for the more recent ones.", 
        "159": "To validate this, we apply 5-fold cross validation, first on all the data (2006–2015), and then on smaller sets by dropping the oldest year i.e.", 
        "160": "the next subsets use the reports 2007–2015, 2008– 2015 and so forth.", 
        "161": "The results of the r2 measure are shown in Figure 1b.", 
        "162": "We observe that by dropping the oldest years one by one (from left to right in the figure), the performance starts improving.", 
        "163": "We argue that this improvement is due to the reduction of noise in data, noise caused by conceptual drifts in the reports as also mentioned by Dyer et al.", 
        "164": "(2016).", 
        "165": "In fact, although in machine learning in general using more data results in better generalization of the model and therefore better prediction, the reports of the older years introduce noise.", 
        "166": "As shown, the most coherent and largest data consists of the subset of the reports published between 2012 to 2015.", 
        "167": "This subset is also the most recent cluster and presumably more similar to the future reports.", 
        "168": "Therefore, in the following, we only use this subset, which consists of 3892 reports, belonging to 1323 companies.", 
        "169": "6.2 Volatility Prediction  Given the dataset of the 2012–2015 reports, we try all combinations of different term weighting schemes using the LexExt keyword set.", 
        "170": "All weighting schemes are then combined with the market features with the introduced fusion methods.", 
        "171": "The prediction is done with 5-fold cross validation.", 
        "172": "The averages of the results of the first four quartiles (first year) are reported in Table 1.", 
        "173": "To make showing the results tractable, we use the best fusion (stacking) for the weighting schemes and the best scheme (B̂M25) for fusions.", 
        "174": "Regarding the weighting schemes, B̂M25, BM25, and T̂C show the best results.", 
        "175": "In general, the extended schemes (with hat) improve upon their normal forms.", 
        "176": "For the feature fusion methods, stacking outperforms the other approaches in both evaluation measures.", 
        "177": "MKL however has better performance than early fusion while it has the highest computational complexity among the methods.", 
        "178": "Based on these results, as our best performing approach in the remainder of the paper, we use B̂M25 (with LexExt set), reduced to 400 dimensions and stacking as the fusion method.", 
        "179": "Table 2 summarizes the results of our best per-\nforming method compared with previously existing methods.", 
        "180": "Our method outperforms all state-ofthe-art methods both when using textual features only as well as a combination of textual and market features.", 
        "181": "Let us now take a closer look on the changes in the performance of the prediction in time.", 
        "182": "The results of 5-fold cross validation for both tasks on the dataset of the reports, published between 2012–2015 are shown in Figure 2a.", 
        "183": "The X-axes show eight quartiles after the publication date of the report.", 
        "184": "For comparison, the GARCH and only market features are depicted with dashed lines.", 
        "185": "As shown, the performance of the GARCH method as well as that using only market features (Market) decrease faster in the later quartiles since the historical prices used for prediction become less relevant as time goes by.", 
        "186": "Using only text features (Text), we see a roughly similar performance between the first four quartiles (first year), while the performance, in general, slightly decreases in the second year.", 
        "187": "By combining the textual and market features (Text+Market), we see a consistent improvement in comparison to each of them alone.", 
        "188": "In comparison to using only market features, the combination of the features shows more stable results in the later quartiles.", 
        "189": "These results support the informativeness of the 10-K reports to more effectively foreseen volatility in long-term windows.", 
        "190": "While the above experiments are based on cross-validation, for the sake of completeness it is noteworthy to consider the scenarios of realworld applications where the future prediction is based on past data.", 
        "191": "We therefore design three experiments by considering the reports published\nin 2013, 2014, and 2015 as test set and the reports published before each year as training set (only 2012, 2012–2013, and 2012–2014 respectively).", 
        "192": "The results of predicting the reports of each year together with the cross validation scenario (CV) are shown in Figure 2b.", 
        "193": "While the performance becomes slightly worse in the target years 2013 and 2015, in general the combination of textual and market features can explain approximately half of volatility in the financial system.", 
        "194": "6.3 Sectors  Corporations in the same sector share not only similar products or services but also risks and instability factors.", 
        "195": "Considering the sentiment of the financial system as a homogeneous body may neglect the specific factors of each sector.", 
        "196": "We therefore set out to investigate the existence and nature of these differences.", 
        "197": "We start by observing the prediction performance on different sectors: We use our method from the previous section, but split the test set across sectors and plot the results in Figure 2c.", 
        "198": "The hashed areas indicate the GARCH and Market baselines for the Text and Text+Market feature sets, respectively.", 
        "199": "We observe considerable differences between the performance of the sectors, especially when using only sentiment analysis methods (i.e.", 
        "200": "only text features).", 
        "201": "Given these differences and also the probable similarities between the risk factors of the reports in the same sector, a question immediately arises: can training different models for different sectors improve the performance of prediction?", 
        "202": "To answer it, for each sector, we train a model using only the subset of the reports in that sec-\nen e in d fin te ch m is c ndu\nr ca pt du r se rv pu b hl th\n0.0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 r 2\nSector-agnostic Sector-specific General model\n(a) Text\nen e in d fin te ch m is c ndu\nr ca pt du r se rv pu b hl th\n0.0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 r 2\nSector-agnostic Sector-specific General model\n(b) Text+Market\nFigure 3: Results when retraining on sector-specific subsets versus the general model and versus subsets of the same size but sector-agnostic.", 
        "203": "The hashed area in (a) indicates the GARCH and in (b) the Market baseline.", 
        "204": "tor and use 5-fold validation to observe performance.", 
        "205": "We refer to these models as sector-specific in contrast to the general model, trained on all the data.", 
        "206": "Figures 3a and 3b compare their results: we can see that the sector-specific bars are lower than the general model ones.", 
        "207": "This is to some extent surprising, as one would expect that domainspecific training would improve the performance of sentiment analysis in text.", 
        "208": "However, we need to consider the size of the training set.", 
        "209": "By training on each sector we have reduced the size of our training sets to those reported in Table 3.", 
        "210": "To verify the effect of the size of training data, we train a sector-agnostic model for each sector.", 
        "211": "Each sector-agnostic model is trained by random sampling of a training set of the same size as the set available for its sector from all the reports, but evaluated–similar to sector-specific models–on the test set of the sector.", 
        "212": "Figures 3a and 3b also plot the results of the sector-agnostic models.", 
        "213": "The large performance differences between sector-agnostic and -specific show the existence of particular risk factors in each sector and their importance.", 
        "214": "Results also confirm the hypothesis that the data for training in each sector is simply too small, and as additional data is accumulated, we can further improve on the results by training on different sectors independently.", 
        "215": "We continue by examining some examples of essential terms in sectors.", 
        "216": "To address this, we have to train a linear regression method on all the reports of each sector, without using any dimensionality reduction.", 
        "217": "Linear regression without dimensionality reduction has the benefit of interpretability: the coefficient of each feature (i.e.", 
        "218": "term in the lexicon) can be seen as its importance with regards to volatility prediction.", 
        "219": "After training, we observe that some keywords e.g.", 
        "220": "crisis, or delist constantly have high coefficient values in the sector-specific as well as general model.", 
        "221": "However, some keywords are particularly weighted high in specificsector models.", 
        "222": "For instance, the keyword fire has a high coefficient in the energy sector, but very low in the others.", 
        "223": "The reason is due to the problem of ambiguity i.e.", 
        "224": "in the energy sector, fire is widely used to refer to explosion e.g.", 
        "225": "‘fire and explosion hazards’ while in the lexicon, it is stemmed from firing and fired: the act of dismissing from a job.", 
        "226": "This later sense of word is however weighted as a low risk-sensitive keyword in the other sectors.", 
        "227": "Such an ambiguity can indeed be mitigated by sectorspecific models since the variety of the words’ senses are more restricted inside each sector.", 
        "228": "Another example is an interesting observation on the word beneficial.", 
        "229": "The word is introduced as a positive sentiment in the lexicon while it gains highly negative sentiments in some sectors (health care, and basic industries).", 
        "230": "Investigating in the reports, we observe the broad use of the expression ‘beneficial owner’ which is normally followed by riskfull sentences since the beneficial owners can potentially influence shareholders’ decision power.", 
        "231": "7 Conclusion  In this work, we studied the sentiment of recent 10-K annual disclosures of companies in stock markets for forecasting volatility.", 
        "232": "Our bag-ofwords sentiment analysis approach benefits from state-of-the-art models in information retrieval which use word embeddings to extend the weight of the terms to the similar terms in the document.", 
        "233": "Additionally, we explored fusion methods to combine the text features with factual market features, achieved from historical prices i.e.", 
        "234": "GARCH prediction model, and current volatility.", 
        "235": "In both cases, our approach outperforms state-ofthe-art volatility prediction methods with 10-K reports and demonstrates the effectiveness of sentiment analysis in long-term volatility forecasting.", 
        "236": "In addition, we studied the characteristics of each individual sector with regard to risk-sensitive terms.", 
        "237": "Our analysis shows that reports in same sectors considerably share particular risk and instability factors.", 
        "238": "However, despite expectations, training different models on different sectors does not improve performance compared to the general model.", 
        "239": "We traced this to the size of the available data in each sector, and show that there are still benefits in considering sectors, which could be further explored in the future as more data becomes available.", 
        "240": "8 Acknowledgement  This paper follows work produced during the Young Scientists Summer Program (YSSP) 2016 at the International Institute for Applied Systems Analysis (IIASA) in Laxenburg, Austria.", 
        "241": "This work is funded by: Self-Optimizer (FFG 852624) in the EUROSTARS programme, funded by EUREKA, the BMWFW and the European Union, ADMIRE (P 25905-N23) by FWF, and the Austrian Ministry for Science, Research and Economy.", 
        "242": "Thanks to Joni Sayeler and Linus Wretblad for their contributions in the SelfOptimizer project."
    }, 
    "document_id": "P17-1157.pdf.json"
}
