{
    "abstract_sentences": {
        "1": "We investigate object naming, which is an important sub-task of referring expression generation on real-world images.", 
        "2": "As opposed to mutually exclusive labels used in object recognition, object names are more flexible, subject to communicative preferences and semantically related to each other.", 
        "3": "Therefore, we investigate models of referential word meaning that link visual to lexical information which we assume to be given through distributional word embeddings.", 
        "4": "We present a model that learns individual predictors for object names that link visual and distributional aspects of word meaning during training.", 
        "5": "We show that this is particularly beneficial for zero-shot learning, as compared to projecting visual objects directly into the distributional space.", 
        "6": "In a standard object naming task, we find that different ways of combining lexical and visual information achieve very similar performance, though experiments on model combination suggest that they capture complementary aspects of referential meaning."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 243–254 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1023  1 Introduction  Expressions referring to objects in visual scenes typically include a word naming the type of the object: E.g., house in Figure 1 (a), or, as a very general type, thingy in Figure 1 (d).", 
        "2": "Determining such a name is a crucial step for referring expression generation (REG) systems, as many other decisions concerning, e.g., the selection of attributes follow from it (Dale and Reiter, 1995; Krahmer and Van Deemter, 2012).", 
        "3": "For a long time, however, research on REG mostly assumed the availability of symbolic representations of ref-\nerent and scene, and sidestepped questions about how speakers actually choose these names, due to the lack of models capable of capturing what a word like house refers to in the real world.", 
        "4": "Recent advances in image processing promise to fill this gap, with state-of-the-art computer vision systems being able to classify images into thousands of different categories (e.g.", 
        "5": "Szegedy et al.", 
        "6": "(2015)).", 
        "7": "However, classification is not naming (Ordonez et al., 2016).", 
        "8": "Standard object classification schemes are inherently “flat”, and treat object labels as mutually exclusive (Deng et al., 2014).", 
        "9": "A state-of-the-art object recognition system would be trained to classify the object in e.g.", 
        "10": "Figure 1 (a) as either house or building, ignoring the lexical similarity between these two names.", 
        "11": "In contrast, humans seem to be more flexible as to the chosen level of generality.", 
        "12": "Depending on the prototypicality of the object to name, and possibly other visual properties, a general name might be more or less appropriate.", 
        "13": "For instance, a robin can be named bird, but a penguin is better referred\n243\nto as “penguin” (Rosch, 1978); along the same lines, the rather unusual building in Figure 1 (c) that is not easy to otherwise categorise was named “structure”.", 
        "14": "Other work at the intersection of image and language processing has investigated models that learn to directly associate visual objects with a continuous representation of word meaning, i.e.", 
        "15": "through cross-modal transfer into distributional vector spaces (Frome et al., 2013; Norouzi et al., 2013).", 
        "16": "Here, the idea is to exploit a powerful model of lexical similarity induced from large amounts text for being able to capture inherent lexical relations between object categories.", 
        "17": "Thus, under the assumption that such semantic spaces represent, in some form at least, taxonomic knowledge, this makes labels on different levels of specificity available for a given object.", 
        "18": "Moreover, if the mapping is sufficiently general, it should be able to map objects to an appropriate label, even if during training of the mapping this label has not been seen (zero-shot learning).", 
        "19": "While cross-modal transfer seems to be a conceptually attractive model for learning object names, it is based on an important assumption that, in our view, has not received sufficient attention in previous works: it assumes that a given distributional vector space constitutes an optimal target representation that visual instances of objects can be mapped to.", 
        "20": "However, distributional representations of word meaning are known to capture a rather fuzzy notion of lexical similarity, e.g.", 
        "21": "car is similar to van and to street.", 
        "22": "A cross-modal transfer model is “forced” to learn to map objects into the same area in the semantic space if their names are distributionally similar, but regardless of their actual visual similarity.", 
        "23": "Indeed, we have found in a recent study that the contribution of distributional information to learning referential word meanings is restricted to certain types of words and does not generalize across the vocabulary (Zarrieß and Schlangen, 2017).", 
        "24": "The goal of this work is to learn a model of referential word meaning that makes accurate object naming predictions and goes beyond treating words as independent, mutually exclusive labels in a flat classification scheme.", 
        "25": "We extend upon work on learning models of referential word use from corpora of images paired with referring expressions (Schlangen et al., 2016; Zarrieß and Schlangen, 2017) that treats words as individual\npredictors capturing referential appropriateness.", 
        "26": "We explore different ways of linking these predictors to distributional knowledge, during application and during training.", 
        "27": "We find that these different models achieve very similar performance in a standard object naming task, though experiments on model combination suggest that they capture complementary aspects of referential meaning.", 
        "28": "In a zero-shot setup of an object naming task, we find that combining lexical and visual information during training is most beneficial, outperforming variants of cross-modal transfer.", 
        "29": "2 Related Work  Grounding and Reference An early example for work in REG that goes beyond Dale and Reiter (1995)’s dominant symbolic paradigm is Deb Roy’s work from the early 2000s (Roy et al., 2002; Roy, 2002, 2005).", 
        "30": "Roy et al.", 
        "31": "(2002) use computer vision techniques to process a video feed, and to compute colour, positional and spatial features.", 
        "32": "These features are then associated in a learning process with certain words, resulting in an association of colour features with colour words, spatial features with prepositions, etc., and based on this, these words can be interpreted with reference to the scene currently presented to the video feed.", 
        "33": "Whereas Roy’s work still looked at relatively simple scenes with graphical objects, research on REG has recently started to investigate set-ups based on real-world images (Kazemzadeh et al., 2014; Gkatzia et al., 2015; Zarrieß and Schlangen, 2016; Mao et al., 2015).", 
        "34": "Importantly, the lowlevel visual features that can be extracted from these scenes correspond less directly to particular word classes.", 
        "35": "Moreover, the visual scenes contain many different types of objects, which poses new challenges for REG.", 
        "36": "For instance, Zarrieß and Schlangen (2016) find that semantic errors related to mismatches between nouns (e.g.", 
        "37": "the system generates tree vs. man) are particularly disturbing for users.", 
        "38": "Whereas Zarrieß and Schlangen (2016) propose a strategy to avoid object names when the systems confidence is low, we focus on improving the generation of object names, using distributional knowledge as an additional source.", 
        "39": "Similarly, Ordonez et al.", 
        "40": "(2016) have studied the problem of deriving appropriate object names, or so-called entry-level categories, from the output of an object recognizer.", 
        "41": "Their approach focusses on linking abstract object categories in ImageNet\nto actual words via various translation procedures.", 
        "42": "We are interested in learning referential appropriateness and extensional word meanings directly from actual human referring expressions (REs) paired with objects in images, using an existing object recognizer for feature extraction.", 
        "43": "Multi-modal distributional semantics Distributional semantic models are a well-known method for capturing lexical word meaning in a variety of tasks (Turney and Pantel, 2010; Mikolov et al., 2013; Erk, 2016).", 
        "44": "Recent work on multimodal distributional vector spaces (Feng and Lapata, 2010; Silberer and Lapata, 2014; Kiela and Bottou, 2014; Lazaridou et al., 2015b; Kottur et al., 2016) has aimed at capturing semantic similarity even more accurately by integrating distributional and perceptual features associated with words (mostly taken from images) into a single representation.", 
        "45": "Cross-modal transfer Rather than fusing different modalities into a single, joint space, other work has looked at cross-modal mapping between spaces.", 
        "46": "Herbelot and Vecchi (2015) present a model that learns to map vectors in a distributional space to vectors in a set-theoretic space, showing that there is a functional relationship between distributional information and conceptual knowledge representing quantifiers and predicates.", 
        "47": "More related to our work are cross-modal mapping models,that learn to transfer from a representation of an object or image in the visual space to a vector in a distributional space (Socher et al., 2013; Frome et al., 2013; Norouzi et al., 2013; Lazaridou et al., 2014).", 
        "48": "Here, the motivation is to exploit the rich lexical knowledge encoded in a distributional space for learning visual classifications.", 
        "49": "In practice, these models are mostly used for zeroshot learning where the test set contains object categories not observed during training.", 
        "50": "When tested on standard object recognition tasks, transfer, however, comes at a price.", 
        "51": "Frome et al.", 
        "52": "(2013) and Norouzi et al.", 
        "53": "(2013) both find that it slightly degrades performance as compared to a plain object classification using standard accuracy metrics (called flat “hit @k metric” in their paper).", 
        "54": "Interestingly though, Frome et al.", 
        "55": "(2013) report better performance using “hierarchical precision”, which essentially means that transfer predicts words that are ontologically closer to the gold label and makes “semantically more reasonable er-\nrors”.", 
        "56": "To the best of our knowledge, this pattern has not been systematically investigated any further.", 
        "57": "Another known problem with cross-modal transfer is that it seems to generalize less well than expected, i.e.", 
        "58": "tends to reproduce word vectors observed during training (Lazaridou et al., 2015a).", 
        "59": "In this work, we present a model that exploits distributional knowledge for learning referential word meaning as well, but explore and compare different ways of combining visual and lexical aspects of referential word meaning.", 
        "60": "3 Task and Data  We define object naming as follows: Given an object x in an image, the task is to predict a word w that could be used as the head noun of a realistic referring expression.", 
        "61": "(Cf.", 
        "62": "discussion above: “bird” when naming a robin, but “penguin” when naming a penguin.)", 
        "63": "To get at this, we develop our approach using a corpus of referring expressions produced by human users under natural, interactive conditions (Kazemzadeh et al., 2014), and train and test on the corresponding head nouns in these REs.", 
        "64": "This is similar to picture naming setups used in psycholinguistic research (cf.", 
        "65": "Levelt et al.", 
        "66": "(1991)) and based on the simplifying assumption that the name used for referring to an object can be determined successfully without looking at other objects in the image.", 
        "67": "We now summarise the details of our setup:\nCorpus We train and test on the REFERIT corpus (Kazemzadeh et al., 2014), which is based on the SAIAPR image collection (Grubinger et al., 2006) (99.5k image regions;120K REs).", 
        "68": "We follow (Schlangen et al., 2016) and select words with a minimum frequency of 40 in these two data sets, which gives us a vocabulary of 793 words.", 
        "69": "Names For most of our experiments, we only use a subset of this vocabulary, namely the set of object names.", 
        "70": "As the REs contain nouns that cannot be considered to be object names (background, bottom, etc.", 
        "71": "), we extract a list of names from the semantically annotated held-out set released with the REFERIT.", 
        "72": "These correspond to ‘entry-level’ nouns mentioned in Kazemzadeh et al.", 
        "73": "(2014).", 
        "74": "This gives us a list of 159 names.", 
        "75": "This set corresponds to the majority of object names in the corpus: out of the 99.5K available image regions, we use 80K for training and testing.", 
        "76": "Thus, our experiments are on a smaller scale as compared\nto (Ordonez et al., 2016).", 
        "77": "Nevertheless, the data is challenging, as the corpus contains references to objects that fall outside of the object labeling scheme that available object recognition systems are typically optimized for, cf.", 
        "78": "Hu et al.", 
        "79": "(2015)’s discussion on “stuff” entities such “sky” or “grass” in the REFERIT data.", 
        "80": "For testing, we remove relational REs (containing a relational preposition such as ‘left of X’), because here we cannot be sure that the head noun of the target is fully informative; we also remove REs with more than one head noun from our list (i.e.", 
        "81": "these are mostly relational expressions as well such as ‘girl laughing at boy’).", 
        "82": "We pair each image region from the test set with its corresponding names from the remaining REs.", 
        "83": "Image and Word Embeddings Following Schlangen et al.", 
        "84": "(2016), we derive representations of our visual inputs with a convolutional neural network, ‘GoogleNet’ (Szegedy et al., 2015), which was trained on the ImageNet corpus (Deng et al., 2009), and extract the final fully-connected layer before the classification layer, to give us a 1024 dimensional representation of the region.", 
        "85": "We add 7 features that encode information about the region relative to the image, thus representing each object as a vector of 1031 features.", 
        "86": "As distributional word vectors, we use the word2vec representations provided by Baroni et al.", 
        "87": "(2014) (trained with CBOW, 5-word context window, 10 negative samples, 400 dimensions).", 
        "88": "4 Three Models of Interfacing Visual and  Distributional Information  4.1 Direct Cross-Modal Mapping  Following Lazaridou et al.", 
        "89": "(2014), referential meaning can be represented as a translation function that projects visual representations of objects to linguistic representations of words in a distributional vector space.", 
        "90": "Thus, in contrast to standard object recognition systems or the other models we will use here, cross-modal mapping does not treat words as individual labels or classifiers, but learns to directly predict continuous representations of words in a vector space, such as the space defined by the word2vec embeddings that we use in this work.", 
        "91": "This model will be called TRANSFER below.", 
        "92": "During training, we pair each object with the distributional embedding of its name, and use standard Ridge regression for learning the trans-\nformation.", 
        "93": "Lazaridou et al.", 
        "94": "(2014) and Lazaridou et al.", 
        "95": "(2015a) test a range of technical tweaks and different algorithms for cross-modal mapping.", 
        "96": "For ease of comparison with other models, we stick with simple Ridge Regression in this work.", 
        "97": "For decoding, we map an object into the distributional space, and retrieve the nearest neighbors of the predicted vector using cosine similarity.", 
        "98": "In theory, the model should generalize easily to words that it has not observed in a pair with an object during training as it can map an object anywhere in the distributional space.", 
        "99": "4.2 Lexical Mapping Through Individual Word Classifiers  Another approach is to keep visual and distributional information separate, by training a separate visual classifier for each word w in the vocabulary.", 
        "100": "Predictions can then be mapped into distributional space during application time via the vectors of the predicted words.", 
        "101": "Here, we use Schlangen et al.", 
        "102": "(2016)’s WAC model, building the training set for each word w as follows: all visual objects in a corpus that have been referred to as w are used as positive instances, the remaining objects as negative instances.", 
        "103": "Thus, the classifiers learn to predict referential appropriateness for individual words based on the visual features of the objects they refer to, in isolation of other words.", 
        "104": "During decoding, we apply all word classifiers from the model’s vocabulary to the given object, and take the argmax over the individual word probabilities.", 
        "105": "The model predicts names directly, without links into a distributional space.", 
        "106": "In order to extend the model’s vocabulary for zero-shot learning, we follow Norouzi et al.", 
        "107": "(2013) and associate the top n words with their corresponding distributional vector and compute the convex combination of these vectors.", 
        "108": "Then, in parallel to cross-modal mapping, we retrieve the nearest neighbors of the combined embedding from the distributional space.", 
        "109": "Thus, with this model, we use two different modes of decoding: one that projects into distributional space, one that only applies the available word classifiers.", 
        "110": "We did some small-scale experiments to find an optimal value for n, similar to Norouzi et al.", 
        "111": "(2013).", 
        "112": "In our case, performance started to decrease systematically with n > 10, but did not differ significantly for values below 10.", 
        "113": "In Section 5, we will report results for n set to 5 and 10.", 
        "114": "4.3 Word Prediction via Cross-Modal Similarity Mapping  Finally, we implement an approach that combines ideas from cross-modal mapping with the WAC model: we train individual predictors for each word in the vocabulary, but, during training, we exploit lexical similarity relations encoded in a distributional space.", 
        "115": "Instead of treating a word as a binary classifier, we annotate its training instances with a fine-grained similarity signal according to their object names.", 
        "116": "When building the training set for such a word predictor w, instead of simply dividing objects into w and ¬w instances, we label each object with a real-valued similarity obtained from cosine similarity between w and v in a distributional vector space, where v is the word that was used to refer to the object.", 
        "117": "Thus, we task the model with jointly learning similarities and referential appropriateness, by training it with Ridge regression on a continuous output space.", 
        "118": "Object instances where v = w (i.e., the positive instances in the binary setup) have maximal similarity; the remaining instances have a lower value which is more or less close to maximal similarity.", 
        "119": "This is the SIM-WAP model, recently proposed in Zarrieß and Schlangen (2017).", 
        "120": "Importantly, and going beyond Zarrieß and Schlangen (2017), this model allows for an innovative treatment of words that only exist in a distributional space (without being paired with visual referents in the image corpus): as the predictors are trained on a continuous output space, no genuine positive instances of a word’s referent are needed.", 
        "121": "When training a predictor for such a word w, we use all available objects from our corpus and annotate them with the expected lexical similarity between w and the actual object names v, which for all objects will be below the maximal value that marks genuine positive instances.", 
        "122": "During decoding, this model does not need to project its predictions into a distributional space, but it simply applies all available predictors to the object, and takes the argmax over the predicted referential appropriateness scores.", 
        "123": "5 Experiment 1: Naming Objects  This Section reports on experiments in a standard setup of the object naming task where all object names are paired with visual instances of their referents during training.", 
        "124": "In a comparable task, i.e.", 
        "125": "object recognition with known ob-\nject categories, cross-modal projection or transfer approaches have been reported to perform worse than standard object classification methods (Frome et al., 2013; Norouzi et al., 2013).", 
        "126": "This seems to suggest that lexical or at least distributional knowledge is detrimental when learning what a word refers to in the real world and that referential meaning should potentially be learned from visual object representation only.", 
        "127": "5.1 Model comparison  Setup We use the train/test split of REFERIT data as in (Schlangen et al., 2016).", 
        "128": "We consider image regions with non-relational referring expressions that contain at least one of the 159 head nouns from the list of entry-level nouns (see section 3).", 
        "129": "This amounts to 6208 image regions for testing and 73K instances for training.", 
        "130": "Results Table 1 shows accuracies in the object naming task for the TRANSFER, WAC and SIMWAP models according to their accuracies in the top n, including two variants of WAC where its top 5 and top 10 predictions are projected into the distributional space.", 
        "131": "Overall, the models achieve very similar performance.", 
        "132": "However, there is an interesting pattern when comparing accuracies @1 and @2 to accuracies in the top 5 predictions.", 
        "133": "Thus, looking at accuracies for the top (two) predictions, the various models that link referential meaning to word representations in the distributional space all perform slightly worse than the plain WAC model, i.e.", 
        "134": "individual word classifiers trained on visual features only.", 
        "135": "This might suggest that certain aspects of referential word meaning are learned less accurately when mapping from visual to distributional space (which replicates results reported in the literature on standard object recognition benchmarks).", 
        "136": "On the other hand, the SIM-WAP model is on a par with WAC in terms of the @5 accuracy.", 
        "137": "This effect suggests that distributional knowledge that SIM-WAP has access to during training sometimes distracts the model from predicting the exact name chosen by a human speaker, but that SIM-WAP is still able to rank it among the most probable names.", 
        "138": "As a simple accuracy-based evaluation is not suited to fully explain this pattern, we carry out a more detailed analysis in Section 5.3.", 
        "139": "5.2 Model combination  In order to get more insight into why the TRANSFER and SIM-WAP models produce slightly worse results than individual visual word classifiers, we now test to what extent the different models are complementary and combine them by aggregating over their naming predictions.", 
        "140": "If the models are complementary, their combination should lead to more confident and accurate naming decisions.", 
        "141": "Setup We combine TRANSFER, SIM-WAP and WAC by aggregating the scores they predict for different object names for a given object.", 
        "142": "During testing, we apply all models to an image region and consider words ranked among the top 10.", 
        "143": "We first normalize the referential appropriateness scores in each top-10 list and then compute their sum.", 
        "144": "This aggregation scheme will give more weight to words that appear in the top 10 list of different models, and less weight to words that only get top-ranked by a single model.", 
        "145": "We test on the same data as in Section 5.1.", 
        "146": "Results Table 2 shows that all model combinations improve over the results of their isolated models in Table 1, suggesting that WAC, TRANSFER and SIM-WAP indeed do capture complementary aspects of referential word meaning.", 
        "147": "On their own, the distributionally informed models are less tuned to specific word occurrences than the visual word classifiers in the WAC model, but they can add useful information which leads to a clear overall improvement.", 
        "148": "We take this as a promising finding, supporting our initial hypothesis that knowledge on lexical distributional meaning should and\ncan be exploited when learning how to use words for reference.", 
        "149": "5.3 Analysis  Figure 2 illustrates objects from our test set where the combination of TRANSFER, SIM-WAP and WAC predicts an accurate name, whereas the models in isolation do not.", 
        "150": "These examples give some interesting insight into why the models capture different aspects of referential word meaning.", 
        "151": "Word Similarities Many of the examples in Figure 2 suggest that the object names ranked among the top 3 by the TRANSFER and SIMWAP model are semantically similar to each other, whereas WAC generates object names on top that describe very different underlying object categories, such as seal / rock in Figure 2(a), animal / lamp in Figure 2(g) or chair / shirt in Figure 2(c).", 
        "152": "To quantify this general impression, Table 3 shows cosine similarities among words in the top n generated by our models, using their word2vec embeddings.", 
        "153": "The average cosine similarity between words in our vocabulary is 0.17.", 
        "154": "The TRANSFER and SIM-WAP model rank words on top that are clearly more similar to each other than word pairs on average, whereas words ranked top by the WAC model are more dissimilar to each other.", 
        "155": "Another remarkable finding is that the words generated by TRANSFER and SIM-WAP are not only more similar among the top predictions, but also more similar to the gold name (Table 3 , right columns).", 
        "156": "This result is noteworthy since the accuracies for the top predictions shown in Table 1 are slightly below WAC.", 
        "157": "In general, this suggests that there is a trade-off between optimizing a model of referential word meaning to exact naming decisions, or tailoring it to make lexically consistent predictions.", 
        "158": "This parallels findings by Frome et al.", 
        "159": "(2013) who found that their transfer-based object recognition made “semantically more reasonable” errors than a standard convolutional network while\nnot improving accuracies for object recognition, see discussion in Section 2.", 
        "160": "Additional evaluation metrics, such as success rates in a human evaluation (cf.", 
        "161": "Zarrieß and Schlangen (2016)), would be an interesting direction for more detailed investigation here.", 
        "162": "Word Use But even though the WAC classifiers lack knowledge on lexical similarities, they seem to able to detect relatively specific instances of word use such as hut in Figure 2(b), shirt in 2(c) or lamp in 2(h).", 
        "163": "Here, the combination with TRANSFER and SIM-WAP is helpful to give more weight to the object name that is taxonomically correct (sometimes pushing up words below the top-3 and hence not shown in Figure 2).", 
        "164": "In Figure 1(e), SIMWAP and TRANSFER give more weight to typical names for persons, whereas WAC top-ranks more unusual names, reflecting that the person is difficult to identify visually.", 
        "165": "Another observation is that the mapping models have difficulties dealing with object names in singular and plural.", 
        "166": "As these words have very similar representations in the distributional space, they are often predicted as likely variants among the top 10 by SIM-WAP and TRANSFER, whereas the WAC model seems to predict inappropriate plural words less often among the top 3.", 
        "167": "Such specific phenomena at the intersection of visual and semantic similarity have found very little attention in the literature.", 
        "168": "We will investigate them further in our Experiments on zeroshot naming in the following Section.", 
        "169": "6 Zero-Shot Naming  Zero-shot learning is an attractive prospect for REG from images, as it promises to overcome dependence on pairings of visual instances and natural names being available for all names, if visual/referential data can be generalised from other types of information.", 
        "170": "Previous work has looked at the feasibility of zero-shot learning as a function of semantic similarity or ontological closeness between unknown and known categories, and confirmed the intuition that the task is harder the less close unknown categories are to known ones (Frome et al., 2013; Norouzi et al., 2013).", 
        "171": "Our experiments on object naming in Section 5 suggest that lexical similarities encoded in a distributional space might not always fully carry over to referential meaning.", 
        "172": "This could constitute an additional challenge for zero-shot learning, as distributional similarities might be misleading when\nthe model has to fully rely on them for learning referential word meanings.", 
        "173": "Therefore, the following experiments investigate the performance of our models in zero-shot naming as a function of the lexical relation between unknown and known object names, i.e.", 
        "174": "namely hypernyms and singular/plurals.", 
        "175": "Both relations are typically captured by distributional models of word meaning in terms of closeness in the vector space, but their visual and referential relation is clearly different.", 
        "176": "6.1 Vocabulary Splits and Testsets  Random As in previous work on zero-shot learning, we consider zero-shot naming for words of varying degrees of similarity.", 
        "177": "We randomly split our 159 names from Experiment 1 into 10 subsets.", 
        "178": "We train the models on 90% of the nouns (and all their visual instances in the image corpus) and test on the set of image regions that are named with words which the model did not observe during training.", 
        "179": "Results reported in Table 4 on the random test set correspond to averaged scores from cross-validation over the 10 splits.", 
        "180": "Hypernyms We manually split the model’s vocabulary into set of hypernyms (see Appendix A) and the remaining nouns.", 
        "181": "We train the models on those 84K image regions that where not named with a hypernym, and test on 8895 image regions that were named with a hypernym in the corpus.", 
        "182": "We checked that for each of these hypernyms, the vocabulary contains at least one or two names that can be considered as hyponyms, i.e.", 
        "183": "the model sees objects during training that are instances of vehicle for example, but never encounters actual uses of that name.", 
        "184": "This test set is particularly interesting from an REG perspective, as objects named with very general terms by human speakers are often difficult to describe with more common, but more specific terms, as is illustrated by the uses of structure and thingy in Figure 1.", 
        "185": "Singulars/Plurals We pick 68 words from our vocabulary that can be grouped into 34 singularplural noun pairs (see Appendix A).", 
        "186": "From each pair, we randomly include the singular or plural noun in the set of zero-shot nouns.", 
        "187": "Thus, we make sure that the model encounters singular and plural names during training, but it never encounters both variants of a name.", 
        "188": "This results training split of 23K image regions and a test split of 13825 instances.", 
        "189": "6.2 Evaluation  Some previous work on zero-shot image labeling assumes additional components that first identify whether an image should be labelled by a known or unknown word (Frome et al., 2013).", 
        "190": "We follow Lazaridou et al.", 
        "191": "(2014) and let the model decide whether to refer to an object by a known or unknown name.", 
        "192": "Related to that, distinct evaluation procedures have been used in the literature on zero-shot learning:\nTesting on full vocabulary A realistic way to test zero-shot learning performance is to consider all words from a given vocabulary during testing, though the testset only contains instances of objects that have been named with a ‘zero-shot word’ (for which no visual instances were seen during training).", 
        "193": "Accuracies in this setup reflect how well the model is able to generalize, i.e.", 
        "194": "how often it decides to deviate from the words it was trained on, and (implicitly) predicts that the given object requires a “new” name.", 
        "195": "In case of the (i) hypernym and (ii) singular/plural test set, this accuracy also reflects to what extent the model is able to detect cases where (i) a more general or vague term is needed, where (ii) an unknown singular/plural counterpart of a known object type occurs.", 
        "196": "Testing on disjoint vocabulary Alternatively, the model’s vocabulary can be restricted during testing to zero-shot words only, such that names encountered during training and testing are disjoint, see e.g.", 
        "197": "(Lampert et al., 2009, 2013).", 
        "198": "This setup factors out the generalization problem, and assesses to what extent a model is able to capture the referential meaning of a word that does not have instances in the training data.", 
        "199": "6.3 Results  As compared to Experiment 1 where models achieved similar performance, differences are more pronounced in the zero-shot setup, as shown in Table 4.", 
        "200": "In particular, we find that the SIMWAP model which induces individual predictors for words that have not been observed in the training data is clearly more successful than TRANSFER or WAC that project predictions into the distributional space.", 
        "201": "When tested on the full vocabulary, we find that TRANSFER and WAC very rarely generate names whose referents were excluded from training, which is in line with observations made by Lazaridou et al.", 
        "202": "(2015a).", 
        "203": "The SIM-WAP\npredictors generalize much better, in particular on the singular/plural testset.", 
        "204": "An interesting exception is the good performance of the TRANSFER model on the hypernym test set, when evaluated with a disjoint vocabulary.", 
        "205": "This corroborates evidence from Experiment 1, namely that the transfer model captures taxonomic aspects of object names better than the other models.", 
        "206": "Projection via individual word classifiers, on the other hand, seems to generalize better than TRANSFER, at least when looking at accuracies @2 ... @10.", 
        "207": "Thus, combining several vectors predicted by a model of referential word meaning can provide additional information, as compared to mapping an object to a single vector in distributional space.", 
        "208": "More work is needed to establish how these approaches can be integrated more effectively.", 
        "209": "7 Discussion and Conclusion  In this paper, we have investigated models of referential word meaning, using different ways of combining visual information about a word’s referent and distributional knowledge about its lexical similarities.", 
        "210": "Previous cross-modal mapping models essentially force semantically similar objects to be mapped into the same area in the semantic space regardless of their actual visual similarity.", 
        "211": "We found that cross-modal mapping produces semantically appropriate and mutually highly similar object names in its top-n list, but does not preserve differences in referential word use (e.g.", 
        "212": "appropriatness of person vs. woman) especially within the same semantic field.", 
        "213": "We have shown that it is beneficial for performance in standard and zeroshot object naming to treat words as individual predictors that capture referential appropriateness and are only indirectly linked to a distributional space, either through lexical mapping during application or through cross-modal similarity mapping during training.", 
        "214": "As we have tested these approaches on a rather small vocabulary, which may limit generality of conclusions, future work will be devoted to scaling up these findings to larger test sets, as e.g.", 
        "215": "recently collected through conversational agents (Das et al., 2016) that circumvent the need for human-human interaction data.", 
        "216": "Also from an REG perspective, various extensions of this approach are possible, such as the inclusion of contextual information during object naming and its combination with attribute selection.", 
        "217": "Acknowledgments  We acknowledge support by the Cluster of Excellence “Cognitive Interaction Technology” (CITEC; EXC 277) at Bielefeld University, which is funded by the German Research Foundation (DFG).", 
        "218": "We thank the anonymous reviewers for their very valuable, very detailed and highly interesting comments."
    }, 
    "document_id": "P17-1023.pdf.json"
}
