{
    "abstract_sentences": {
        "1": "Argumentation quality is viewed differently in argumentation theory and in practical assessment approaches.", 
        "2": "This paper studies to what extent the views match empirically.", 
        "3": "We find that most observations on quality phrased spontaneously are in fact adequately represented by theory.", 
        "4": "Even more, relative comparisons of arguments in practice correlate with absolute quality ratings based on theory.", 
        "5": "Our results clarify how the two views can learn from each other."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 250–255 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2039  1 Introduction  The assessment of argumentation quality is critical for any application built upon argument mining, such as debating technologies (Rinott et al., 2015).", 
        "2": "However, research still disagrees on whether quality should be assessed from a theoretical or from a practical viewpoint (Allwood, 2016).", 
        "3": "Theory states, among other things, that a cogent argument has acceptable premises that are relevant to its conclusion and sufficient to draw the conclusion (Johnson and Blair, 2006).", 
        "4": "Practitioners object that such quality dimensions are hard to assess for real-life arguments (Habernal and Gurevych, 2016b).", 
        "5": "Moreover, the normative nature of theory suggests absolute quality ratings, but in practice it seems much easier to state which argument is more convincing—a relative assessment.", 
        "6": "Consider two debate-portal arguments for “advancing the common good is better than personal pursuit”, taken from the corpora analyzed later in this paper: Argument A “While striving to make advancements for the common good you can change the world forever.", 
        "7": "Allot of people have succeded in doing so.", 
        "8": "Our founding fathers, Thomas Edison, George Washington, Martin Luther King jr, and many more.", 
        "9": "These people made huge advances for the common good and they are honored for it.”\nArgument B “I think the common good is a better endeavor, because it’s better to give then to receive.", 
        "10": "It’s better to give other people you’re hand out in help then you holding your own hand.”\nIn the study of Habernal and Gurevych (2016b), annotators assessed Argument A as more convincing than B.", 
        "11": "When giving reasons for their assessment, though, they saw A as more credible and well thought through; that does not seem to be too far from the theoretical notion of cogency.", 
        "12": "This paper gives empirical answers to the question of how different the theoretical and practical views of argumentation quality actually are.", 
        "13": "Section 2 briefly reviews existing theories and practical approaches.", 
        "14": "Section 3 then empirically analyzes correlations in two recent argument corpora, one annotated for 15 well-defined quality dimensions taken from theory (Wachsmuth et al., 2017a) and one with 17 reasons for quality differences phrased spontaneously in practice (Habernal and Gurevych, 2016a).", 
        "15": "In a crowdsourcing study, we test whether lay annotators achieve agreement on the theoretical quality dimensions (Section 4).", 
        "16": "We find that assessments of overall argumentation quality largely match in theory and practice.", 
        "17": "Nearly all phrased reasons are adequately represented in theory.", 
        "18": "However, some theoretical quality dimensions seem hard to separate in practice.", 
        "19": "Most importantly, we provide evidence that the observed relative quality differences are reflected in absolute quality ratings.", 
        "20": "Still, our study underpins the fact that the theory-based argumentation quality assessment remains complex.", 
        "21": "Our results do not generally answer the question of what view of argumentation quality is preferable, but they clarify where theory can learn from practice and vice versa.", 
        "22": "In particular, practical approaches indicate what to focus on to simplify theory, whereas theory seems beneficial to guide quality assessment in practice.", 
        "23": "250\nQuality Dimension Short Description of Dimension  2 Theory versus Practice  This section outlines major theories and practical approaches to argumentation quality assessment, including those we compare in the present paper.", 
        "24": "2.1 Theoretical Views of Quality Assessment  Argumentation theory discusses logical, rhetorical, and dialectical quality.", 
        "25": "As few real-life arguments are logically sound, requiring true premises that deductively entail a conclusion, cogency (as defined in Section 1) is largely seen as the main logical quality (Johnson and Blair, 2006; Damer, 2009; Govier, 2010).", 
        "26": "Toulmin (1958) models the general structure of logical arguments, and Walton et al.", 
        "27": "(2008) analyze schemes of fallacies and strong arguments.", 
        "28": "A fallacy is a kind of error that undermines reasoning (Tindale, 2007).", 
        "29": "Strength may mean cogency but also rhetorical effectiveness (Perelman and Olbrechts-Tyteca, 1969).", 
        "30": "Rhetoric has been studied since Aristotle (2007) who developed the notion of the means of persuasion (logos, ethos, pathos) and their linguistic delivery in terms of arrangement and style.", 
        "31": "Dialectical quality dimensions resemble those of cogency, but arguments are judged specifically by their reasonableness for achieving agreement (van Eemeren and Grootendorst, 2004).", 
        "32": "Wachsmuth et al.", 
        "33": "(2017a) point out that dialectical builds on rhetorical, and rhetorical builds on logical quality.", 
        "34": "They derive a unifying taxonomy from the major theories, decomposing quality hierarchically into cogency, effectiveness, reasonableness, and subdimensions.", 
        "35": "Table 1 lists all 15 dimensions\ncovered.", 
        "36": "In Section 3, we use their absolute quality ratings from 1 (low) to 3 (high) annotated by three experts for each dimension of 304 arguments taken from the UKPConvArg1 corpus detailed below.", 
        "37": "2.2 Practical Views of Quality Assessment  There is an application area where absolute quality ratings of argumentative text are common practice: essay scoring (Beigman Klebanov et al., 2016).", 
        "38": "Persing and Ng (2015) annotated the argumentative strength of essays composing multiple arguments with notable agreement.", 
        "39": "For single arguments, however, all existing approaches that we are aware of assess quality in relative terms, e.g., Cabrio and Villata (2012) find accepted arguments based on attack relations, Wei et al.", 
        "40": "(2016) rank arguments by their persuasiveness, and Wachsmuth et al.", 
        "41": "(2017b) rank them by their relevance.", 
        "42": "Boudry et al.", 
        "43": "(2015) argue that normative concepts such as fallacies rarely apply to real-life arguments and that they are too sophisticated for operationalization.", 
        "44": "Based on the idea that relative assessment is easier, Habernal and Gurevych (2016b) crowdsourced the UKPConvArg1 corpus.", 
        "45": "Argument pairs (A, B) from a debate portal were classified as to which argument is more convincing.", 
        "46": "Without giving any guidelines, the authors also asked for reasons as to why A is more convincing than B.", 
        "47": "In a follow-up study (Habernal and Gurevych, 2016a), these reasons were used to derive a hierarchical annotation scheme.", 
        "48": "9111 argument pairs were then labeled with one or more of the 17 reason labels in Table 2\nNegative Properties of Argument B Positive Properties of Argument A\nQuality Dimension 5-1 5-2 5-3 6-1 6-2 6-3 7-1 7-2 7-3 7-4 8-1 8-4 8-5 9-1 9-2 9-3 9-4 Conv\nby crowd workers (UKPConvArg2).", 
        "49": "These pairs represent the practical view in our experiments.", 
        "50": "3 Matching Theory and Practice  We now report on experiments that we performed to examine to what extent the theory and practice of argumentation quality assessment match.1  3.1 Corpus-based Comparison of the Views  Several dimensions and reasons in Tables 1 and 2 seem to refer to the same or opposite property, e.g., clarity and 5-3 (unclear).", 
        "51": "This raises the question of how absolute ratings of arguments based on theory relate to relative comparisons of argument pairs in practice.", 
        "52": "We informally state three hypotheses:\nHypothesis 1 The reasons for quality differences in practice are adequately represented in theory.", 
        "53": "Hypothesis 2 The perception of overall argumentation quality is the same in theory and practice.", 
        "54": "Hypothesis 3 Relative quality differences are reflected by differences in absolute quality ratings.", 
        "55": "As both corpora described in Section 2 are based on the UKPConvArg1 corpus and thus share many arguments, we can test the hypotheses empirically.", 
        "56": "3.2 Correlations of Dimensions and Reasons  For Hypotheses 1 and 2, we consider all 736 pairs of arguments from Habernal and Gurevych (2016a) where both have been annotated by Wachsmuth et al.", 
        "57": "(2017a).", 
        "58": "For each pair (A, B) with A being\n1Source code and annotated data: http://www.arguana.com\nmore convincing than B, we check whether the ratings of A and B for each dimension (averaged over all annotators) show a concordant difference (i.e., a higher rating for A), a disconcordant difference (lower), or a tie.", 
        "59": "This way, we can correlate each dimension with all reason labels in Table 2 including Conv.", 
        "60": "In particular, we compute Kendall’s τ based on all argument pairs given for each label.2\nTable 3 presents all τ -values.", 
        "61": "The phrasing of a reason can be assumed to indicate a clear quality difference—this is underlined by the generally high correlations.", 
        "62": "Analyzing the single values, we find much evidence for Hypothesis 1: Most notably, label 5-1 perfectly correlates with global acceptability, fitting the intuition that abuse is not acceptable.", 
        "63": "The high τ ’s of 8-5 (more credible) for local acceptability (.73) and of 9-4 (well thought through) for cogency (.75) confirm the match assumed in Section 1.", 
        "64": "Also, the values of 5-3 (unclear) for clarity (.91) and of 7-2 (non-sense) for reasonableness (.94) as well as the weaker correlation of 8-4 (objective) for emotional appeal (.35) makes sense.", 
        "65": "Only the comparably low τ of 6-1 (no credible evidence) for local acceptability (.49) and credibility (.52) seem really unexpected.", 
        "66": "Besides, the descriptions of 6-2 and 6-3 sound like local but cor-\n2Lacking better options, we ignore pairs where a label is not given: It is indistinguishable whether the associated reason does not hold, has not been given, or is just not included in the corpus.", 
        "67": "Thus, τ is more “boosted” the fewer pairs exist for a label and, thus, its values are not fully comparable across labels.", 
        "68": "Notice, though, that Conv exists for all pairs.", 
        "69": "So, the values of Conv suggest the magnitude of τ without boosting.", 
        "70": "relate more with global relevance and sufficiency respectively.", 
        "71": "Similarly, 7-3 (off-topic) correlates strongly with local and global relevance (both .95).", 
        "72": "So, these dimensions seem hard to separate.", 
        "73": "In line with Hypothesis 2, the highest correlation of Conv is indeed given for overall quality (.64).", 
        "74": "Thus, argumentation quality assessment seems to match in theory and practice to a broad extent.", 
        "75": "3.3 Absolute Ratings for Relative Differences  The correlations found imply that the relative quality differences captured are reflected in absolute differences.", 
        "76": "For explicitness, we computed the mean rating for each quality dimension of all arguments from Wachsmuth et al.", 
        "77": "(2017a) with a particular reason label from Habernal and Gurevych (2016a).", 
        "78": "As each reason refers to one argument of a pair, this reveals whether the labels, although meant to signal relative differences, indicate absolute ratings.", 
        "79": "Table 4 compares the mean ratings of “negative labels” (5-1 to 7-4) and “positive” ones (8-1 to 9-4).", 
        "80": "For all dimensions, the maximum and minimum value are higher for the positive than for the negative labels—a clear support of Hypothesis 3.3 Also, Table 4 reveals which reasons predict absolute differences most: The mean ratings of 7-3 (off-topic) are very low, indicating a strong negative impact, while 6-3 (irrelevant reasons) still shows rather\n3While the differences seem not very large, this is expected, as in many argument pairs from Habernal and Gurevych (2016a) both arguments are strong or weak respectively.", 
        "81": "high values.", 
        "82": "Vice versa, especially 8-5 (more credible) and 9-4 (well thought through) are reflected in high ratings, whereas 9-2 (sticks to topic) does not have much positive impact.", 
        "83": "4 Annotating Theory in Practice  The results of Section 3 suggest that theory may guide the assessment of argumentation quality in practice.", 
        "84": "In this section, we evaluate the reliability of a crowd-based annotation process.", 
        "85": "4.1 Absolute Quality Ratings by the Crowd  We emulated the expert annotation process carried out by Wachsmuth et al.", 
        "86": "(2017a) on CrowdFlower in order to evaluate whether lay annotators suffice for a theory-based quality assessment.", 
        "87": "In particular, we asked the crowd to rate the same 304 arguments as the experts for all 15 given quality dimensions with scores from 1 to 3 (or choose “cannot judge”).", 
        "88": "Each argument was rated 10 times at an offered price of $0.10 for each rating (102 annotators in total).", 
        "89": "Given the crowd ratings, we then performed two comparisons as detailed in the following.", 
        "90": "4.2 Agreement of the Crowd with Experts  First, we checked to what extent lay annotators and experts agree in terms of Krippendorff’s α.", 
        "91": "On one hand, we compared the mean of all 10 crowd ratings to the mean of the three ratings of Wachsmuth et al.", 
        "92": "(2017a).", 
        "93": "On the other hand, we estimated a reliable rating from the crowd ratings using MACE (Hovy et al., 2013) and compared it to the experts.", 
        "94": "Table 5(a) presents the results.", 
        "95": "For the mean ratings, most α-values are above .40.", 
        "96": "This is similar to the study of Wachsmuth et al.", 
        "97": "(2017b), where a range of .27 to .51 is reported, meaning that lay annotators achieve similar agreement to experts.", 
        "98": "Considering the minimum of mean and MACE, we observe the highest agreement for overall quality (.43)—analog to Wachsmuth et al.", 
        "99": "(2017b).", 
        "100": "Also, global sufficiency has the lowest agreement in both cases.", 
        "101": "In contrast, the experts hardly said “cannot judge” at all, whereas the crowd chose it for about 4% of all ratings (most often for global sufficiency), possibly due to a lack of training.", 
        "102": "Still, we conclude that the crowd generally handles the theory-based quality assessment almost as well as the experts.", 
        "103": "However, the complexity of the assessment is underlined by the generally limited agreement, suggesting that either simplification or stricter guidelines are needed.", 
        "104": "Regarding simplification, the most common practical reasons of Habernal and Gurevych (2016a) imply what to focus on.", 
        "105": "4.3 Reliability of the Crowd Annotations  In the second comparison, we checked how many crowd annotators are needed to compete with the experts.", 
        "106": "For this purpose, we split the crowd ratings into two independent groups of 5 and treated the mean and MACE of each group as a single rating.", 
        "107": "We then computed the agreement of both groups and each group individually against the experts.", 
        "108": "The α-values for both groups are listed in Table 5(b).", 
        "109": "On average, they are a bit lower than those of all 10 crowd annotators in Table 5(a).", 
        "110": "Hence, five crowd ratings per argument seem not enough\nfor sufficient reliability.", 
        "111": "Tables 5(c) and 5(d) reveal the reason behind, namely, the results of crowd group 1 and group 2 differ clearly.", 
        "112": "At the same time, the values in Table 5(c) are close to those in Table 5(a), so 10 ratings might suffice.", 
        "113": "Moreover, we see that the most stable α-values in Table 5 are given for overall quality, indicating that the theory indeed helps assessing quality reliably.", 
        "114": "5 Conclusion  This paper demonstrates that the theory and practice of assessing argumentation quality can learn from each other.", 
        "115": "Most reasons for quality differences phrased in practice seem well-represented in the normative view of theory and correlate with absolute quality ratings.", 
        "116": "In our study, lay annotators had similar agreement on the ratings as experts.", 
        "117": "Considering that some common reasons are quite vague, the diverse and comprehensive theoretical view of argumentation quality may guide a more insightful assessment.", 
        "118": "On the other hand, some quality dimensions remain hard to assess and/or to separate in practice, resulting in limited agreement.", 
        "119": "Simplifying theory along the most important reasons will thus improve its practical applicability.", 
        "120": "Acknowledgments  We thank Vinodkumar Prabhakaran and Yonatan Bilu for their ongoing participation in our research on argumentation quality.", 
        "121": "Also, we acknowledge financial support of the DFG (ArguAna, AIPHES), the Natural Sciences and Engineering Research Council of Canada, and the Volkswagen Foundation (Lichtenberg-Professorship Program)."
    }, 
    "document_id": "P17-2039.pdf.json"
}
