{
    "abstract_sentences": {
        "1": "Bandit structured prediction describes a stochastic optimization framework where learning is performed from partial feedback.", 
        "2": "This feedback is received in the form of a task loss evaluation to a predicted output structure, without having access to gold standard structures.", 
        "3": "We advance this framework by lifting linear bandit learning to neural sequence-to-sequence learning problems using attention-based recurrent neural networks.", 
        "4": "Furthermore, we show how to incorporate control variates into our learning algorithms for variance reduction and improved generalization.", 
        "5": "We present an evaluation on a neural machine translation task that shows improvements of up to 5.89 BLEU points for domain adaptation from simulated bandit feedback."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1503–1513 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1138  1 Introduction  Many NLP tasks involve learning to predict a structured output such as a sequence, a tree or a graph.", 
        "2": "Sequence-to-sequence learning with neural networks has recently become a popular approach that allows tackling structured prediction as a mapping problem between variable-length sequences, e.g., from foreign language sentences into target-language sentences (Sutskever et al., 2014), or from natural language input sentences into linearized versions of syntactic (Vinyals et al., 2015) or semantic parses (Jia and Liang, 2016).", 
        "3": "A known bottleneck in structured prediction is the requirement of large amounts of gold-standard structures for supervised learning of model parameters, especially for data-hungry neural network models.", 
        "4": "Sokolov et al.", 
        "5": "(2016a,b) presented a framework for stochastic structured prediction under bandit feedback that alleviates the need for\nlabeled output structures in learning: Following an online learning protocol, on each iteration the learner receives an input, predicts an output structure, and receives partial feedback in form of a task loss evaluation of the predicted structure.1 They “banditize” several objective functions for linear structured predictions, and evaluate the resulting algorithms with simulated bandit feedback on various NLP tasks.", 
        "6": "We show how to lift linear structured prediction under bandit feedback to non-linear models for sequence-to-sequence learning with attentionbased recurrent neural networks (Bahdanau et al., 2015).", 
        "7": "Our framework is applicable to sequenceto-sequence learning from various types of weak feedback.", 
        "8": "For example, extracting learning signals from the execution of structured outputs against databases has been established in the communities of semantic parsing and grounded language learning since more than a decade (Zettlemoyer and Collins, 2005; Clarke et al., 2010; Liang et al., 2011).", 
        "9": "Our work can build the basis for neural semantic parsing from weak feedback.", 
        "10": "In this paper, we focus on the application of machine translation via neural sequence-to-sequence learning.", 
        "11": "The standard procedure of training neural machine translation (NMT) models is to compare their output to human-generated translations and to infer model updates from this comparison.", 
        "12": "However, the creation of reference translations or post-edits requires professional expertise of users.", 
        "13": "Our framework allows NMT models to learn from feedback that is weaker than human references or post-edits.", 
        "14": "One could imagine a scenario of personalized machine translation where translations have to be adapted to the user’s specific purpose and domain.", 
        "15": "The feedback required by our methods can be provided by laymen users or can even\n1The name “bandit feedback” is inherited from the problem of maximizing the reward for a sequence of pulls of arms of so-called “one-armed bandit” slot machines.", 
        "16": "1503\nbe implicit, e.g., inferred from user interactions with the translated content on a web page.", 
        "17": "Starting from the work of Sokolov et al.", 
        "18": "(2016a,b), we lift their objectives to neural sequence-to-sequence learning.", 
        "19": "We evaluate the resulting algorithms on the task of French-toEnglish translation domain adaptation where a seed model trained on Europarl data is adapted to the NewsCommentary and the TED talks domain with simulated weak feedback.", 
        "20": "By learning from this feedback, we find 4.08 BLEU points improvements on NewsCommentary, and 5.89 BLEU points improvement on TED.", 
        "21": "Furthermore, we show how control variates can be integrated in our algorithms, yielding faster learning and improved generalization in our experiments.", 
        "22": "2 Related Work  NMT models are most commonly trained under a word-level maximum likelihood objective.", 
        "23": "Even though this objective has successfully been applied to many sequence-to-sequence learning tasks, the resulting models suffer from exposure bias, since they learn to generate output words based on the history of given reference words, not on their own predictions.", 
        "24": "Ranzato et al.", 
        "25": "(2016) apply techniques from reinforcement learning (Sutton and Barto, 1998; Sutton et al., 2000) and imitation learning (Schaal, 1999; Ross et al., 2011; Daumé et al., 2009) to learn from feedback to the model’s own predictions.", 
        "26": "Furthermore, they address the mismatch between word-level loss and sequence-level evaluation metric by using a mixture of the REINFORCE (Williams, 1992) algorithm and the standard maximum likelihood training to directly optimize a sequence-level loss.", 
        "27": "Similarly, Shen et al.", 
        "28": "(2016) lift minimum risk training (Och, 2003; Smith and Eisner, 2006; Gimpel and Smith, 2010; Yuille and He, 2012; He and Deng, 2012) from linear models for machine translation to NMT.", 
        "29": "These works are closely related to ours in that they use the technique of score function gradient estimators (Fu, 2006; Schulman et al., 2015) for stochastic learning.", 
        "30": "However, the learning environment of Shen et al.", 
        "31": "(2016) is different from ours in that they approximate the true gradient of the risk objective in a full information setting by sampling a subset of translations and computing the expectation over their rewards.", 
        "32": "In our bandit setting, feedback to only a single sample per sentence is available, making the learning\nproblem much harder.", 
        "33": "The approach by Ranzato et al.", 
        "34": "(2016) approximates the expectation with single samples, but still requires reference translations which are unavailable in the bandit setting.", 
        "35": "To our knowledge, the only work on training NMT from weak feedback is the work by He et al.", 
        "36": "(2016).", 
        "37": "They propose a dual-learning mechanism where two translation models are jointly trained on monolingual data.", 
        "38": "The feedback in this case is a reward signal from language models and a reconstruction error.", 
        "39": "This is attractive because the feedback can automatically be generated from monolingual data and does not require any human references.", 
        "40": "However, we are interested in using estimates of human feedback on translation quality to directly adapt the model to the users’ needs.", 
        "41": "Our approach follows most closely the work of Sokolov et al.", 
        "42": "(2016a,b).", 
        "43": "They introduce bandit learning objectives for structured prediction and apply them to various NLP tasks, including machine translation with linear models.", 
        "44": "Their approach can be seen as an instantiation of reinforcement learning to one-state Markov decision processes under linear policy models.", 
        "45": "In this paper, we transfer their algorithms to nonlinear sequence-to-sequence learning.", 
        "46": "Sokolov et al.", 
        "47": "(2016a) showed applications of linear bandit learning to tasks such as multiclass-classification, OCR, and chunking, where learning can be done from scratch.", 
        "48": "We focus on lifting their linear machine translation experiments to the more complex NMT that requires a warm start for training.", 
        "49": "This is done by training a seed model on one domain and adapting it to a new domain based on bandit feedback only.", 
        "50": "For this task we build on the work of Freitag and Al-Onaizan (2016), who investigate strategies to find the best of both worlds: models that adapt well to the new domain without deteriorating on the old domain.", 
        "51": "In contrast to previous approaches to domain adaptation for NMT, we do not require in-domain parallel data, but consult direct feedback to the translations generated for the new domain.", 
        "52": "3 Neural Machine Translation  Neural models for machine translation are based on a sequence-to-sequence learning architecture consisting of an encoder and a decoder (Cho et al., 2014; Sutskever et al., 2014; Bahdanau et al., 2015).", 
        "53": "An encoder Recurrent Neural Network (RNN) reads in the source sentence and a decoder\nRNN generates the target sentence conditioned on the encoded source.", 
        "54": "The input to the encoder is a sequence of vectors x = (x1, .", 
        "55": ".", 
        "56": ".", 
        "57": ", xTx) representing a sequence of source words of length Tx.", 
        "58": "In the approach of Sutskever et al.", 
        "59": "(2014), they are encoded into a single vector c = q({h1, .", 
        "60": ".", 
        "61": ".", 
        "62": ", hTx}), where ht = f(xt, ht−1) is the hidden state of the RNN at time t. Several choices are possible for the non-linear functions f and q: Here we are using a Gated Recurrent Unit (GRU) (Chung et al., 2014) for f , and for q an attention mechanism that defines the context vector as a weighted sum over encoder hidden states (Bahdanau et al., 2015; Luong et al., 2015a).", 
        "63": "The decoder RNN predicts the next target word yt at time t given the context vector c and the previous target words y<t = {y1, .", 
        "64": ".", 
        "65": ".", 
        "66": ", yt−1} from a probability distribution over the target vocabulary V .", 
        "67": "This distribution is the result of a softmax transformation of the decoder outputs o = {o1, .", 
        "68": ".", 
        "69": ".", 
        "70": ", oTy}, such that\npθ(yt = wi|y<t, c) = exp(owi)∑V v=1 exp(owv) .", 
        "71": "The probability of a full sequence of outputs y = (y1, .", 
        "72": ".", 
        "73": ".", 
        "74": ", yTy) of length Ty is defined as the product of the conditional word probabilities:\npθ(y|x) = Ty∏\nt=1\npθ(yt|y<t, c).", 
        "75": "Since this encoder-decoder architecture is fully differentiable, it can be trained with gradient descent methods.", 
        "76": "Given a parallel training set of S source sentences and their reference translations D = {(x(s),y(s))}Ss=1, we can define a wordlevel Maximum Likelihood Estimation (MLE) objective, which aims to find the parameters\nθ̂MLE = arg max θ LMLE(θ)\nof the following loss function:\nLMLE(θ) =\nS∑\ns=1\nlog pθ(y (s)|x(s))\n=\nS∑\ns=1\nTy∑\nt=1\nlog pθ(yt|x(s),y(s)<t ).", 
        "77": "This loss function is non-convex for the case of neural networks.", 
        "78": "Clever initialization strategies,\nAlgorithm 1 Neural Bandit Structured Prediction Input: Sequence of learning rates γk Output: Optimal parameters θ̂\n1: Initialize θ0 2: for k = 0, .", 
        "79": ".", 
        "80": ".", 
        "81": ",K do 3: Observe xk 4: Sample ỹk ∼ pθ(y|xk) 5: Obtain feedback ∆(ỹk) 6: θk+1 = θk − γk sk 7: Choose a solution θ̂ from the list {θ0, .", 
        "82": ".", 
        "83": ".", 
        "84": ", θK}\nadaptive learning rates and momentum techniques are required to find good local maxima and to speed up convergence (Sutskever et al., 2013).", 
        "85": "Another trick of the trade is to ensemble several models with different random initializations to improve over single models (Luong et al., 2015a).", 
        "86": "At test time, we face a search problem to find the sequence of target words with the highest probability.", 
        "87": "Beam search reduces the search error in comparison to greedy search, but also exponentially increases decoding time.", 
        "88": "4 Neural Bandit Structured Prediction  Algorithm 1 is an adaptation of the Bandit Structured Prediction algorithm of Sokolov et al.", 
        "89": "(2016b) to neural models: For K rounds, a model with parameters θ receives an input, samples an output structure, and receives user feedback.", 
        "90": "Based on this feedback, a stochastic gradient sk is computed and the model parameters are updated.", 
        "91": "As a post-optimization step, a solution θ̂ is selected from the iterates.", 
        "92": "This is done with onlineto-batch conversion by choosing the model with optimal performance on held-out data.", 
        "93": "The core of the algorithm is the sampling: if the model distribution is very peaked, the model exploits, i.e., it presents the most probable outputs to the user.", 
        "94": "If the distribution is close to uniform, the model explores, i.e., it presents random outputs to the user.", 
        "95": "The balance between exploitation and exploration is crucial to the learning process: in the beginning the model is rather uninformed and needs to explore in order to find outputs with high reward, while in the end it ideally converges towards a peaked distribution that exactly fits the user’s needs.", 
        "96": "Pre-training the model, i.e.", 
        "97": "setting θ0 wisely, ensures a reasonable exploitationexploration trade-off.", 
        "98": "This online learning algorithm can be applied\nto any objective L provided the stochastic gradients sk are unbiased estimators of the true gradient of the objective, i.e., we require ∇L = E[sk].", 
        "99": "In the following, we will present objectives from Sokolov et al.", 
        "100": "(2016b) transferred to neural models, and explain how they can be enhanced by control variates.", 
        "101": "4.1 Expected Loss (EL) Minimization  The first objective is defined as the expectation of a task loss ∆(ỹ), e.g.", 
        "102": "−BLEU(ỹ), over all input and output structures:\nLEL(θ) =Ep(x) pθ(ỹ|x) [∆(ỹ)] .", 
        "103": "(1)\nIn the case of full-information learning where reference outputs are available, we could evaluate all possible outputs against the reference to obtain an exact estimation of the loss function.", 
        "104": "However, this is not feasible in our setting since we only receive partial feedback for a single output structure per input.", 
        "105": "Instead, we use stochastic approximation to optimize this loss.", 
        "106": "The stochastic gradient for this objective is computed as follows:\nsELk =∆(ỹ) ∂ log pθ(ỹ|xk)\n∂θ .", 
        "107": "(2)\nObjective (1) is known from minimum risk training (Och, 2003) and has been lifted to NMT by Shen et al.", 
        "108": "(2016) – but not for learning from weak feedback.", 
        "109": "Equation (2) is an instance of the score function gradient estimator (Fu, 2006) where\n∇ log pθ(ỹ|xk) (3)\ndenotes the score function.", 
        "110": "We give an algorithm to sample structures from an encoder-decoder model in Algorithm 2.", 
        "111": "It corresponds to the algorithm presented by Shen et al.", 
        "112": "(2016) with the difference that it samples single structures, does not assume a reference structure, and additionally returns the sample probabilities.", 
        "113": "A similar objective has also been used in the REINFORCE algorithm (Williams, 1992) which has been adapted to NMT by Ranzato et al.", 
        "114": "(2016).", 
        "115": "4.2 Pairwise Preference Ranking (PR)  The previous objective requires numerical feedback as an estimate of translation quality.", 
        "116": "Alternatively, we can learn from pairwise preference judgments that are formalized in preference ranking objectives.", 
        "117": "Let P(x) = {〈yi,yj〉 |yi,yj ∈ Y(x)} denote the set of output pairs for an input x, and\nlet ∆(〈yi,yj〉) : P(x) → [0, 1] denote a task loss function that specifies a dispreference of yi over yj .", 
        "118": "In our experimental simulations we use two types of pairwise feedback.", 
        "119": "Firstly, continuous pairwise feedback2 is computed as\n∆(〈yi,yj〉) = ∆(yj)−∆(yi),\nand secondly, binary feedback is computed as\n∆(〈yi,yj〉) = {\n1 if ∆(yj) > ∆(yi), 0 otherwise.", 
        "120": "Analogously to the sequence-level sampling for linear models (Sokolov et al., 2016b), we define the following probabilities for word-level sampling:\np+θ (ỹt = wi|x, ŷ<t) = exp(owi)∑V v=1 exp(owv) , p−θ (ỹt = wj |x, ŷ<t) = exp(−owj )∑V v=1 exp(−owv) .", 
        "121": "The effect of the negation within the softmax is that the two distributions p+θ and p − θ rank the next candidate target words ỹt (given the same history, here the greedy output ŷ<t) in opposite order.", 
        "122": "Globally normalized models as in the linear case, or LSTM-CRFs (Huang et al., 2015) for the non-linear case would allow sampling full structures such that the ranking over full structures is reversed.", 
        "123": "But in the case of locally normalized RNNs we retrieve only locally reversed-rank samples.", 
        "124": "Since we want the model to learn to rank ỹi over ỹj , we would have to sample ỹi word-byword from p+θ and ỹj from p − θ .", 
        "125": "However, sampling all words of ỹj from p−θ leads to translations that are neither fluent nor source-related, so we propose to randomly choose one position of ỹj where the next word is sampled from p−θ and sample the remaining words from p+θ .", 
        "126": "We found that this method produces suitable negative samples, which are only slightly perturbed and still relatively fluent and source-related.", 
        "127": "A detailed algorithm is given in Algorithm 3.", 
        "128": "In the same manner as for linear models, we define the probability of a pair of sequences as\npθ(〈ỹi, ỹj〉 |x) = p+θ (ỹi|x)× p−θ (ỹj |x).", 
        "129": "2Note that our definition of continuous feedback is slightly different from the one proposed in Sokolov et al.", 
        "130": "(2016b) where updates are only made for misrankings.", 
        "131": "Algorithm 2 Sampling Structures Input: Model θ, target sequence length limit Ty Output: Sequence of words w = (w1, .", 
        "132": ".", 
        "133": ".", 
        "134": ", wT y)\nand log-probability p 1: w0 = START, p0 = 0 2: w = (w0) 3: for t← 1 .", 
        "135": ".", 
        "136": ".", 
        "137": "Ty do 4: wt ∼ pθ(w|x,w<t) 5: pt = pt−1 + log pθ(w|x,w<t) 6: w = (w1, .", 
        "138": ".", 
        "139": ".", 
        "140": ", wt−1, wt) 7: end for 8: Return w and pT\nNote that with the word-based sampling scheme described above, the sequence ỹj also includes words sampled from p+θ .", 
        "141": "The pairwise preference ranking objective expresses an expectation over losses over these pairs:\nLPR(θ) =Ep(x) pθ(〈ỹi,ỹj〉|x) [∆(〈ỹi, ỹj〉)] .", 
        "142": "(4)\nThe stochastic gradient for this objective is\nsPRk =∆(〈ỹi, ỹj〉) (5)\n× ( ∂ log p+θ (ỹi|xk)\n∂θ + ∂ log p−θ (ỹj |xk) ∂θ\n) .", 
        "143": "This training procedure resembles well-known approaches for noise contrastive estimation (Gutmann and Hyvärinen, 2010) with negative sampling that are commonly used for neural language modeling (Collobert et al., 2011; Mnih and Teh, 2012; Mikolov et al., 2013).", 
        "144": "In these approaches, negative samples are drawn from a non-parametric noise distribution, whereas we draw them from the perturbed model distribution.", 
        "145": "4.3 Control Variates  The stochastic gradients defined in equations (2) and (5) can be used in stochastic gradient descent optimization (Bottou et al., 2016) where the full gradient is approximated using a minibatch or a single example in each update.", 
        "146": "The stochastic choice, in our case on inputs and outputs, introduces noise that leads to slower convergence and degrades performance.", 
        "147": "In the following, we explain how antithetic and additive control variate techniques from Monte Carlo simulation (Ross, 2013) can be used to remedy these problems.", 
        "148": "The idea of additive control variates is to augment a random variable X whose expectation is\nAlgorithm 3 Sampling Pairs of Structures Input: Model θ, target sequence length limit Ty Output: Pair of sequences 〈w,w′〉 and their log-\nprobability p 1: p0 = 0 2: w,w′, ŵ = (START) 3: i ∼ U(1, T ) 4: for t← 1 .", 
        "149": ".", 
        "150": ".", 
        "151": "Ty do 5: ŵt = arg maxw∈V p + θ (w|x, ŵ<t) 6: wt ∼ p+θ (w|x, ŵ<t) 7: pt = pt−1 + log p + θ (wt|x, ŵ<t) 8: if i = t then 9: w′t ∼ p−θ (w|x, ŵ<t)\n10: pt = pt + log p − θ (w ′ t|x, ŵ<t) 11: else 12: w′t ∼ p+θ (w|x, ŵ<t) 13: pt = pt + log p + θ (w ′ t|x, ŵ<t) 14: end if 15: w = (w1, .", 
        "152": ".", 
        "153": ".", 
        "154": ", wt−1, wt) 16: w′ = (w′1, .", 
        "155": ".", 
        "156": ".", 
        "157": ", w ′ t−1, w ′ t) 17: ŵ = (ŵ1, .", 
        "158": ".", 
        "159": ".", 
        "160": ", ŵt−1, ŵt) 18: end for 19: Return 〈w,w′〉 and pT\nsought, by another random variable Y to which X is highly correlated.", 
        "161": "Y is then called the control variate.", 
        "162": "Let Ȳ furthermore denote its expectation.", 
        "163": "Then the following quantityX−ĉ Y+ĉ Ȳ is an unbiased estimator of E[X].", 
        "164": "In our case, the random variable of interest is the noisy gradient X = sk from Equation (2).", 
        "165": "The variance reduction effect of control variates can be seen by computing the variance of this quantity:\nVar(X − ĉ Y ) = Var(X) + ĉ2Var(Y ) (6) − 2ĉCov(X,Y ).", 
        "166": "Choosing a control variate such that Cov(X,Y ) is positive and high enough, the variance of the gradient estimate will be reduced.", 
        "167": "An example is the average reward baseline known from reinforcement learning (Williams, 1992), yielding\nYk = ∇ log pθ(ỹ|xk) 1\nk\nk∑\nj=1\n∆(ỹj).", 
        "168": "(7)\nThe optimal scalar ĉ can be derived easily by taking the derivative of (6), leading to ĉ = Cov(X,Y )Var(X) .", 
        "169": "This technique has been applied to using the score\nfunction (Equation (3)) as control variate in Ranganath et al.", 
        "170": "(2014), yielding the following control variate:\nY k = ∇ log pθ(ỹ|xk).", 
        "171": "(8)\nNote that for both types of control variates, (7) and (8), the expectation Ȳ is zero, simplifying the implementation.", 
        "172": "However, the optimal scalar ĉ has to be estimated for every entry of the gradient separately for the score function control variate.", 
        "173": "We will explore both types of control variates for the stochastic gradient (2) in our experiments.", 
        "174": "A further effect of control variates is to reduce the magnitude of the gradient, the more so the more the stochastic gradient and the control variate covary.", 
        "175": "For L-Lipschitz continuous functions, a reduced gradient norm directly leads to a bound on L which appears in the algorithmic stability bounds of Hardt et al.", 
        "176": "(2016).", 
        "177": "This effect of improved generalization by control variates is empirically validated in our experiments.", 
        "178": "A similar variance reduction effect can be obtained by antithetic control variates.", 
        "179": "Here E[X] is approximated by the estimator X1+X22 whose variance is\nVar ( X1 +X2\n2\n) = 1\n4\n( Var(X1) (9)\n+ Var(X2) + 2Cov(X1, X2) ) .", 
        "180": "Choosing the variates X1 and X2 such that Cov(X1, X2) is negative will reduce the variance of the gradient estimate.", 
        "181": "Under certain assumptions, the stochastic gradient (5) of the pairwise preference objective can be interpreted as an antithetic estimator of the score function (3).", 
        "182": "The antithetic variates in this case would be\nX1 = ∇ log p+θ (ỹi|xk), (10) X2 = ∇ log p−θ (ỹj |xk),\nwhere an antithetic dependence of X2 on X1 can be achieved by construction of p+θ and p − θ (see Capriotti (2008) which is loosely related to our approach).", 
        "183": "Similar to control variates, antithetic variates have the effect of shrinking the gradient norm, the more so the more the variates are antithetically correlated, leading to possible improvements in algorithmic stability (Hardt et al., 2016).", 
        "184": "5 Experiments  In the following, we present an experimental evaluation of the learning objectives presented above\non machine translation domain adaptation.", 
        "185": "We compare how the presented neural bandit learning objectives perform in comparison to linear models, then discuss the handling of unknown words and eventually investigate the impact of techniques for variance reduction.", 
        "186": "5.1 Setup  Data.", 
        "187": "We perform domain adaptation from Europarl (EP) to News Commentary (NC) and TED talks (TED) for translations from French to English.", 
        "188": "Table 1 provides details about the datasets.", 
        "189": "For data pre-processing we follow the procedure of Sokolov et al.", 
        "190": "(2016a,b) using cdec tools for filtering, lowercasing and tokenization.", 
        "191": "The challenge for the bandit learner is to adapt from the EP domain to NC or TED with weak feedback only.", 
        "192": "NMT Models.", 
        "193": "We choose a standard encoderdecoder architecture with single-layer GRU RNNs with 800 hidden units, a word embedding size of 300 and tanh activations.", 
        "194": "The encoder consists of a bidirectional RNN, where the hidden states of backward and forward RNN are concatenated.", 
        "195": "The decoder uses the attention mechanism proposed by Bahdanau et al.", 
        "196": "(2015).3 Source and target vocabularies contain the 30k most frequent words of the respective parts of the training corpus.", 
        "197": "We limit the maximum sentence length to 50.", 
        "198": "Dropout (Srivastava et al., 2014) with a probability of 0.5 is applied to the network in several places: on the embedded inputs, before the output layer, and on the initial state of the decoder RNN.", 
        "199": "The gradient is clipped when its norms exceeds 1.0 to prevent exploding gradients and stabilize learning (Pascanu et al., 2013).", 
        "200": "All models are implemented and trained with the sequence learning framework Neural Monkey (Libovickỳ et al.,\n3We do not use beam search nor ensembling, although we are aware that higher performance is almost guaranteed with these techniques.", 
        "201": "Our goal is to show relative differences between different models, so a simple setup is sufficient for the purpose of our experiments.", 
        "202": "2016; Bojar et al., 2016).4 They are trained with a minibatch size of 20, fitting onto single 8GB GPU machines.", 
        "203": "The training dataset is shuffled before each epoch.", 
        "204": "Baselines.", 
        "205": "The out-of-domain baseline is trained on the EP training set with standard MLE.", 
        "206": "For both NC and TED domains, we train two fullinformation in-domain baselines: The first indomain baseline is trained on the relatively small in-domain training data.", 
        "207": "The second in-domain baseline starts from the out-of-domain model and is further trained on the in-domain data.", 
        "208": "All baselines are trained with MLE and Adam (Kingma and Ba, 2014) (α = 1× 10−4, β1 = 0.9, β2 = 0.999) until their performance stops increasing on respective held-out validation sets.", 
        "209": "The gap between the performance of the out-ofdomain model and the in-domain models defines the range of possible improvements for bandit learning.", 
        "210": "All models are evaluated with Neural Monkey’s mteval.", 
        "211": "For statistical significance tests we used Approximate Randomization testing (Noreen, 1989).", 
        "212": "Bandit Learning.", 
        "213": "Bandit learning starts with the parameters of the out-of-domain baseline.", 
        "214": "The bandit models are expected to improve over the out-of-domain baseline by receiving feedback from the new domain, but at most to reach the indomain baseline since the feedback is weak.", 
        "215": "The models are trained with Adam on in-domain data for at most 20 epochs.", 
        "216": "Adam’s step-size parameter α was tuned on the validation set and was found to perform best when set to 1× 10−5 for non-pairwise, 1× 10−6 for pairwise objectives on NC, 1× 10−7 for pairwise objectives on TED.", 
        "217": "The best model parameters, selected with early stopping on the in-domain validation set, are evaluated on the held-out in-domain test set.", 
        "218": "In the spirit of Freitag and Al-Onaizan (2016) they are additionally evaluated on the out-of-domain test set to investigate how much knowledge of the old domain the models lose while adapting to the new domain.", 
        "219": "Bandit learning experiments are repeated two times, with different random seeds, and mean BLEU scores with standard deviation are reported.", 
        "220": "4The Neural Monkey fork https://github.", 
        "221": "com/juliakreutzer/bandit-neuralmonkey contains bandit learning objectives and the configuration files for our experiments.", 
        "222": "Feedback Simulation.", 
        "223": "Weak feedback is simulated from the target side of the parallel corpus, but references are never revealed to the learner.", 
        "224": "Sokolov et al.", 
        "225": "(2016a,b) used a smoothed version of per-sentence BLEU for simulating the weak feedback for generated translations from the comparison with reference translations.", 
        "226": "Here, we use gGLEU instead, which Wu et al.", 
        "227": "(2016) recently introduced for learning from sentence-level reward signals correlating well with corpus BLEU.", 
        "228": "This metric is closely related to BLEU, but does not have a brevity penalty and considers the recall of matching n-grams.", 
        "229": "It is defined as the minimum of recall and precision over the total n-grams up to a certain n. Hence, for our experiments ∆(ỹ) = −gGLEU(ỹ,y), where ỹ is a sample translation and y is the reference translation.", 
        "230": "Unknown words.", 
        "231": "One drawback of NMT models is their limitation to a fixed source- and target vocabulary.", 
        "232": "In a domain adaptation setting, this limitation has a critical impact to the translation quality.", 
        "233": "The larger the distance between old and new domain, the more words in the new domain are unknown to the models trained on the old domain (represented with a special UNK token).", 
        "234": "We consider two strategies for this problem for our experiments:\n1.", 
        "235": "UNK-Replace: Jean et al.", 
        "236": "(2015) and Luong et al.", 
        "237": "(2015b) replace generated UNK tokens with aligned source words or their lexical translations in a post-processing step.", 
        "238": "Freitag and Al-Onaizan (2016) and Hashimoto et al.", 
        "239": "(2016) demonstrated that this technique is beneficial for NMT domain adaptation.", 
        "240": "2.", 
        "241": "BPE: Sennrich et al.", 
        "242": "(2016) introduce byte pair encoding (BPE) for word segmentation to build translation models on sub-word units.", 
        "243": "Rare words are decomposed into subword units, while the most frequent words remain single vocabulary items.", 
        "244": "For UNK-Replace we use fast align to generate lexical translations on the EP training data.", 
        "245": "When an UNK token is generated, we look up the attention weights and find the source token that receives most attention in this step.", 
        "246": "If possible, we replace the UNK token by its lexical translation.", 
        "247": "If it is not included in the lexical translations, it is replaced by the source token.", 
        "248": "The main benefit of this technique is that it deals well\nwith unknown named entities that are just passed through from source to target.", 
        "249": "However, since it is a non-differentiable post-processing step, the NMT model cannot directly be trained for this behavior.", 
        "250": "Therefore we also train sub-word level NMT with BPE.", 
        "251": "We apply 29,800 merge operations to obtain a vocabulary of 29,908 sub-words.", 
        "252": "The procedure for training these models is exactly the same as for the word-based models.", 
        "253": "The advantage of this method is that the model is in principle able to generate any word composing it from sub-word units.", 
        "254": "However, training sequences become longer and candidate translations are sampled on a sub-word level, which introduces the risk of sampling nonsense words.", 
        "255": "Control variates.", 
        "256": "We implement the average baseline control variate as defined in Equation 7, which results in keeping an running average over previous losses.", 
        "257": "Intuitively, absolute gGLEU feedback is turned into relative feedback that reflects the current state of the model.", 
        "258": "The sign of the update is switched when the gGLEU for the current sample is worse than the average gGLEU, so the model makes a step away from it, while in the case of absolute feedback it would still make a small step towards it.", 
        "259": "In addition, we implement the score function control variate with a running estimate ĉk = 1k ∑k j=1 Cov(sj ,∇ log pθ(ỹj |xj)) Var(sj) .", 
        "260": "5.2 Results  In the following, we discuss the results of the experimental evaluation of the models described above.", 
        "261": "The out-of-domain baseline results are given in Table 2, those for the in-domain baselines in 3.", 
        "262": "The results for bandit learning on NC and TED are reported in Table 4.", 
        "263": "For bandit learning we give mean improvements over the respective out-of-domain baselines in the Diff.-columns.", 
        "264": "Baselines.", 
        "265": "The NMT out-of-domain baselines, reported in Table 2, perform comparable to the linear baseline from Sokolov et al.", 
        "266": "(2016a,b) on\nNC, but the in-domain EP→NC (Table 3) baselines outperform the linear baseline by more than 3 BLEU points.", 
        "267": "Continuing training of a pre-trained out-of-domain model on a small amount of in domain data is very hence effective, whilst the performance of the models solely trained on small indomain data is highly dependent on the size of this training data set.", 
        "268": "For TED, the in-domain dataset is almost four times as big as the NC training set, so the in-domain baselines perform better.", 
        "269": "This effect was previously observed by Luong and Manning (2015) and Freitag and Al-Onaizan (2016).", 
        "270": "Bandit Learning.", 
        "271": "The NMT bandit models that optimize the EL objective yield generally a much higher improvement over the out-of-domain models than the corresponding linear models: As listed in Table 4, we find improvements of between 2.33 and 2.89 BLEU points on the NC domain, and between 4.18 and 5.18 BLEU points on the TED domain.", 
        "272": "In contrast, the linear models with sparse features and hypergraph re-decoding achieved a maximum improvement of 0.82 BLEU points on NC.", 
        "273": "Optimization of the PR objective shows improvements of up to 1.79 BLEU points on NC (compared to 0.6 BLEU points for linear models), but no significant improvement on TED.", 
        "274": "The biggest impact of this variance reduction tech-\nnique is a considerable speedup of training speed of 1 to 2 orders of magnitude compared to EL.", 
        "275": "A beneficial side-effect of NMT learning from weak feedback is that the knowledge from the out-domain training is not simply “overwritten”.", 
        "276": "This happens to full-information in-domain tuning where more than 4 BLEU points are lost in an evaluation on the out-domain data.", 
        "277": "On the contrary, the bandit learning models still achieve high results on the original domain.", 
        "278": "This is useful for conservative domain adaptation, where the performance of the models in the old domain is still relevant.", 
        "279": "Unknown words.", 
        "280": "By handling unknown words with UNK-Replace or BPEs, we find consistent improvements over the plain word-based models for all baselines and bandit learning models.", 
        "281": "We observe that the models with UNK replacement essentially benefit from passing through source tokens, and only marginally from lexical translations.", 
        "282": "Bandit learning models take particular advantage of UNK replacement when it is included already during training.", 
        "283": "The sub-word models achieve the overall highest improvement over the baselines, although sometimes generating nonsense words.", 
        "284": "Control variates.", 
        "285": "Applying the score function control variate to EL optimization does not largely change learning speed or BLEU results.", 
        "286": "However, the average reward control variate leads to\nimprovements of around 1 BLEU over the EL optimization without variance reduction on both domains.", 
        "287": "6 Conclusion  In this paper, we showed how to lift structured prediction under bandit feedback from linear models to non-linear sequence-to-sequence learning using recurrent neural networks with attention.", 
        "288": "We introduced algorithms to train these models under numerical feedback to single output structures or under preference rankings over pairs of structures.", 
        "289": "In our experimental evaluation on the task of neural machine translation domain adaptation, we found relative improvements of up to 5.89 BLEU points over out-of-domain seed models, outperforming also linear bandit models.", 
        "290": "Furthermore, we argued that pairwise ranking under bandit feedback can be interpreted as a use of antithetic variates, and we showed how to include average reward and score function baselines as control variates for improved training speed and generalization.", 
        "291": "In future work, we would like to apply the presented non-linear bandit learners to other structured prediction tasks.", 
        "292": "Acknowledgments  This research was supported in part by the German research foundation (DFG), and in part by a research cooperation grant with the Amazon Development Center Germany."
    }, 
    "document_id": "P17-1138.pdf.json"
}
