{
    "abstract_sentences": {
        "1": "This paper proposes a low-complexity word-level deep convolutional neural network (CNN) architecture for text categorization that can efficiently represent longrange associations in text.", 
        "2": "In the literature, several deep and complex neural networks have been proposed for this task, assuming availability of relatively large amounts of training data.", 
        "3": "However, the associated computational complexity increases as the networks go deeper, which poses serious challenges in practical applications.", 
        "4": "Moreover, it was shown recently that shallow word-level CNNs are more accurate and much faster than the state-of-the-art very deep nets such as character-level CNNs even in the setting of large training data.", 
        "5": "Motivated by these findings, we carefully studied deepening of word-level CNNs to capture global representations of text, and found a simple network architecture with which the best accuracy can be obtained by increasing the network depth without increasing computational cost by much.", 
        "6": "We call it deep pyramid CNN.", 
        "7": "The proposed model with 15 weight layers outperforms the previous best models on six benchmark datasets for sentiment classification and topic categorization."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 562–570 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1052  1 Introduction  Text categorization is an important task whose applications include spam detection, sentiment classification, and topic classification.", 
        "2": "In recent years, neural networks that can make use of word order have been shown to be effective for text categorization.", 
        "3": "While simple and shallow convolutional neural networks (CNNs) (Kim, 2014; John-\nson and Zhang, 2015a) were proposed for this task earlier, more recently, deep and more complex neural networks have also been studied, assuming availability of relatively large amounts of training data (e.g., one million documents).", 
        "4": "Examples are deep character-level CNNs (Zhang et al., 2015; Conneau et al., 2016), a complex combination of CNNs and recurrent neural networks (RNNs) (Tang et al., 2015), and RNNs in a wordsentence hierarchy (Yang et al., 2016).", 
        "5": "A CNN is a feedforward network with convolution layers interleaved with pooling layers.", 
        "6": "Essentially, a convolution layer converts to a vector every small patch of data (either the original data such as text or image or the output of the previous layer) at every location (e.g., 3-word windows around every word), which can be processed in parallel.", 
        "7": "By contrast, an RNN has connections that form a cycle.", 
        "8": "In its typical application to text, a recurrent unit takes words one by one as well as its own output on the previous word, which is parallel-processing unfriendly.", 
        "9": "While both CNNs and RNNs can take advantage of word order, the simple nature and parallel-processing friendliness of CNNs make them attractive particularly when large training data causes computational challenges.", 
        "10": "There have been several recent studies of CNN for text categorization in the large training data setting.", 
        "11": "For example, in (Conneau et al., 2016), very deep 32-layer character-level CNNs were shown to outperform deep 9-layer character-level CNNs of (Zhang et al., 2015).", 
        "12": "However, in (Johnson and Zhang, 2016), very shallow 1-layer word-level CNNs were shown to be more accurate and much faster than the very deep characterlevel CNNs of (Conneau et al., 2016).", 
        "13": "Although character-level approaches have merit in not having to deal with millions of distinct words, shallow word-level CNNs turned out to be superior even\n562\nwhen used with only a manageable number (30K) of the most frequent words.", 
        "14": "This demonstrates the basic fact – knowledge of word leads to a powerful representation.", 
        "15": "These results motivate us to pursue an effective and efficient design of deep wordlevel CNNs for text categorization.", 
        "16": "Note, however, that it is not as simple as merely replacing characters with words in character-level CNNs; doing so rather degraded accuracy in (Zhang et al., 2015).", 
        "17": "We carefully studied deepening of word-level CNNs in the large-data setting and found a deep but low-complexity network architecture with which the best accuracy can be obtained by increasing the depth but not the order of computation time – the total computation time is bounded by a constant.", 
        "18": "We call it deep pyramid CNN (DPCNN), as the computation time per layer decreases exponentially in a ‘pyramid shape’.", 
        "19": "After converting discrete text to continuous representation, the DPCNN architecture simply alternates a convolution block and a downsampling layer over and over1, leading to a deep network in which internal data size (as well as per-layer computation) shrinks in a pyramid shape.", 
        "20": "The network depth can be treated as a meta-parameter.", 
        "21": "The computational complexity of this network is bounded to be no more than twice that of one convolution block.", 
        "22": "At the same time, as described later, the ‘pyramid’ enables efficient discovery of long-range associations in the text (and so more global information), as the network is deepened.", 
        "23": "This is why DPCNN can achieve better accuracy than the shallow CNN mentioned above (hereafter ShallowCNN), which can use only short-range associations.", 
        "24": "Moreover, DPCNN can be regarded as a deep extension of ShallowCNN, which we proposed in (Johnson and Zhang, 2015b) and later tested with large datasets in (Johnson and Zhang, 2016).", 
        "25": "We show that DPCNN with 15 weight layers outperforms the previous best models on six benchmark datasets for sentiment classification and topic classification.", 
        "26": "2 Word-level deep pyramid CNN (DPCNN) for text categorization  Overview of DPCNN: DPCNN is illustrated in Figure 1a.", 
        "27": "The first layer performs text region embedding, which generalizes commonly used word\n1Previous deep CNNs (either on image or text) tend to be more complex and irregular, having occasional increase of the number of feature maps.", 
        "28": "embedding to the embedding of text regions covering one or more words.", 
        "29": "It is followed by stacking of convolution blocks (two convolution layers and a shortcut) interleaved with pooling layers with stride 2 for downsampling.", 
        "30": "The final pooling layer aggregates internal data for each document into one vector.", 
        "31": "We use max pooling for all pooling layers.", 
        "32": "The key features of DPCNN are as follows.", 
        "33": "• Downsampling without increasing the number of feature maps (dimensionality of layer output, 250 in Figure 1a).", 
        "34": "Downsampling enables efficient representation of long-range associations (and so more global information) in the text.", 
        "35": "By keeping the same number of feature maps, every 2-stride downsampling reduces the per-block computation by half and thus the total computation time is bounded by a constant.", 
        "36": "• Shortcut connections with pre-activation and identity mapping (He et al., 2016) for enabling training of deep networks.", 
        "37": "• Text region embedding enhanced with unsupervised embeddings (embeddings trained in an unsupervised manner) (Johnson and Zhang, 2015b) for improving accuracy.", 
        "38": "2.1 Network architecture  Downsampling with the number of feature maps fixed After each convolution block, we perform max-pooling with size 3 and stride 2.", 
        "39": "That is, the pooling layer produces a new internal representation of a document by taking the component-wise maximum over 3 contiguous internal vectors, representing 3 overlapping text regions, but it does this only for every other possible triplet (stride 2) instead of all the possible triplets (stride 1).", 
        "40": "This 2-stride downsampling reduces the size of the internal representation of each document by half.", 
        "41": "A number of models (Simonyan and Zisserman, 2015; He et al., 2015, 2016; Conneau et al., 2016) increase the number of feature maps whenever downsampling is performed, causing the total computational complexity to be a function of the depth.", 
        "42": "In contrast, we fix the number of feature maps, as we found that increasing the number of feature maps only does harm – increasing computation time substantially without accuracy improvement, as shown later in the experiments.", 
        "43": "With the number of feature maps fixed, the computation time for each convolution layer is halved (as the data size is halved) whenever 2-stride downsampling is performed, thus, forming a ‘pyramid’.", 
        "44": "Computation per layer is halved after every pooling.", 
        "45": "Therefore, with DPCNNs, the total computation time is bounded by a constant – twice the computation time of a single block, which makes our deep pyramid networks computationally attractive.", 
        "46": "In addition, downsampling with stride 2 essentially doubles the effective coverage (i.e., coverage in the original document) of the convolution kernel; therefore, after going through downsampling L times, associations among words within a distance in the order of 2L can be represented.", 
        "47": "Thus, deep pyramid CNN is computationally efficient for representing long-range associations and so more global information.", 
        "48": "Shortcut connections with pre-activation To enable training of deep networks, we use additive shortcut connections with identity mapping, which can be written as z + f(z) where f represents the skipped layers (He et al., 2016).", 
        "49": "In DPCNN, the skipped layers f(z) are two convolution layers with pre-activation.", 
        "50": "Here, pre-activation refers to activation being done before weighting instead of after as is typically done.", 
        "51": "That is, in the convolu-\ntion layer of DPCNN, Wσ(x) +b is computed at every location of each document where a column vector x represents a small region (overlapping with each other) of input at each location, σ(·) is a component-wise nonlinear activation, and weights W and biases b (unique to each layer) are the parameters to be trained.", 
        "52": "The number of W’s rows is the number of feature maps (also called the number of filters (He et al., 2015)) of this layer.", 
        "53": "We set activation σ(·) to the rectifier σ(x) = max(x, 0).", 
        "54": "In our implementation, we fixed the number of feature maps to 250 and the kernel size (the size of the small region covered by x) to 3, as shown in Figure 1a.", 
        "55": "With pre-activation, it is the results of linear weighting (Wσ(x) + b) that travel through the shortcut, and what is added to them at a ⊕ (Figure 1a) is also the results of linear weighting, instead of the results of nonlinear activation (σ(Wx + b)).", 
        "56": "Intuitively, such ‘linearity’ eases training of deep networks, similar to the role of constant error carousels in LSTM (Hochreiter and Schmidhuder, 1997).", 
        "57": "We empirically observed that preactivation indeed outperformed ‘post-activation’, which is in line with the image results (He et al., 2016).", 
        "58": "No need for dimension matching Although the shortcut with pre-activation was adopted from the improved ResNet of (He et al., 2016), our model is simpler than ResNet (Figure 1c), as all the\nshortcuts are exactly simple identity mapping (i.e., passing data exactly as it is) without any complication for dimension matching.", 
        "59": "When a shortcut meets the ‘main street’, the data from two paths need to have the same dimensionality so that they can be added; therefore, if a shortcut skips a layer that changes the dimensionality, e.g., by downsampling or by use of a different number of feature maps, then a shortcut must perform dimension matching.", 
        "60": "Dimension matching for increased number of feature maps, in particular, is typically done by projection, introducing more weight parameters to be trained.", 
        "61": "We eliminate the complication of dimension matching by not letting any shortcut skip a downsampling layer, and by fixing the number of feature maps throughout the network.", 
        "62": "The latter also substantially saves computation time as mentioned above, and we will show later in our experiments that on our tasks, we do not sacrifice anything for such a substantial efficiency gain.", 
        "63": "2.2 Text region embedding  A CNN for text categorization typically starts with converting each word in the text to a word vector (word embedding).", 
        "64": "We take a more general viewpoint as in (Johnson and Zhang, 2015b) and consider text region embedding – embedding of a region of text covering one or more words.", 
        "65": "Basic region embedding We start with the basic setting where there is no unsupervised embedding.", 
        "66": "In the region embedding layer we compute Wx + b for each word of a document where input x represents a k-word region (i.e., window) around the word in some straightforward manner, and weights W and bias b are trained with the parameters of other layers.", 
        "67": "Activation is delayed to the pre-activation of the next layer.", 
        "68": "Now let v be the size of vocabulary, and let us consider the following three types of straightforward representation of a k-word region for x: (1) sequential input: the kv-dimensional concatenation of k one-hot vectors; (2) bow input: a v-dimensional bag-of-word (bow) vector; and (3) bag-of-n-gram input: e.g., a bag of word uni, bi, and trigrams contained in the region.", 
        "69": "Setting the region size k = 1, they all become word embedding.", 
        "70": "A region embedding layer with the sequential input is equivalent to a convolution layer applied to a sequence of one-hot vectors representing a document, and this viewpoint was taken to de-\nscribe the first layer of ShallowCNN in (Johnson and Zhang, 2015a,b).", 
        "71": "From the region embedding viewpoint, ShallowCNN is DPCNN’s special case in which a region embedding layer is directly followed by the final pooling layer (Figure 1b).", 
        "72": "A region embedding layer with region size k > 1 seeks to capture more complex concepts than single words in one weight layer, whereas a network with word embedding uses multiple weight layers to do this, e.g., word embedding followed by a convolution layer.", 
        "73": "In general, having fewer layers has a practical advantage of easier optimization.", 
        "74": "Beyond that, the optimum input type and the optimum region size can only be determined empirically.", 
        "75": "Our preliminary experiments indicated that when used with DPCNN (but not ShallowCNN), the sequential input has no advantage over the bow input – comparable accuracy with k times more weight parameters; therefore, we excluded the sequential input from our experiments2.", 
        "76": "The n-gram input turned out to be prone to overfitting in the supervised setting, likely due to its high representation power, but it is very useful as the input to unsupervised embeddings, which we discuss next.", 
        "77": "Enhancing region embedding with unsupervised embeddings In (Johnson and Zhang, 2015b, 2016), it was shown that accuracy was substantially improved by extending ShallowCNN with unsupervised embeddings obtained by tvembedding training (‘tv’ stands for two views).", 
        "78": "We found that accuracy of DPCNN can also be improved in this manner.", 
        "79": "Below we briefly review tv-embedding training and then describe how we use the resulting unsupervised embeddings with DPCNN.", 
        "80": "The tv-embedding training requires two views.", 
        "81": "For text categorization, we define a region of text as view-1 and its adjacent regions as view-2.", 
        "82": "Then using unlabeled data, we train a neural network of one hidden layer with an artificial task of predicting view-2 from view-1.", 
        "83": "The obtained hidden layer, which is an embedding function that takes view-1 as input, serves as an unsupervised embedding function in the model for text categorization.", 
        "84": "In (Johnson and Zhang, 2015b), we showed theoretical conditions on views and labels under which\n2This differs from ShallowCNN where the sequential input is often superior to bow input.", 
        "85": "We conjecture that when bow input is used in DPCNN, convolution layers following region embedding make up for the loss of local word order caused by bow input, as they use word order.", 
        "86": "unsupervised embeddings obtained this way are useful for classification.", 
        "87": "For use with DPCNN, we train several unsupervised embeddings in this manner, which differ from one another in the region size and the vector representations of view-1 (input region) so that we can benefit from diversity.", 
        "88": "The region embedding layer of DPCNN computes Wx +∑\nu∈U W (u)z(u) + b , where x is the discrete input as in the basic region embedding, and z(u) is the output of an unsupervised embedding function indexed by u.", 
        "89": "We will show below that use of unsupervised embeddings in this way consistently improves the accuracy of DPCNN.", 
        "90": "3 Experiments  We report the experiments with DPCNNs in comparison with previous models and alternatives.", 
        "91": "The code is publicly available on the internet.", 
        "92": "3.1 Experimental setup  Data and data preprocessing To facilitate comparisons with previous results, we used the eight datasets compiled by Zhang et al.", 
        "93": "(2015), summarized in Table 1.", 
        "94": "AG and Sogou are news.", 
        "95": "Dbpedia is an ontology.", 
        "96": "Yahoo consists of questions and answers from the ‘Yahoo!", 
        "97": "Answers’ website.", 
        "98": "Yelp and Amazon (‘Ama’) are reviews where ‘.p’ (polarity) in the names indicates that labels are binary (positive/negative), and ‘.f’ (full) indicates that labels are the number of stars.", 
        "99": "Sogou is in Romanized Chinese, and the others are in English.", 
        "100": "Classes are balanced on all the datasets.", 
        "101": "Data preprocessing was done as in (Johnson and Zhang, 2016).", 
        "102": "That is, upper-case letters were converted to lower-case letters.", 
        "103": "Unlike (Kim, 2014; Zhang et al., 2015; Conneau et al., 2016), variable-sized documents were handled as variable-sized without any shortening or padding; however, the vocabulary size was limited to 30K words.", 
        "104": "For example, as also mentioned in (Johnson and Zhang, 2016), the complete vocabulary of the Ama.p training set\ncontains 1.3M words.", 
        "105": "A vocabulary of 30K words is only a small portion of it, but it covers about 98% of the text and produced good accuracy as reported below.", 
        "106": "Training protocol We held out 10K documents from the training data for use as a validation set on each dataset, and meta-parameter tuning was done based on the performance on the validation set.", 
        "107": "To minimize a log loss with softmax, minibatch SGD with momentum 0.9 was conducted for n epochs (nwas fixed to 50 for AG, 30 for Yelp.f/p and Dbpedia, and 15 for the rest) while the learning rate was set to η for the first 45n epochs and then 0.1η for the rest3.", 
        "108": "The initial learning rate η was considered to be a meta-parameter.", 
        "109": "The minibatch size was fixed to 100.", 
        "110": "Regularization was done by weight decay with the parameter 0.0001 and by optional dropout (Hinton et al., 2012) with 0.5 applied to the input to the top layer.", 
        "111": "In some cases overfitting was observed, and so we performed early stopping, based on the validation performance, after reducing the learning rate to 0.1η.", 
        "112": "Weights were initialized by the Gaussian distribution with zero mean and standard deviation 0.01.", 
        "113": "The discrete input to the region embedding layer was fixed to the bow input, and the region size was chosen from {1,3,5}, while fixing output dimensionality to 250 (same as convolution layers).", 
        "114": "Details of unsupervised embedding training To facilitate comparison with ShallowCNN, we matched our unsupervised embedding setting exactly with that of (Johnson and Zhang, 2016).", 
        "115": "That is, we trained the same four types of tvembeddings, which are embeddings of 5- and 9- word regions, each of which represents the input regions by either 30K-dim bow or 200K-dim\n3This learning rate scheduling method was used also in (Johnson and Zhang, 2015a,b, 2016).", 
        "116": "It was meant to reduce learning rate when error plateaus, as is often done on image tasks, e.g., (He et al., 2015), though for simplicity, the timing of reduction was fixed for each dataset.", 
        "117": "[JZ16]: Johnson and Zhang (2016), [YYDHSH16]: Yang et al.", 
        "118": "(2016), [CSBL16]: Conneau et al.", 
        "119": "(2016), [ZZL15]: Zhang\net al.", 
        "120": "(2015)\nbags of {1,2,3}-grams, retaining only the most frequent 30K words or 200K {1,2,3}-grams.", 
        "121": "Training was done on the labeled data (disregarding the labels), setting the training objectives to the prediction of adjacent regions of the same size as the input region (i.e., 5 or 9).", 
        "122": "Weighted square loss∑\ni,j αi,j(zi[j] − pi[j])2 was minimized where i goes through instances, z represents the target regions by bow, p is the model output, and the weights αi,j were set to achieve the negative sampling effect.", 
        "123": "The dimensionality of unsupervised embeddings was set to 300 unless otherwise specified.", 
        "124": "Unsupervised embeddings were fixed during the supervised training – no fine-tuning.", 
        "125": "3.2 Results  In the results below, the depth of DPCNN was fixed to 15 unless otherwise specified.", 
        "126": "Making it deeper did not substantially improve or degrade accuracy.", 
        "127": "Note that we count as depth the number of hidden weight layers including the region embedding layer but excluding unsupervised embeddings, therefore, 15 means 7 convolution blocks of 2 layers plus 1 layer for region embedding.", 
        "128": "3.2.1 Main results  Large data results We first report the error rates of our full model (DPCNN with 15 weight layers plus unsupervised embeddings) on the larger five datasets (Table 2).", 
        "129": "To put it into perspective, we also show the previous results in the literature.", 
        "130": "The previous results are roughly sorted in the order of error rates from best to worst.", 
        "131": "On all the five datasets, DPCNN outperforms all of the previous results, which validates the effectiveness of our approach.", 
        "132": "DPCNN can be regarded as a deep extension of ShallowCNN (row 2), sharing region embedding enhancement with diverse unsupervised embeddings.", 
        "133": "Note that ShallowCNN enhanced with unsupervised embeddings (row 2) was originally proposed in (Johnson and Zhang, 2015b) as a semi-supervised extension of (Johnson and Zhang, 2015a), and then it was tested on the large datasets in (Johnson and Zhang, 2016).", 
        "134": "The performance improvements of DPCNN over ShallowCNN indicates that the added depth is indeed useful, capturing more global information.", 
        "135": "Yang et al.", 
        "136": "(2016)’s hierarchical attention network (row 3) consists of RNNs in the word level and the sentence level.", 
        "137": "It is more complex than DPCNN due to the use of RNNs and linguistic knowledge for sentence segmentation.", 
        "138": "Similarly, Tang et al.", 
        "139": "(2015) proposed to use CNN or LSTM to represent each sentence in documents and then use RNNs.", 
        "140": "Although we do not have direct comparison with Tang et al.’s model, Yang et al.", 
        "141": "(2016) reports that their model outperformed Tang et al.’s model.", 
        "142": "Conneau et al.", 
        "143": "(2016) and Zhang et al.", 
        "144": "(2015) proposed deep character-level CNNs (row 4&6).", 
        "145": "Their models underperform our DPCNN with relatively large differences in spite of their deepness.", 
        "146": "Our mod-\nels are word-level and therefore use the knowledge of word boundaries which character-level models have no access to.", 
        "147": "While this is arguably not an apple-to-apple comparison, since word boundaries can be obtained for free in many languages, we view our model as much more useful in practice.", 
        "148": "Row 7 shows the performance of deep wordlevel CNN from (Zhang et al., 2015), which was designed to match their character-level models in complexity.", 
        "149": "Its relatively poor performance shows that it is not easy to design a high-performance deep word-level CNN.", 
        "150": "Computation time In Figure 2, we plot error rates in relation to the computation time – the time spent for categorizing 10K documents using our implementation on a GPU.", 
        "151": "The right figure is a close-up of x ∈ [0, 20] of the left figure.", 
        "152": "It stands out in the left figure that the character-level CNN of (Conneau et al., 2016) is much slower than DPCNNs.", 
        "153": "This is partly because it increases the number of feature maps with downsampling (i.e., no pyramid) while it is deeper (32 weight layers), and partly because it deals with characters – there are more characters than words in each document.", 
        "154": "DPCNNs are more accurate than ShallowCNNs at the expense of more computation time due to the depth (15 layers vs. 1 layer).", 
        "155": "Nevertheless, their computation time is comparable – the points of both fit in the same range [0, 20].", 
        "156": "The efficiency of DPCNNs is due to the exponential decrease of per-layer computation due to downsampling with the number of feature maps being fixed.", 
        "157": "Comparison with non-pyramid variants Furthermore, we tested the following two ‘nonpyramid’ models for comparison.", 
        "158": "The first model doubles the number of feature maps at every other downsampling so that per-layer computation is\nkept approximately constant4.", 
        "159": "The second model performs no downsampling.", 
        "160": "Otherwise, these two models are the same as DPCNN.", 
        "161": "We show in Figure 3 the error rates of these two variations (labeled as ‘Increase #feature maps’ and ‘No downsampling’, respectively) in comparison with DPCNN.", 
        "162": "The x-axis is the computation time, measured by the seconds spent for categorizing 10K documents.", 
        "163": "For all types, the models of depth 11 and 15 are shown.", 
        "164": "Clearly, DPCNN is more accurate and computes faster than the others.", 
        "165": "Figure 3 is on Yelp.f, and we observed the same performance trend on the other four large datasets.", 
        "166": "Small data results Now we turn to the results on the three smaller datasets in Table 3.", 
        "167": "Again, the previous models are roughly sorted from best to worst.", 
        "168": "For these small datasets, the DPCNN performances with 100-dim unsupervised embed-\n4Note that if we double the number of feature maps, it would increase the computation cost of the next layer by 4 times as it doubles the dimensionality of both input and output.", 
        "169": "On image, downsampling with stride 2 cancels it out as it makes data 4 times smaller by shrinking both horizontally and vertically, but text is one dimensional, and so downsampling with stride 2 merely halves data.", 
        "170": "That is why we doubled the number of feature maps at every other downsampling instead of at every downsampling to avoid exponential increase of computation time.", 
        "171": "dings are shown, which turned out to be as good as those with 300-dim unsupervised embeddings.", 
        "172": "One difference from the large dataset results is that the strength of shallow models stands out.", 
        "173": "ShallowCNN (row 2) rivals DPCNN (row 1), and Zhang et al.’s best linear model (row 3) moved up from the worst performer to the third best performer.", 
        "174": "The results are in line with the general fact that more complex models require more training data, and with the paucity of training data, simpler models can outperform more complex ones.", 
        "175": "3.2.2 Empirical studies  We present some empirical results to validate the design choices.", 
        "176": "For this purpose, the larger five datasets were used to avoid the paucity of training data.", 
        "177": "Depth Figure 4 shows error rates of DPCNNs with 3, 7, and 15 weight layers (blue circles from left to right).", 
        "178": "For comparison, the ShallowCNN results (green ‘x’) from (Johnson and Zhang, 2016) are also shown.", 
        "179": "The x-axis represents the computation time (seconds for categorizing 10K documents on a GPU).", 
        "180": "For simplicity, the results without unsupervised embeddings are shown for all.", 
        "181": "The error rate improves as the depth increases.", 
        "182": "The results confirm the effectiveness of our strategy of deepening the network.", 
        "183": "Unsupervised embeddings To study the effectiveness of unsupervised embeddings, we experimented with variations of DPCNN that differ only in whether/how to use unsupervised embeddings (Table 4).", 
        "184": "First, we compare DPCNNs with and without unsupervised embeddings.", 
        "185": "The model with unsupervised embeddings (row 1, copied from Table 2 for easy comparison) clearly outperforms the one without them (row 4), which confirms the effectiveness of the use of unsupervised embeddings.", 
        "186": "Second, in the proposed model (row 1), a region embedding layer receives two types of input, the output of unsupervised embedding functions and the high-dimensional discrete input such as a bow vector.", 
        "187": "Row 2 shows the results obtained by using unsupervised embeddings to produce sole input (i.e., no discrete vectors provided to the region embedding layer).", 
        "188": "Degradations of error rates are up to 0.32%, small but consistent.", 
        "189": "Since the discrete input add almost no computation cost due to its sparseness, its use is desirable.", 
        "190": "Third, a number of previous studies used unsupervised word embedding to initialize word embedding in neural networks and then fine-tune it as training proceeds (pretraining).", 
        "191": "The model in row 3 does this with DPCNN using word2vec (Mikolov et al., 2013).", 
        "192": "The word2vec training was done on the training data (ignoring the labels),\nsame as tv-embedding training.", 
        "193": "This model (row 3) underperformed our proposed model (row 1).", 
        "194": "We attribute the superiority of the proposed model to its use of richer information than a word embedding.", 
        "195": "These results support our approach.", 
        "196": "4 Conclusion  This paper tackled the problem of designing highperformance deep word-level CNNs for text categorization in the large training data setting.", 
        "197": "We proposed a deep pyramid CNN model which has low computational complexity, and can efficiently represent long-range associations in text and so more global information.", 
        "198": "It was shown to outperform the previous best models on six benchmark datasets."
    }, 
    "document_id": "P17-1052.pdf.json"
}
