{
    "abstract_sentences": {
        "1": "Deep latent variable models have been shown to facilitate the response generation for open-domain dialog systems.", 
        "2": "However, these latent variables are highly randomized, leading to uncontrollable generated responses.", 
        "3": "In this paper, we propose a framework allowing conditional response generation based on specific attributes.", 
        "4": "These attributes can be either manually assigned or automatically detected.", 
        "5": "Moreover, the dialog states for both speakers are modeled separately in order to reflect personal features.", 
        "6": "We validate this framework on two different scenarios, where the attribute refers to genericness and sentiment states respectively.", 
        "7": "The experiment result testified the potential of our model, where meaningful responses can be generated in accordance with the specified attributes."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 504–509 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2080  1 Introduction  Seq2seq neural networks, ever since the successful application in machine translation (Sutskever et al., 2014), have demonstrated impressive results on dialog generation and spawned a great deal of variants (Vinyals and Le, 2015; Yao et al., 2015; Sordoni et al., 2015; Shang et al., 2015).", 
        "2": "The vanilla seq2seq models suffer from the problem of generating too many generic responses (generic denotes safe, commonplace responses like ”I don’t know”).", 
        "3": "One major reason is that the element-wise prediction models stochastical variations only at the token level, seducing the system to gain immediate short rewards and neglect the long-term structure.", 
        "4": "To\n∗Authors contributed equally.", 
        "5": "Correspondence should be sent to H. Su (suhui15@iscas.ac.cn) and X. Shen (xshen@lsv.uni-saarland.de)\ncope with this problem, (Serban et al., 2017) proposed a variational hierarchical encoder-decoder model (VHRED) that brought the idea of variational auto-encoders (VAE) (Kingma and Welling, 2013; Rezende et al., 2014) into dialog generation.", 
        "6": "For each utterance, VHRED samples a latent variable as a holistic representation so that the generative process will learn to maintain a coherent global sentence structure.", 
        "7": "However, the latent variable is learned purely in an unsupervised way and can only be explained vaguely as higher level decisions like topic or sentiment.", 
        "8": "Though effective in generating utterances with more information content, it lacks the ability of explicitly controlling the generating process.", 
        "9": "This paper presents a conditional variational framework for generating specific responses, inspired by the semi-supervised deep generative model (Kingma et al., 2014).", 
        "10": "The principle idea is to generate the next response based on the dialog context, a stochastical latent variable and an external label.", 
        "11": "Furthermore, the dialog context for both speakers is modeled separately because they have different talking styles, personality and sentiment.", 
        "12": "The whole network structure functions like a conditional VAE (Sohn et al., 2015; Yan et al., 2016).", 
        "13": "We test our framework on two scenarios.", 
        "14": "For the first scenario, the label serves as a signal to indicate whether the response is generic or not.", 
        "15": "By assigning different values to the label, either generic or non-generic responses can be generated.", 
        "16": "For the second scenario, the label represents an imitated sentiment tag.", 
        "17": "Before generating the next response, the appropriate sentiment tag is predicted to direct the generating process.", 
        "18": "Our framework is expressive and extendable.", 
        "19": "The generated responses agree with the predefined labels while maintaining meaningful.", 
        "20": "By changing the definition of the label, our framework can\n504\nbe easily applied to other specific areas.", 
        "21": "2 Models  To provide a better dialog context, we build a hierarchical recurrent encoder-decoder with separated context models (SPHRED).", 
        "22": "This section first introduces the concept of SPHRED, then explains the conditional variational framework and two application scenarios.", 
        "23": "2.1 SPHRED  We decomposes a dialog into two levels: sequences of utterances and sub-sequences of words, as in (Serban et al., 2016).", 
        "24": "Let w1, .", 
        "25": ".", 
        "26": ".", 
        "27": ",wN be a dialog with N utterances, where wn = (wn,1, .", 
        "28": ".", 
        "29": ".", 
        "30": ", wn,Mn) is the n-th utterance.", 
        "31": "The probability distribution of the utterance sequence factorizes as:\nN∏\nn=1\nMn∏\nm=1\nPθ(wm,n|wm,<n,w<n) (1)\nwhere θ represents the model parameters and w<n encodes the dialog context until step n.\nIf we model the dialog context through a single recurrent neural network (RNN), it can only represent a general dialog state in common but fail to capture the respective status for different speakers.", 
        "32": "This is inapplicable when we want to infer implicit personal attributes from it and use them to influence the sampling process of the latent variable, as we will see in Section 2.4.", 
        "33": "Therefore, we model the dialog status for both speakers separately.", 
        "34": "As displayed in Figure 1, SPHRED contains an encoder RNN of tokens and two status RNNs of utterances, each for one speaker.", 
        "35": "When modeling turn k in a dialog, each status RNN takes as input the last encoder RNN state of turn k − 2.", 
        "36": "The\n1 ).", 
        "37": "When y\nt+1 is known, there exists\nan additional link from yt+1 to z (dashed line).", 
        "38": "Ct encodes context information up to time t. Dotted lines are posterior approximation Qφ(zn|yn,wn1 ).", 
        "39": "higher-level context vector is the concatenation of both status vectors.", 
        "40": "We will show later that SPHRED not only well keeps individual features, but also provides a better holistic representation for the response decoder than normal HRED.", 
        "41": "2.2 Conditional Variational Framework  VAEs have been used for text generation in (Bowman et al., 2015; Semeniuta et al., 2017), where texts are synthesized from latent variables.", 
        "42": "Starting from this idea, we assume every utterance wn comes with a corresponding label yn and latent variable zn.", 
        "43": "The generation of zn and wn are conditioned on the dialog context provided by SPHRED, and this additional class label yn.", 
        "44": "This includes 2 situations, where the label of the next sequence is known (like for Scenario 1 in Section 2.3) or not (Section 2.4).", 
        "45": "For each utterance, the latent variable zn is first sampled from a prior distribution.", 
        "46": "The whole dialog can be explained by the generative process:\nPθ(zn|yn,wn−11 ) = N (µprior,Σprior) (2)\nPθ(wn | yn, zn,wn−11 ) = Mn∏\nm=1\nPθ(wn,m | yn, zn,wn−11 , wn,m−1n,1 ) (3)\nWhen the label yn is unknown, a suitable classifier is implemented to first predict it from the context vector.", 
        "47": "This classifier can be designed as, but not restricted to, multilayer perceptrons (MLP) or support vector machines (SVM).", 
        "48": "Similarly, the posterior distribution of zn is approximated as in Equation 4, where the context\nand label of the next utterance is provided.", 
        "49": "The graphical model is depicted in Figure 2.", 
        "50": "Qφ(zn|yn,wn1 ) = N (µposterior,Σposterior) (4)\nThe training objective is derived as in Formula 5, which is a lower bound of the logarithm of the sequence probability.", 
        "51": "When the label is to be predicted (ȳn), an additional classification loss (first term) is added such that the distribution qφ(yn|wn−11 ) can be learned together with other parameters.", 
        "52": "logPθ(w1, .", 
        "53": ".", 
        "54": ".", 
        "55": ",wN ) ≥ Ep(wn,yn) [ qφ(yn|wn−11 ) ]\n− N∑\nn=1\nKL [ Qψ(zn | wn1 ,yn)||Pθ(zn | wn−11 , ȳn) ]\n+ EQψ(zn|wn1 ,yn)[logPθ(wn | zn,w n−1 1 ,yn)]\n(5)  2.3 Scenario 1  A major focus in the current research is to avoid generating generic responses, so in the first scenario, we let the label y indicate whether the corresponding sequence is a generic response, where y = 1 if the sequence is generic and y = 0 otherwise.", 
        "56": "To acquire these labels, we manually constructed a list of generic phrases like “I have no idea”, “I don’t know”, etc.", 
        "57": "Sequences containing any one of such phrases are defined as generic, which in total constitute around 2 percent of the whole corpus.", 
        "58": "At test time, if the label is fixed as 0, we expect the generated response should mostly belong to the non-generic class.", 
        "59": "No prediction is needed, thus the training cost does not contain the first item in Formula 5.", 
        "60": "This scenario is designed to demonstrate our framework can explicitly control which class of responses to generate by assigning corresponding values to the label.", 
        "61": "2.4 Scenario 2  In the second scenario, we experiment with assigning imitated sentiment tags to generated responses.", 
        "62": "The personal sentiment is simulated by appending :), :( or :P at the end of each utterance, representing positive, negative or neutral sentiment respectively.", 
        "63": "For example, if we append ”:)” to the original ”OK”, the resulting ”OK :)” becomes positive.", 
        "64": "The initial utterance of every speaker is randomly tagged.", 
        "65": "We consider two rules for the tags of next utterances.", 
        "66": "Rule 1 confines the sentiment tag to stay constant for both\nspeakers.", 
        "67": "Rule 2 assigns the sentiment tag of next utterance as the average of the preceding two ones.", 
        "68": "Namely, if one is positive and the other is negative, the next response would be neutral.", 
        "69": "The label y represents the sentiment tag, which is unknown at test time and needs to be predicted from the context.", 
        "70": "The probability qφ(yn|wn−11 ) is modeled by feedforward neural networks.", 
        "71": "This scenario is designed to demonstrate our framework can successfully learn the manually defined rules to predict the proper label and decode responses conforming to this label.", 
        "72": "3 Experiments  We conducted our experiments on the Ubuntu dialog Corpus (Lowe et al., 2015), which contains about 500,000 multi-turn dialogs.", 
        "73": "The vocabulary was set as the most frequent 20,000 words.", 
        "74": "All the letters are transferred to lowercase and the Outof-Vocabulary (OOV) words were preprocessed as <unk> tokens.", 
        "75": "3.1 Training Procedures  Model hyperparameters were set the same as in VHRED model except that we reduced by half the context RNN dimension.", 
        "76": "The encoder, context and decoder RNNs all make use of the Gated Recurrent Unit (GRU) structure (Cho et al., 2014).", 
        "77": "Labels were mapped to embeddings with size 100 and word vectors were initialized with the pubic Word2Vec embeddings trained on the Google News Corpus1.", 
        "78": "Following (Bowman et al., 2015), 25% of the words in the decoder were randomly dropped.", 
        "79": "We multiplied the KL divergence and classification error by a scalar which starts from zero and gradually increases so that the training would initially focus on the stochastic latent variables.", 
        "80": "At test time, we outputted responses using beam search with beam size set to 5 (Graves, 2012) and <unk> tokens were prevented from being generated.", 
        "81": "We implemented all the models with the open-sourced Python library Tensorflow (Abadi et al., 2016) and optimized using the Adam optimizer (Kingma and Ba, 2014).", 
        "82": "Dialogs are cut into set of slices with each slice containing 80 words then fed into the GPU memory.", 
        "83": "All models were trained with batch size 128.", 
        "84": "We use the learning rate 0.0001 for our framework and 0.0002 for other models.", 
        "85": "Every model is tested on the val-\n1https://code.google.com/archive/p/ word2vec/\nidation dataset once every epoch and stops until it gains nothing more within 5 more epochs.", 
        "86": "3.2 Evaluation  Accurate automatic evaluation of dialog generation is difficult (Galley et al., 2015; Pietquin and Hastie, 2013).", 
        "87": "In our experiment, we conducted three embedding-based evaluations (average, greedy and extrema) (Liu et al., 2016) on all our models, which map responses into vector space and compute the cosine similarity.", 
        "88": "Though not necessarily accurate, the embedding-based metrics can to a large extent measure the semantic similarity and test the ability of successfully generating a response sharing a similar topic with the golden answer.", 
        "89": "The results of a GRU language model (LM), HRED and VHRED were also provided for comparison.", 
        "90": "For the two scenarios of our framework, we further measured the percentage of generated responses matching the correct labels (accuracy).", 
        "91": "In (Liu et al., 2016), current popular metrics are shown to be not well correlated with human judgements.", 
        "92": "Therefore, we also carried out a human evaluation.", 
        "93": "100 examples were randomly sampled from the test dataset.", 
        "94": "The generated responses from the models were shuffled and randomly distributed to 5 volunteers2.", 
        "95": "People were requested to give a binary score to the response from 3 aspects, grammaticality, coherence with history context and diversity.", 
        "96": "Every response was evaluated 3 times and the result agreed by most people was adopted.", 
        "97": "3.3 Results of Metric-based Evaluation  As can be seen from Table 1, SPHRED outperforms both HRED and LM over all the three embedding-based metrics.", 
        "98": "This implies separating the single-line context RNN into two independent parts can actually lead to a better context representation.", 
        "99": "It is worth mentioning the size of context RNN hidden states in SPHRED is only half of that in HRED, but it still behaves better with fewer parameters.", 
        "100": "Hence it is reasonable to apply this context information to our framework.", 
        "101": "The last 4 rows in Table 1 display the results of our framework applied in two scenarios mentioned in Section 2.3 and 2.4.", 
        "102": "SCENE1-A and SCENE1-B correspond to Scenario 1 with the label fixed as 1 and 0.", 
        "103": "90.9% of generated responses\n2All volunteers are well-educated students who have received a Bachelor’s degree on computer science or above.", 
        "104": "in SCENE1-A are generic and 86.9% in SCENE1B are non-generic according to the manually-built rule, which verified the proper effect of the label.", 
        "105": "SCENE2-A and SCENE2-B correspond to rule 1 and 2 in Scenario 2.", 
        "106": "Both successfully predict the sentiment with very minor mismatches (0.2% and 0.8%).", 
        "107": "The high accuracy further demonstrated SPHRED’s capability of maintaining individual context information.", 
        "108": "We also experimented by substituting the encoder with a normal HRED, the resulting model cannot predict the correct sentiment at all because the context information is highly mingled for both speakers.", 
        "109": "The embedding based scores of our framework are still comparable with SPHRED and even better than VHRED.", 
        "110": "Imposing an external label didn’t bring any significant quality decline.", 
        "111": "3.4 Results of Human Evaluation  We conducted human evaluations on VHRED and our framework (Table 3).", 
        "112": "All models share similar scores, except SCENE1-A receiving lower scores with respect to coherence.", 
        "113": "This can be explained by the fact that SCENE1-A is trained to generate only generic responses, which limits its power of taking coherence into account.", 
        "114": "VHRED and Scenario 2 perform close to each other.", 
        "115": "Scenario 1, due to the effect of the label, receives extreme scores for diversity.", 
        "116": "In general, the statistical results of human evaluations on sentence quality are very similar between the VHRED model and our framework.", 
        "117": "This agrees with the metric-based results and supports the conclusion drawn in Section 3.3.", 
        "118": "Though the sample size is relatively small and human judgements can be inevitably disturbed by subjective factors, we believe these results can shed some light on the understanding of our framework.", 
        "119": "A snippet of the generated responses can be\nseen in Table 2.", 
        "120": "Generally speaking, SPHRED better captures the intentions of both speakers, while HRED updates the common context state and the main topic might gradually vanish for the different talking styles of speakers.", 
        "121": "SCENE1-A and SCENE1-B are designed to reply to a given context in two different ways.", 
        "122": "We can see both responses are reasonable and fit into the right class.", 
        "123": "The third and fourth rows are the same context with different appended sentiment tags and rules, both generate a suitable response and append the correct tag at the end.", 
        "124": "4 Discussion and future work  In this work, we propose a conditional variational framework for dialog generation and verify it on two scenarios.", 
        "125": "To model the dialog state for both speakers separately, we first devised the SPHRED structure to provide the context vector for our framework.", 
        "126": "Our evaluation results\nshow that SPHRED can itself provide a better context representation than HRED and help generate higher-quality responses.", 
        "127": "In both scenarios, our framework can successfully learn to generate responses in accordance with the predefined labels.", 
        "128": "Though with the restriction of an external label, the score of generated responses didn’t significantly decreased, meaning that we can constrain the generation within a specific class while still maintaining the quality.", 
        "129": "The manually-defined rules, though primitive, represent two most common sentiment shift conditions in reality.", 
        "130": "The results demonstrated the potential of our model.", 
        "131": "To apply to real-world scenarios, we only need to adapt the classifier to detect more complex sentiments, which we leave for future research.", 
        "132": "External models can be used for detecting generic responses or classifying sentiment categories instead of rule or symbolbased approximations.", 
        "133": "We focused on the controlling ability of our framework, future research can also experiment with bringing external knowledge to improve the overall quality of generated responses.", 
        "134": "5 Acknowledgement  This work was supported by the National Natural Science of China under Grant No.", 
        "135": "61602451, 61672445 and JSPS KAKENHI Grant Numbers 15H02754, 16K12546."
    }, 
    "document_id": "P17-2080.pdf.json"
}
