{
    "abstract_sentences": {
        "1": "Skip-Gram Negative Sampling (SGNS) word embedding model, well known by its implementation in “word2vec” software, is usually optimized by stochastic gradient descent.", 
        "2": "However, the optimization of SGNS objective can be viewed as a problem of searching for a good matrix with the low-rank constraint.", 
        "3": "The most standard way to solve this type of problems is to apply Riemannian optimization framework to optimize the SGNS objective over the manifold of required low-rank matrices.", 
        "4": "In this paper, we propose an algorithm that optimizes SGNS objective using Riemannian optimization and demonstrates its superiority over popular competitors, such as the original method to train SGNS and SVD over SPPMI matrix."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 2028–2036 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1185  1 Introduction  In this paper, we consider the problem of embedding words into a low-dimensional space in order to measure the semantic similarity between them.", 
        "2": "As an example, how to find whether the word “table” is semantically more similar to the word “stool” than to the word “sky”?", 
        "3": "That is achieved by constructing a low-dimensional vector representation for each word and measuring similarity between the words as the similarity between the corresponding vectors.", 
        "4": "One of the most popular word embedding models (Mikolov et al., 2013) is a discriminative neural network that optimizes Skip-Gram Negative Sampling (SGNS) objective (see Equation 3).", 
        "5": "It aims at predicting whether two words can be found close to each other within a text.", 
        "6": "As shown in Section 2, the process of word embeddings training ∗The first two authors contributed equally to this work\nusing SGNS can be divided into two general steps with clear objectives:\nStep 1.", 
        "7": "Search for a low-rank matrix X that provides a good SGNS objective value;\nStep 2.", 
        "8": "Search for a good low-rank representation X = WC> in terms of linguistic metrics, where W is a matrix of word embeddings and C is a matrix of so-called context embeddings.", 
        "9": "Unfortunately, most previous approaches mixed these two steps into a single one, what entails a not completely correct formulation of the optimization problem.", 
        "10": "For example, popular approaches to train embeddings (including the original “word2vec” implementation) do not take into account that the objective from Step 1 depends only on the product X = WC>: instead of straightforward computing of the derivative w.r.t.", 
        "11": "X , these methods are explicitly based on the derivatives w.r.t.", 
        "12": "W and C, what complicates the optimization procedure.", 
        "13": "Moreover, such approaches do not take into account that parametrization WC> of matrix X is non-unique and Step 2 is required.", 
        "14": "Indeed, for any invertible matrix S, we have\nX = W1C > 1 = W1SS −1C>1 = W2C > 2 ,\ntherefore, solutionsW1C>1 andW2C > 2 are equally good in terms of the SGNS objective but entail different cosine similarities between embeddings and, as a result, different performance in terms of linguistic metrics (see Section 4.2 for details).", 
        "15": "A successful attempt to follow the above described steps, which outperforms the original SGNS optimization approach in terms of various linguistic tasks, was proposed in (Levy and Goldberg, 2014).", 
        "16": "In order to obtain a low-rank matrix X on Step 1, the method reduces the dimensionality of Shifted Positive Pointwise Mutual Informa-\n2028\ntion (SPPMI) matrix via Singular Value Decomposition (SVD).", 
        "17": "On Step 2, it computes embeddings W and C via a simple formula that depends on the factors obtained by SVD.", 
        "18": "However, this method has one important limitation: SVD provides a solution to a surrogate optimization problem, which has no direct relation to the SGNS objective.", 
        "19": "In fact, SVD minimizes the Mean Squared Error (MSE) between X and SPPMI matrix, what does not lead to minimization of SGNS objective in general (see Section 6.1 and Section 4.2 in (Levy and Goldberg, 2014) for details).", 
        "20": "These issues bring us to the main idea of our paper: while keeping the low-rank matrix search setup on Step 1, optimize the original SGNS objective directly.", 
        "21": "This leads to an optimization problem over matrix X with the lowrank constraint, which is often (Mishra et al., 2014) solved by applying Riemannian optimization framework (Udriste, 1994).", 
        "22": "In our paper, we use the projector-splitting algorithm (Lubich and Oseledets, 2014), which is easy to implement and has low computational complexity.", 
        "23": "Of course, Step 2 may be improved as well, but we regard this as a direction of future work.", 
        "24": "As a result, our approach achieves the significant improvement in terms of SGNS optimization on Step 1 and, moreover, the improvement on Step 1 entails the improvement on Step 2 in terms of linguistic metrics.", 
        "25": "That is why, the proposed two-step decomposition of the problem makes sense, what, most importantly, opens the way to applying even more advanced approaches based on it (e.g., more advanced Riemannian optimization techniques for Step 1 or a more sophisticated treatment of Step 2).", 
        "26": "To summarize, the main contributions of our paper are:\n• We reformulated the problem of SGNS word embedding learning as a two-step procedure with clear objectives;\n• For Step 1, we developed an algorithm based on Riemannian optimization framework that optimizes SGNS objective over low-rank matrix X directly;\n• Our algorithm outperforms state-of-the-art competitors in terms of SGNS objective and the semantic similarity linguistic metric (Levy and Goldberg, 2014; Mikolov et al., 2013; Schnabel et al., 2015).", 
        "27": "2 Problem Setting    2.1 Skip-Gram Negative Sampling  In this paper, we consider the Skip-Gram Negative Sampling (SGNS) word embedding model (Mikolov et al., 2013), which is a probabilistic discriminative model.", 
        "28": "Assume we have a text corpus given as a sequence of words w1, .", 
        "29": ".", 
        "30": ".", 
        "31": ", wn, where n may be larger than 1012 and wi ∈ VW belongs to a vocabulary of words VW .", 
        "32": "A context c ∈ VC of the word wi is a word from set {wi−L, ..., wi−1, wi+1, ..., wi+L} for some fixed window size L. Let w, c ∈ Rd be the word embeddings of word w and context c, respectively.", 
        "33": "Assume they are specified by the following mappings:\nW : VW → Rd, C : VC → Rd.", 
        "34": "The ultimate goal of SGNS word embedding training is to fit good mappingsW and C.\nLet D be a multiset of all word-context pairs observed in the corpus.", 
        "35": "In the SGNS model, the probability that word-context pair (w, c) is observed in the corpus is modeled as a following dsitribution:\nP (#(w, c) 6= 0|w, c) =\n= σ(〈w, c〉) = 1 1 + exp(−〈w, c〉) ,\n(1)\nwhere #(w, c) is the number of times the pair (w, c) appears in D and 〈x,y〉 is the scalar product of vectors x and y.", 
        "36": "Number d is a hyperparameter that adjusts the flexibility of the model.", 
        "37": "It usually takes values from tens to hundreds.", 
        "38": "In order to collect a training set, we take all pairs (w, c) from D as positive examples and k randomly generated pairs (w, c) as negative ones.", 
        "39": "The number of times the word w and the context c appear in D can be computed as\n#(w) = ∑\nc∈Vc #(w, c),\n#(c) = ∑\nw∈Vw #(w, c)\naccordingly.", 
        "40": "Then negative examples are generated from the distribution defined by #(c) counters:\nPD(c) = #(c)\n|D| .", 
        "41": "In this way, we have a model maximizing the following logarithmic likelihood objective for all word-context pairs (w, c):\nlwc = #(w, c)(log σ(〈w, c〉)+ +k · Ec′∼PD log σ(−〈w, c′〉)).", 
        "42": "(2)\nIn order to maximize the objective over all observations for each pair (w, c), we arrive at the following SGNS optimization problem over all possible mappingsW and C:\nl = ∑\nw∈VW\n∑\nc∈VC (#(w, c)(log σ(〈w, c〉)+\n+k · Ec′∼PD log σ(−〈w, c′〉)))→ maxW,C .", 
        "43": "(3)\nUsually, this optimization is done via the stochastic gradient descent procedure that is performed during passing through the corpus (Mikolov et al., 2013; Rong, 2014).", 
        "44": "2.2 Optimization over Low-Rank Matrices  Relying on the prospect proposed in (Levy and Goldberg, 2014), let us show that the optimization problem given by (3) can be considered as a problem of searching for a matrix that maximizes a certain objective function and has the rank-d constraint (Step 1 in the scheme described in Section 1).", 
        "45": "2.2.1 SGNS Loss Function  As shown in (Levy and Goldberg, 2014), the logarithmic likelihood (3) can be represented as the sum of lw,c(w, c) over all pairs (w, c), where lw,c(w, c) has the following form:\nlw,c(w, c) = #(w, c) log σ(〈w, c〉)+\n+k #(w)#(c) |D| log σ(−〈w, c〉).", 
        "46": "(4)\nA crucial observation is that this loss function depends only on the scalar product 〈w, c〉 but not on embeddings w and c separately:\nlw,c(w, c) = fw,c(xw,c),\nwhere\nfw,c(xw,c) = aw,c log σ(xw,c)+bw,c log σ(−xw,c),\nand xw,c is the scalar product 〈w, c〉, and\naw,c = #(w, c), bw,c = k #(w)#(c)\n|D| are constants.", 
        "47": "2.2.2 Matrix Notation  Denote |VW | as n and |VC | as m. Let W ∈ Rn×d and C ∈ Rm×d be matrices, where each row w ∈ Rd of matrix W is the word embedding of the corresponding word w and each row c ∈ Rd of matrix C is the context embedding of the corresponding context c. Then the elements of the product of these matrices\nX = WC>\nare the scalar products xw,c of all pairs (w, c):\nX = (xw,c), w ∈ VW , c ∈ VC .", 
        "48": "Note that this matrix has rank d, becauseX equals to the product of two matrices with sizes (n × d) and (d ×m).", 
        "49": "Now we can write SGNS objective given by (3) as a function of X: F (X) = ∑\nw∈VW\n∑\nc∈VC fw,c(xw,c), F : Rn×m → R.\n(5) This arrives us at the following proposition:\nProposition 1 SGNS optimization problem given by (3) can be rewritten in the following constrained form:\nmaximize X∈Rn×m F (X), subject to X ∈Md, (6)\nwhere Md is the manifold (Udriste, 1994) of all matrices in Rn×m with rank d:\nMd = {X ∈ Rn×m : rank(X) = d}.", 
        "50": "The key idea of this paper is to solve the optimization problem given by (6) via the framework of Riemannian optimization, which we introduce in Section 3.", 
        "51": "Important to note that this prospect does not suppose the optimization over parameters W and C directly.", 
        "52": "This entails the optimization in the space with ((n + m − d) · d) degrees of freedom (Mukherjee et al., 2015) instead of ((n+m) · d), what simplifies the optimization process (see Section 5 for the experimental results).", 
        "53": "2.3 Computing Embeddings from a Low-Rank Solution  Once X is found, we need to recover W and C such that X = WC> (Step 2 in the scheme described in Section 1).", 
        "54": "This problem does not\nhave a unique solution, since if (W,C) satisfy this equation, then WS−1 and CS> satisfy it as well for any non-singular matrix S. Moreover, different solutions may achieve different values of the linguistic metrics (see Section 4.2 for details).", 
        "55": "While our paper focuses on Step 1, we use, for Step 2, a heuristic approach that was proposed in (Levy et al., 2015) and it shows good results in practice.", 
        "56": "We compute SVD of X in the form\nX = UΣV >,\nwhere U and V have orthonormal columns, and Σ is the diagonal matrix, and use\nW = U √ Σ, C = V √ Σ\nas matrices of embeddings.", 
        "57": "A simple justification of this solution is the following: we need to map words into vectors in a way that similar words would have similar embeddings in terms of cosine similarities:\ncos(w1,w2) = 〈w1,w2〉 ‖w1‖ · ‖w2‖ .", 
        "58": "It is reasonable to assume that two words are similar, if they share contexts.", 
        "59": "Therefore, we can estimate the similarity of two words w1, w2 as\ns(w1, w2) = ∑\nc∈VC xw1,c · xw2,c,\nwhat is the element of the matrix XX> with indices (w1, w2).", 
        "60": "Note that\nXX> = UΣV >V ΣU> = UΣ2U>.", 
        "61": "If we choose W = UΣ, we exactly obtain 〈w1,w2〉 = s(w1, w2), since WW> = XX> in this case.", 
        "62": "That is, the cosine similarity of the embeddings w1,w2 coincides with the intuitive similarity s(w1, w2).", 
        "63": "However, scaling by √\nΣ instead of Σ was shown in (Levy et al., 2015) to be a better solution in experiments.", 
        "64": "3 Proposed Method    3.1 Riemannian Optimization    3.1.1 General Scheme  The main idea of Riemannian optimization (Udriste, 1994) is to consider (6) as a constrained optimization problem.", 
        "65": "Assume we have an approximated solution Xi on a current\nstep of the optimization process, where i is the step number.", 
        "66": "In order to improve Xi, the next step of the standard gradient ascent outputs the point\nXi +∇F (Xi),\nwhere ∇F (Xi) is the gradient of objective F at the point Xi.", 
        "67": "Note that the gradient ∇F (Xi) can be naturally considered as a matrix in Rn×m.", 
        "68": "Point Xi + ∇F (Xi) leaves the manifold Md, because its rank is generally greater than d. That is why Riemannian optimization methods map point Xi + ∇F (Xi) back to manifold Md.", 
        "69": "The standard Riemannian gradient method first projects the gradient step onto the tangent space at the current point Xi and then retracts it back to the manifold:\nXi+1 = R (PTM (Xi +∇F (Xi))),\nwhere R is the retraction operator, and PTM is the projection onto the tangent space.", 
        "70": "Although the optimization problem is nonconvex, Riemannian optimization methods show good performance on it.", 
        "71": "Theoretical properties and convergence guarantees of such methods are discussed in (Wei et al., 2016) more thoroughly.", 
        "72": "3.1.2 Projector-Splitting Algorithm  In our paper, we use a simplified version of such approach that retracts pointXi +∇F (Xi) directly to the manifold and does not require projection onto the tangent space PTM as illustrated in Figure 1:\nXi+1 = R(Xi +∇F (Xi)).", 
        "73": "Intuitively, retractor R finds a rank-d matrix on the manifoldMd that is similar to high-rank matrix Xi + ∇F (Xi) in terms of Frobenius norm.", 
        "74": "How can we do it?", 
        "75": "The most straightforward way to reduce the rank of Xi +∇F (Xi) is to perform the SVD, which keeps d largest singular values of it:\n1: Ui+1, Si+1, V >i+1 ← SVD(Xi +∇F (Xi)), 2: Xi+1 ← Ui+1Si+1V >i+1.", 
        "76": "(7)\nHowever, it is computationally expensive.", 
        "77": "Instead of this approach, we use the projectorsplitting method (Lubich and Oseledets, 2014), which is a second-order retraction onto the manifold (for details, see the review (Absil and Oseledets, 2015)).", 
        "78": "Its practical implementation is\nFine-tuning word embeddings xxxxx xxxxx xxxxx xxxx xxxx xxxx xxx xxxxx xxxx xxxxx ABSTRACT Blah-blah Keywords word embeddings, SGNS, word2vec, GLOVE 1.", 
        "79": "INTRODUCTION sdfdsf 2.", 
        "80": "CONCLUSIONS\n3.", 
        "81": "RELATED WORK Mikolov main [?]", 
        "82": "Levi main [?]", 
        "83": "rFi\nXi = UiSiV T i\nXi+1 = Ui+1Si+1V T i+1\nretraction\n4.", 
        "84": "CONCLUSIONS\nPermission to make digital or hard copies of all or part of this work for\npersonal or classroom use is granted without fee provided that copies are\nnot made or distributed for profit or commercial advantage and that copies\nbear this notice and the full citation on the first page.", 
        "85": "To copy otherwise, to\nrepublish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee.", 
        "86": "WOODSTOCK ’97 El Paso, Texas USA Copyright 20XX ACM X-XXXXX-XX-X/XX/XX ...$15.00.", 
        "87": "Fine-tuning word embeddings xxxxx xxxxx xxxxx xxxx xxxx xxxx xxx xxxxx xxxx xxxxx ABSTRACT Blah-blah Keywords word embeddings, SGNS, word2vec, GLOVE 1.", 
        "88": "INTRODUCTION sdfdsf\n2.", 
        "89": "CONCLUSIONS\n3.", 
        "90": "RELATED WORK Mikolov main [?]", 
        "91": "Levi main [?]", 
        "92": "rFi\nXi = UiSiV T i\nXi+1 = Ui+1Si+1V T i+1\nretraction\nMd\n4.", 
        "93": "CONCLUSIONS\nPermission to make digital or hard copies of all or part of this work for\npersonal or classroom use is granted without fee provided that copies are\nnot made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page.", 
        "94": "To copy otherwise, to republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee.", 
        "95": "WOODSTOCK ’97 El Paso, Texas USA Copyright 20XX ACM X-XXXXX-XX-X/XX/XX ...$15.00.", 
        "96": "Fine-tuning word embeddings xxxxx xxxxx xxxxx xxxx xxxx xxxx xxx xxxxx xxxx xxxxx ABSTRACT Blah-blah Keywords word embeddings, SGNS, word2vec, GLOVE 1.", 
        "97": "INTRODUCTION sdfdsf\n2.", 
        "98": "CONCLUSIONS\n3.", 
        "99": "RELATED WORK Mikolov main [?]", 
        "100": "Levi main [?]", 
        "101": "rF (Xi)\nXi +rF (Xi)\nXi = UiSiV T i\nXi\nXi+1\nXi+1 = Ui+1Si+1V T i+1\nretraction\nMd\n4.", 
        "102": "CONCLUSIONS\nPermission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page.", 
        "103": "To copy otherwise, to republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee.", 
        "104": "WOODSTOCK ’97 El Paso, Texas USA Copyright 20XX ACM X-XXXXX-XX-X/XX/XX ...$15.00.", 
        "105": "Fine-tuning word embeddings xxxxx xxxxx xxxxx xxx xxxx xxxx xxx xxxxx xxxx xxxxx ABSTRACT Blah-blah Keywords word embeddings, SGNS, word2vec, GLOVE 1.", 
        "106": "INTRODUCTION sdfdsf 2.", 
        "107": "CONCLUSIONS  3.", 
        "108": "RELATED WORK  Mikolov main [?]", 
        "109": "Levi main [?]", 
        "110": "rF (Xi)\nXi +rF (Xi)\nXi = UiSiV T i\nXi\nXi+1\nXi+1 = Ui+1Si+1V T i+1\nretraction\nMd\n4.", 
        "111": "CONCLUSIONS\nPermission to make digital or hard copies of all or part of this work for\npersonal or classroom use is granted without fee provided that copies are\nnot made or distributed for profit or commercial advantage and that copies\nbear this notice and the full citation on the first page.", 
        "112": "To copy otherwise, to\nrepublish, to post on servers or to redistribute to lists, requires prior specific\npermission and/or a fee.", 
        "113": "WOODSTOCK ’97 El Paso, Texas USA Copyright 20XX ACM X-XXXXX-XX-X/XX/XX ...$15.00.", 
        "114": "Fine-tuning word embeddings xxxxx xxxxx xxxxx xxxx xxxx xxxx xxx xxxxx xxxx xxxxx ABSTRACT Blah-blah Keywords word embeddings, SGNS, word2vec, GLOVE 1.", 
        "115": "INTRODUCTION sdfdsf\n2.", 
        "116": "CONCLUSIONS\n3.", 
        "117": "RELATED WORK Mikolov main [?]", 
        "118": "Levi main [?]", 
        "119": "rF (Xi)\nXi +rF (Xi)\nXi = UiSiV T i\nXi\nXi+1\nXi+1 = Ui+1Si+1V T i+1\nretraction\nMd\n4.", 
        "120": "CONCLUSIONS\nPermission to make digital or hard copies of all or part of this work for personal or classro m us is r nted without f e provided tha copies are not made or distributed for profit or commercial advantage an that copies bear this notice and the full citation n the first page.", 
        "121": "To copy otherwise, to republish, to post on servers or to redistribute o lists, requires prior specific permission and/or a fee.", 
        "122": "WOODSTOCK ’97 El Paso, Texas USA Copyright 20XX ACM X-XXXXX-XX-X/XX/XX ...$15.00.", 
        "123": "Fine-tuning word embeddings xxxxx xx xxxxx xxxx xxxx xxxx xxx xxxxx xxxx xxxxx ABSTRACT Blah-blah Keywords word embeddings, SGNS, word2vec, GLOVE 1.", 
        "124": "INTRODUCTION sdfdsf\n2.", 
        "125": "CONCLUSIONS\n3.", 
        "126": "RELATED WORK Mikolov main [?]", 
        "127": "Levi main [?]", 
        "128": "rF (Xi)\nXi +rF (Xi)\nXi = UiSiV T i\nXi\nXi+1\nXi+1 = Ui+1Si+1V T i+1\nretraction\nMd\n4.", 
        "129": "CONCLUSIONS\nPermission to make digital or hard copies of all or part of this work for\npersonal or classroom use is granted without fee provided that copies are\nnot made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page.", 
        "130": "To copy otherwise, to republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee.", 
        "131": "WOODSTOCK ’97 El Paso, Texas USA Copyright 20XX ACM X-XXXXX-XX-X/XX/XX ...$15.00.", 
        "132": "Figure 1: Geometric interpretation of one step of projector-splitting optimization procedure: the gradient step an the retraction of the high-rank matrixXi+∇F (Xi) t the manifold of l w- ank matrices Md.", 
        "133": "also qui e in u tiv : instead of compu ing the full SVD of Xi + ∇F (Xi) according to the gradient projection method, we use just one step of the block power numerical method (Bentbib and Kanber, 2015) which computes the SVD, what reduces the computational complexity.", 
        "134": "Let us keep the current point in the following factorized form:\nXi = UiSiV > i , (8)\nwhere matrices Ui ∈ Rn×d and Vi ∈ Rm×d have d orthonormal columns and Si ∈ Rd×d.", 
        "135": "Then we need to perform two QR-decompositions to retract point Xi +∇F (Xi) back to the manifold: 1: Ui+1, Si+1 ← QR ((Xi +∇F (Xi))Vi) , 2: Vi+1, S>i+1 ← QR ( (Xi +∇F (Xi))>Ui+1 ) ,\n3: Xi+1 ← Ui+1Si+1V >i+1.", 
        "136": "In this way, we always keep the solution Xi+1 = Ui+1Si+1V > i+1 on the manifold Md and in the form (8).", 
        "137": "What is important, we only need to compute ∇F (Xi), so the gradients with respect to U , S and V are never computed explicitly, thus avoiding the subtle case where S is close to singular (so-called singular (critical) point on the manifold).", 
        "138": "Indeed, the gradient with respect to U (while keeping the orthogonality constraints) can be written (Koch and Lubich, 2007) as:\n∂F ∂U = ∂F ∂X V S−1,\nwhich means that the gradient will be large if S is close to singular.", 
        "139": "The projector-splitting scheme is free from this problem.", 
        "140": "3.2 Algorithm  In case of SGNS objective given by (5), an element of gradient∇F has the form:\n(∇F (X))w,c = ∂fw,c(xw,c)\n∂xw,c =\n= #(w, c) · σ (−xw,c)− k #(w)#(c)\n|D| · σ (xw,c) .", 
        "141": "To make the method more flexible in terms of convergence properties, we additionally use λ ∈ R, which is a step size parameter.", 
        "142": "In this case, retracto R returns Xi + λ∇F (Xi) instead of Xi + ∇F (Xi) onto the m nifold.", 
        "143": "The whole optimization procedure is summarized in Algorithm 1.", 
        "144": "4 Experimental Setup    4.1 Training Models  We compare our method (“RO-SGNS” in the tables) performance to two baselines: SGNS embeddings optimized via Stochastic Gradient Descent, implemented in the original “word2vec”, (“SGDSGNS” in the tables) (Mikolov et al., 2013) and embeddings obtained by SVD over SPPMI matrix (“SVD-SPPMI” in the tables) (Levy and Goldberg, 2014).", 
        "145": "We have also experimented with the blockwise alternating optimization over factors W and C, but the results are almost the same to SGD results, that is why we do not to include them into the paper.", 
        "146": "The source code of our experiments is available online1.", 
        "147": "The models were trained on English Wikipedia “enwik9” corpus2, which was previously used in most papers on this topic.", 
        "148": "Like in previous studies, we counted only the words which occur more than 200 times in the training corpus (Levy and Goldberg, 2014; Mikolov et al., 2013).", 
        "149": "As a result, we obtained a vocabulary of 24292 unique tokens (set of words VW and set of contexts VC are equal).", 
        "150": "The size of the context window was set to 5 for all experiments, as it was done in (Levy and Goldberg, 2014; Mikolov et al., 2013).", 
        "151": "We conduct three series of experiments: for dimensionality d = 100, d = 200, and d = 500.", 
        "152": "1https://github.com/AlexGrinch/ro_sgns 2http://mattmahoney.net/dc/textdata\nAlgorithm 1 Riemannian Optimization for SGNS Require: Dimentionality d, initialization W0 and C0, step size λ, gradient function ∇F : Rn×m →\nRn×m, number of iterations K Ensure: Factor W ∈ Rn×d\n1: X0 ←W0C>0 # get an initial point at the manifold 2: U0, S0, V > 0 ← SVD(X0) # compute the first point satisfying the low-rank constraint 3: for i← 1, .", 
        "153": ".", 
        "154": ".", 
        "155": ",K do 4: Ui, Si ← QR ((Xi−1 + λ∇F (Xi−1))Vi−1) # perform one step of the block power method 5: Vi, S > i ← QR ( (Xi−1 + λ∇F (Xi−1))>Ui ) 6: Xi ← UiSiV >i # update the point at the manifold 7: end for 8: U,Σ, V > ← SVD(XK) 9: W ← U √ Σ # compute word embeddings\n10: return W\nOptimization step size is chosen to be small enough to avoid huge gradient values.", 
        "156": "However, thorough choice of λ does not result in a significant difference in performance (this parameter was tuned on the training data only, the exact values used in experiments are reported below).", 
        "157": "4.2 Evaluation  We evaluate word embeddings via the word similarity task.", 
        "158": "We use the following popular datasets for this purpose: “wordsim-353” ((Finkelstein et al., 2001); 3 datasets), “simlex-999” (Hill et al., 2016) and “men” (Bruni et al., 2014).", 
        "159": "Original “wordsim-353” dataset is a mixture of the word pairs for both word similarity and word relatedness tasks.", 
        "160": "This dataset was split (Agirre et al., 2009) into two intersecting parts: “wordsim-sim” (“ws-sim” in the tables) and “wordsim-rel” (“wsrel” in the tables) to separate the words from different tasks.", 
        "161": "In our experiments, we use both of them on a par with the full version of “wordsim353” (“ws-full” in the tables).", 
        "162": "Each dataset contains word pairs together with assessor-assigned similarity scores for each pair.", 
        "163": "As a quality measure, we use Spearman’s correlation between these human ratings and cosine similarities for each pair.", 
        "164": "We call this quality metric linguistic in our paper.", 
        "165": "5 Results of Experiments  First of all, we compare the value of SGNS objective obtained by the methods.", 
        "166": "The comparison is demonstrated in Table 1.", 
        "167": "We see that SGD-SGNS and SVD-SPPMI methods provide quite similar results, however, the proposed method obtains significantly better\nSGNS values, what proves the feasibility of using Riemannian optimization framework in SGNS optimization problem.", 
        "168": "It is interesting to note that SVD-SPPMI method, which does not optimize SGNS objective directly, obtains better results than SGD-SGNS method, which aims at optimizing SGNS.", 
        "169": "This fact additionally confirms the idea described in Section 2.2.2 that the independent optimization over parameters W and C may decrease the performance.", 
        "170": "However, the target performance measure of embedding models is the correlation between semantic similarity and human assessment (Section 4.2).", 
        "171": "Table 2 presents the comparison of the methods in terms of it.", 
        "172": "We see that our method outperforms the competitors on all datasets except for “men” dataset where it obtains slightly worse results.", 
        "173": "Moreover, it is important that the higher dimension entails higher performance gain of our method in comparison to the competitors.", 
        "174": "To understand how our model improves or degrades the performance in comparison to the baseline, we found several words, whose neighbors in terms of cosine distance change significantly.", 
        "175": "Table 3 demonstrates neighbors of the words “five”, “he” and “main” for both SVD-SPPMI and ROSGNS models.", 
        "176": "A neighbor is marked bold if we suppose that it has similar semantic meaning to the\nsource word.", 
        "177": "First of all, we notice that our model produces much better neighbors of the words describing digits or numbers (see word “five” as an example).", 
        "178": "Similar situation happens for many other words, e.g.", 
        "179": "in case of “main” — the nearest neighbors contain 4 similar words for our model instead of 2 in case of SVD-SPPMI.", 
        "180": "The neighbourhood of “he” contains less semantically similar words in case of our model.", 
        "181": "However, it filters out irrelevant words, such as “promptly” and “dumbledore”.", 
        "182": "Table 4 contains the nearest words to the word “usa” from 11th to 20th.", 
        "183": "We marked names of USA states bold and did not represent top-10 nearest words as they are exactly names of states for all three models.", 
        "184": "Some non-bold words are arguably relevant as they present large USA cities\n(“akron”, “burbank”, “madison”) or geographical regions of several states (“midwest”, “northeast”, “southwest”), but there are also some completely irrelevant words (“uk”, “cities”, “places”) presented by first two models.", 
        "185": "Our experiments show that the optimal number of iterations K in the optimization procedure and step size λ depend on the particular value of d. For d = 100, we have K = 7, λ = 5 · 10−5, for d = 200, we have K = 8, λ = 5 · 10−5, and for d = 500, we have K = 2, λ = 10−4.", 
        "186": "Moreover, the best results were obtained when SVD-SPPMI embeddings were used as an initialization of Riemannian optimization process.", 
        "187": "Figure 2 illustrates how the correlation between semantic similarity and human assessment scores changes through iterations of our method.", 
        "188": "Optimal value of K is the same for both whole testing set and its 10-fold subsets chosen for cross-validation.", 
        "189": "The idea to stop optimization procedure on some iteration is also discussed in (Lai et al., 2015).", 
        "190": "Training of the same dimensional models (d = 500) on English Wikipedia corpus using SGD-SGNS, SVD-SPPMI, RO-SGNS took 20 minutes, 10 minutes and 70 minutes respectively.", 
        "191": "Our method works slower, but not significantly.", 
        "192": "Moreover, since we were not focused on the code efficiency optimization, this time can be reduced.", 
        "193": "6 Related Work    6.1 Word Embeddings  Skip-Gram Negative Sampling was introduced in (Mikolov et al., 2013).", 
        "194": "The “negative sampling” approach is thoroughly described in (Goldberg and Levy, 2014), and the learning method is explained in (Rong, 2014).", 
        "195": "There are several open-source implementations of SGNS neural network, which is widely known as “word2vec”.", 
        "196": "12\nAs shown in Section 2.2, Skip-Gram Negative Sampling optimization can be reformulated as a problem of searching for a low-rank matrix.", 
        "197": "In order to be able to use out-of-the-box SVD for this task, the authors of (Levy and Goldberg, 2014) used the surrogate version of SGNS as the objective function.", 
        "198": "There are two general assumptions made in their algorithm that distinguish it from the SGNS optimization:\n1.", 
        "199": "SVD optimizes Mean Squared Error (MSE) objective instead of SGNS loss function.", 
        "200": "2.", 
        "201": "In order to avoid infinite elements in SPMI matrix, it is transformed in ad-hoc manner (SPPMI matrix) before applying SVD.", 
        "202": "This makes the objective not interpretable in terms of the original task (3).", 
        "203": "As mentioned in (Levy and Goldberg, 2014), SGNS objective weighs different (w, c) pairs differently, unlike the SVD, which works with the same weight for all pairs and may entail the performance fall.", 
        "204": "The comprehensive explanation of the relation between SGNS and SVD-SPPMI methods is provided in (Keerthi et al., 2015).", 
        "205": "(Lai et al., 2015; Levy et al., 2015)\n1Original Google word2vec: https://code.", 
        "206": "google.com/archive/p/word2vec/\n2Gensim word2vec: https://radimrehurek.", 
        "207": "com/gensim/models/word2vec.html\ngive a good overview of highly practical methods to improve these word embedding models.", 
        "208": "6.2 Riemannian Optimization  An introduction to optimization over Riemannian manifolds can be found in (Udriste, 1994).", 
        "209": "The overview of retractions of high rank matrices to low-rank manifolds is provided in (Absil and Oseledets, 2015).", 
        "210": "The projector-splitting algorithm was introduced in (Lubich and Oseledets, 2014), and also was mentioned in (Absil and Oseledets, 2015) as “Lie-Trotter retraction”.", 
        "211": "Riemannian optimization is succesfully applied to various data science problems: for example, matrix completion (Vandereycken, 2013), largescale recommender systems (Tan et al., 2014), and tensor completion (Kressner et al., 2014).", 
        "212": "7 Conclusions  In our paper, we proposed the general two-step scheme of training SGNS word embedding model and introduced the algorithm that performs the search of a solution in the low-rank form via Riemannian optimization framework.", 
        "213": "We also demonstrated the superiority of our method by providing experimental comparison to existing state-of-the-art approaches.", 
        "214": "Possible direction of future work is to apply more advanced optimization techniques to the Step 1 of the scheme proposed in Section 1 and to explore the Step 2 — obtaining embeddings with a given low-rank matrix.", 
        "215": "Acknowledgments  This research was supported by the Ministry of Education and Science of the Russian Federation (grant 14.756.31.0001)."
    }, 
    "document_id": "P17-1185.pdf.json"
}
