{
    "abstract_sentences": {
        "1": "We present a new visual reasoning language dataset, containing 92,244 pairs of examples of natural statements grounded in synthetic images with 3,962 unique sentences.", 
        "2": "We describe a method of crowdsourcing linguistically-diverse data, and present an analysis of our data.", 
        "3": "The data demonstrates a broad set of linguistic phenomena, requiring visual and set-theoretic reasoning.", 
        "4": "We experiment with various models, and show the data presents a strong challenge for future research."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 217–223 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2034  1 Introduction  Understanding complex compositional language in context is a challenge shared by many tasks.", 
        "2": "Visual question answering and robot instruction systems require reasoning about sets of objects, quantities, comparisons, and spatial relations; for example, when instructing home assistance or assembly-line robots to manipulate objects in cluttered environments.", 
        "3": "This reasoning requires robust language understanding, and is only partially addressed by existing datasets.", 
        "4": "VQA (Antol et al., 2015), while lexically and visually diverse, includes relatively short sentences with limited coverage of such phenomena.", 
        "5": "CLEVR (Johnson et al., 2016) and SHAPES (Andreas et al., 2016b), in contrast, display complex compositional structure, but include only synthetic language.", 
        "6": "In this paper, we introduce the Cornell Natural Language Visual Reasoning (NLVR) corpus and task.", 
        "7": "We define the binary prediction task of judging if a statement is true for an image or not, and introduce a corpus of annotated pairs of natural language statements and synthetic images.", 
        "8": "Collecting this kind of language presents two challenges.", 
        "9": "First, we must design environments to\nsupport such descriptions.", 
        "10": "We use simple visual environments displaying objects with complex visual relations between them.", 
        "11": "Figure 1 shows two generated images.", 
        "12": "The second challenge is eliciting complex descriptions displaying a range of syntactic and semantic phenomena.", 
        "13": "We use a twostage crowdsourcing process.", 
        "14": "In the first stage, we present sets of images and ask workers to write descriptive statements that distinguish them.", 
        "15": "Using synthetic images with abstract shapes allows us to control the potential distinctions between them; for example, by discouraging simple statements about object existence.", 
        "16": "In the second stage, we ask workers to label the truth value for the sentences and images generated in the first stage.", 
        "17": "Our data includes 92,244 sentence-image pairs with 3,962 unique sentences.", 
        "18": "We include both images and the structured representation used to generate them to support research using both raw visual information and structured data.", 
        "19": "Figure 1 shows two examples.", 
        "20": "To assess the difficulty of NLVR, we experiment with multiple baselines.", 
        "21": "The best model using images achieves an accuracy of 66.12, demonstrating remaining challenges\n217\nin the data.", 
        "22": "We also analyze the language in our data for presence of certain linguistic phenomena, and compare this analysis with related datasets.", 
        "23": "The data and leaderboard are available at http://lic.nlp.cornell.edu/nlvr.", 
        "24": "2 Related Work and Datasets  Several datasets have been created to study visual reasoning and language.", 
        "25": "VQA (Antol et al., 2015; Zitnick and Parikh, 2013) includes crowdsourced questions and answers for photographs and abstract scenes, and has been studied extensively (e.g., Lu et al., 2016; Xu and Saenko, 2016; Zhou et al., 2015; Chen et al., 2015a; Andreas et al., 2016b,a; Ray et al., 2016).", 
        "26": "In contrast to VQA, we use synthetic images and emphasize representing a broad range of language phenomena.", 
        "27": "Our motivation is similar to that of SHAPES (Andreas et al., 2016b) and CLEVR (Johnson et al., 2016).", 
        "28": "Both datasets also use synthetic images and emphasize representing diverse spatial language.", 
        "29": "However, unlike our approach, they include only automatically generated language.", 
        "30": "Visual reasoning has also been addressed in instructional language corpora (e.g., MacMahon et al., 2006; Chen and Mooney, 2011; Bisk et al., 2016), where executable instructions are grounded in manipulable environments.", 
        "31": "The language we observe is similar to the type of language studied for understanding and generation of referential expressions (Mitchell et al., 2010; Matuszek et al., 2012; FitzGerald et al., 2013).", 
        "32": "Our task is related to caption generation, which has been studied extensively (e.g., Pedersoli et al., 2016; Carrara et al., 2016; Chen et al., 2016) with MSCOCO (Chen et al., 2015b) and Flickr30K (Young et al., 2014; Plummer et al., 2015).", 
        "33": "In contrast to caption generation, our task does not require approximate metrics like BLEU.", 
        "34": "Several existing datasets focus on natural language querying of structured representations, including GeoQuery (Zelle, 1995) and WikiTables (Pasupat and Liang, 2015).", 
        "35": "Our work is complementary to these resources.", 
        "36": "While our corpus was collected using images, we also provide structured representations.", 
        "37": "When used with these representations, our corpus is similar to WikiTables, where questions are paired with small web tables.", 
        "38": "Instead of web tables, we use object sets and focus on visual language.", 
        "39": "3 Task  Statements in our data are grounded in synthetic images rendered from structured representations.", 
        "40": "Given an example, the task is to determine whether a statement is true or false for the image or structured representation.", 
        "41": "While we describe the image, the structured representation is equivalent.", 
        "42": "We provide examples of the structured representation in the supplementary material.", 
        "43": "Images are divided into three boxes.", 
        "44": "Figure 1 shows two images.", 
        "45": "Each box contains 1-8 objects.", 
        "46": "Each object has four properties: position (x/y coordinates), color (black, blue, yellow), shape (triangle, square, circle), and size (small, medium, large).", 
        "47": "Objects within a box cannot overlap and must be contained entirely in the box.", 
        "48": "We distinguish between images containing scattered objects and images containing only squares arranged in towers up to four blocks tall.", 
        "49": "The top image in Figure 1 is a tower example; the bottom is a scatter example.", 
        "50": "This design encourages compositional language with complex visual reasoning.", 
        "51": "We divide the image into boxes to encourage set theoretic reasoning within and between boxes.", 
        "52": "We also use a relatively limited number of values for each property.", 
        "53": "While a large number of properties provides a more diverse image, it is likely to result in descriptions that refer to property differences.", 
        "54": "We find that the limited number of properties elicits descriptions with rich compositional structure.", 
        "55": "4 Data Collection  We generate images following the structure described in Section 3, and collect grounded natural language descriptions.", 
        "56": "Data is collected in two phases: sentence writing and validation.", 
        "57": "During sentence writing, workers are asked to write contrasting descriptions about a set of images.", 
        "58": "To validate sentences, the description is paired with each of the images.", 
        "59": "We execute the collection process four times to collect training, development, and two test sets (Test-P and Test-U).", 
        "60": "We retain one test set as unreleased (Test-U).", 
        "61": "Generating Images We generate images by rendering a randomly sampled structured representation.", 
        "62": "The number of objects in each box and their properties are sampled uniformly.", 
        "63": "We generate an equal number of scatter and tower images.", 
        "64": "To generate the sets of images presented to annotators, we generate two images independently, a third image by using the set of objects in the first im-\nage and randomly re-shuffling them between the boxes, and a fourth image by re-shuffling the objects in the second image.", 
        "65": "For images with towers, we constrain the re-shuffling to form towers.", 
        "66": "Phase 1 – Sentence Writing Each writing task presents an annotator with four images.", 
        "67": "Figure 2 shows the sentence writing prompt, including the set of constraints, which is shown for all writing tasks.", 
        "68": "The constraints force the worker to contrast two pairs by referring to similarities and differences between the images, but not to refer to the position of the image in the prompt, or of each box in each image.", 
        "69": "These constraints are placed to elicit more set-theoretic language, and to allow us to divide the result of each task into four examples, pairing the annotator’s sentence with each of the four images it was presented with.", 
        "70": "Phase 2 – Validation In the second phase, we pair each sentence with the four images used to generate it.", 
        "71": "We re-label all sentence-image pairs as true or false, correcting for any violations of the constraints in the first phase.", 
        "72": "We do not use the original position of the image as any part of the final label to neutralize any ordering effect.", 
        "73": "In practice, 8.2% of examples had a different label than inferred from their original position in\nthe first phase.", 
        "74": "During validation, boxes are randomly permuted to ensure the last constraint was followed.", 
        "75": "We allow workers to annotate a sentence as nonsensical with regard to the image, and instruct annotators to ignore grammar errors.", 
        "76": "Post-processing We prune pairs when their majority class is nonsensical.", 
        "77": "When collecting multiple annotations for a pair, we prune pairs if the gap between the classes is less than two votes.", 
        "78": "5 Data Statistics and Analysis  We use the crowdsourcing platform Upwork,1 and select ten annotators using a small set of example questions.", 
        "79": "We collect 3,974 task instances and 28,723 total validation judgments at a total cost of $5,526.", 
        "80": "From these 3,974 task instances we extract 15,896 sentence-image pairs.", 
        "81": "We prune 522 pairs in post-processing.", 
        "82": "For the training set we collect a single validation annotation for each sentence-image pair; for the rest of the data we collect five annotations each.", 
        "83": "Finally, we generate six sentence-image pairs from each sample by permuting the boxes.", 
        "84": "The validation step ensures this permutation does not change the label.", 
        "85": "Table 1 shows the number of sentences and pairs, including permutations, for each split.", 
        "86": "We merge the development and test splits to calculate agreement statistics.", 
        "87": "We calculate Krippendorf’s α and Fleiss’ κ (Cocos et al., 2015) on both the full and pruned datasets.", 
        "88": "To calculate Fleiss’ κ, we randomly permute the five annotations to be assigned to five “raters” and compute average kappa from 100 iterations.", 
        "89": "Before pruning, we observe α = 0.768 and κ = 0.709, indicating substantial agreement (Landis and Koch, 1977).", 
        "90": "Pruning improves agreement to α = 0.831 (indicating almost-perfect agreement) and κ = 0.808.", 
        "91": "We analyze 200 development sentences to identify the distribution of semantic phenomena and syntactic ambiguity (Table 2).", 
        "92": "For comparison, we apply this analysis to 200 abstract-image and 200 real-image sentences from VQA (Antol et al., 2015).", 
        "93": "The difference in the distribution illustrates the complexity of our data.", 
        "94": "The mean sentence\n1http://upwork.com\nlength in our data is 11.22 tokens and the vocabulary size is 262.", 
        "95": "In Figure 3, we compare sentence length distribution to VQA, MSCOCO (Chen et al., 2015b), and CLEVR (Johnson et al., 2016).", 
        "96": "Our sentences are generally longer than VQA and more similar in length to MSCOCO.", 
        "97": "However, our task is more similar to VQA, where context is used to understand language, rather than to generate.", 
        "98": "6 Methods  We evaluate multiple methods on the rendered images and structured representations.", 
        "99": "Hyperparameters and initialization details are described in the supplementary material.", 
        "100": "2We say a statement or question uses presupposition when it assumes the truth value of some proposition in order for its entire truth value to be defined.", 
        "101": "In this example, an image which does not have three black items will have no defined truth value for this statement.", 
        "102": "6.1 Majority Class and Single Modality  We use image- and text-only models to measure how well biases in our data can be used to solve the task.", 
        "103": "If the model is able to do well on the text- or image-only baselines, this implies our data does not require the two modalities.", 
        "104": "Antol et al.", 
        "105": "(2015) performed a similar analysis of VQA with the questions only to gauge how and if background knowledge of the domain could aid performance.", 
        "106": "Majority Assign the most common label (true) to all examples.", 
        "107": "Text Only Encode the sentence with a recurrent neural network (RNN; Elman, 1990) with long short-term memory units (LSTM; Hochreiter and Schmidhuber, 1997) and a binary softmax computed from the final output.", 
        "108": "Image Only Encode the image with a convolutional neural network (CNN) with three layers.", 
        "109": "The CNN output is used by a three-layer perceptron with a softmax on the final layer.3  6.2 Structured Representation  We use the structured representations described in Sections 3 and 4.", 
        "110": "3We also experimented using the ImageNet-trained Inception v4 model (Szegedy et al., 2017), but found it did not improve performance, possibly due to the difference between our images and ImageNet.", 
        "111": "MaxEnt Train a MaxEnt classifier.", 
        "112": "We use the text and structured representation to compute property- and count-based features.", 
        "113": "Propertybased features trigger when some property (e.g., an object is touching a wall) is true in the structure.", 
        "114": "We create features by crossing triggered properties with each n-grams from the sentence, up to n = 6.", 
        "115": "Count-based features trigger when a count we observe in the image (e.g., the number of black triangles) is present in the sentence.", 
        "116": "We generate features combining the type of item counted (e.g., black triangles) with the n-grams surrounding the count in the sentence, up to n = 6.", 
        "117": "We provide details in the supplementary material.", 
        "118": "MLP Train a single-layer perceptron with a softmax layer.", 
        "119": "The input to the perceptron is the mean of the feature embeddings.", 
        "120": "We use the same feature set as the MaxEnt model.", 
        "121": "Image Features+RNN Compute features from the structure representation only, and encode the text with an LSTM RNN.", 
        "122": "The two representations are concatenated, and used as input to a two-layer perceptron and a softmax layer.", 
        "123": "6.3 Image Representation  CNN+RNN Concatenate the CNN and RNN representations (Section 6.1) and apply a multilayer perceptron with a softmax.", 
        "124": "NMN The neural module networks approach of Andreas et al.", 
        "125": "(2016b).", 
        "126": "We experiment with the default maximum leaves of two, and with allowing for more expressive representations with a maximum leaves of five.", 
        "127": "We observe higher development accuracy with the trees using maximum leaves of five (63.06% vs. 62.4% with the default of two), which we use in our experiments.", 
        "128": "7 Results  We run each experiment ten times and report mean accuracy as well as standard deviation for randomly initialized models.", 
        "129": "Table 3 shows our re-\nsults.", 
        "130": "NMN is the best performing model using images.", 
        "131": "Table 2 shows the NMN accuracy for each category in our qualitative analysis sample.", 
        "132": "While the number of sentences in some categories is relatively small, we observe a higher number of failures in sentences that include negations and coordinations.", 
        "133": "For models using the structured representation, the MaxEnt model provides the best performance.", 
        "134": "When ablating count-based features from the MaxEnt model, development accuracy decreases from 68.04 to 57.7.", 
        "135": "This indicates counting is an important aspect of the problem.", 
        "136": "8 Discussion  We introduce the Cornell Natural Language Visual Reasoning dataset and task.", 
        "137": "The data includes complex compositional language grounded in images and structured representations.", 
        "138": "The task requires addressing challenges in visual and set-theoretic reasoning.", 
        "139": "We experiment with multiple systems and, in general, observe relatively low performance.", 
        "140": "Together with our qualitative analysis, this exemplifies the complexity of the data.", 
        "141": "We release our annotated training and development sets, and create two test sets.", 
        "142": "The public test set will be released along with its annotation.", 
        "143": "Computing results on the unreleased test data will require submitting trained models.", 
        "144": "Procedures for submitting models and the task leader board are available at http://lic.nlp.cornell.edu/nlvr.", 
        "145": "Acknowledgments  This research was supported by a Microsoft Research Women’s Fellowship, a Google Faculty Award, and an Amazon Web Services Cloud Credits for Research Grant.", 
        "146": "We thank the Cornell and University of Washington NLP groups for their support and helpful comments.", 
        "147": "We thank the anonymous reviewers for their feedback."
    }, 
    "document_id": "P17-2034.pdf.json"
}
