{
    "abstract_sentences": {
        "1": "Modern models of event extraction for tasks like ACE are based on supervised learning of events from small hand-labeled data.", 
        "2": "However, hand-labeled training data is expensive to produce, in low coverage of event types, and limited in size, which makes supervised methods hard to extract large scale of events for knowledge base population.", 
        "3": "To solve the data labeling problem, we propose to automatically label training data for event extraction via world knowledge and linguistic knowledge, which can detect key arguments and trigger words for each event type and employ them to label events in texts automatically.", 
        "4": "The experimental results show that the quality of our large scale automatically labeled data is competitive with elaborately human-labeled data.", 
        "5": "And our automatically labeled data can incorporate with human-labeled data, then improve the performance of models learned from these data."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 409–419 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1038  1 Introduction  Event Extraction (EE), a challenging task in Information Extraction, aims at detecting and typing events (Event Detection), and extracting arguments with different roles (Argument Identification) from natural-language texts.", 
        "2": "For example, in the sentence shown in Figure 1, an EE system is expected to identify an Attack event triggered by threw and extract the corresponding five augments with different roles: Yesterday (Role=Time), demonstrators (Role=Attacker), stones (Role=Instrument), soldiers (Role=Target), and Israeli (Role=Place).", 
        "3": "To this end, so far most methods (Nguyen et al.,\n2016; Chen et al., 2015; Li et al., 2014; Hong et al., 2011; Ji and Grishman, 2008) usually adopted supervised learning paradigm which relies on elaborate human-annotated data, such as ACE 20051, to train extractors.", 
        "4": "Although this paradigm was widely studied, existing approaches still suffer from high costs for manually labeling training data and low coverage of predefined event types.", 
        "5": "In ACE 2005, all 33 event types are manually predefined and the corresponding event information (including triggers, event types, arguments and their roles) are manually annotated only in 599 English documents since the annotation process is extremely expensive.", 
        "6": "As Figure 2 shown, nearly 60% of event types in ACE 2005 have less than 100 labeled samples and there are even three event types which have less than ten labeled samples.", 
        "7": "Moreover, those predefined 33 event types are in low coverage for Natural Language Processing (NLP) applications on large-scale data.", 
        "8": "Therefore, for extracting large scale events, especially in open domain scenarios, how to automatically and efficiently generate sufficient training data is an important problem.", 
        "9": "This paper aims to automatically generate training data for EE, which involves labeling triggers, event types, arguments and their roles.", 
        "10": "Figure 1 shows an example of labeled sentence.", 
        "11": "Recent improvements of Distant Supervision (DS) have been proven to be effective to label training data for Relation Extraction (RE), which aims to predict semantic re-\n1http://projects.ldc.upenn.edu/ace/\n409\nlations between pairs of entities, formulated as (entity1, relation, entity2).", 
        "12": "And DS for RE assumes that if two entities have a relationship in a known knowledge base, then all sentences that mention these two entities will express that relationship in some way (Mintz et al., 2009).", 
        "13": "However, when we use DS for RE to EE, we meet following challenges:\nTriggers are not given out in existing knowledge bases.", 
        "14": "EE aims to detect an event instance of a specific type and extract their arguments and roles, formulated as (event instance, event type; role1, argument1; role2, argument2; ...; rolen, argumentn), which can be regarded as a kind of multiple or complicated relational data.", 
        "15": "In Figure 3, the right part shows an example of spouse of relation between Barack Obama and Michelle Obama, where two rectangles represent two entities and the edge connecting them represents their relation.", 
        "16": "DS for RE uses two entities to automatically label training data; In comparison, the left part in Figure 3 shows a marriage event of Barack Obama and Michelle Obama, where the dash circle represents the marriage event instance of Barack Obama and Michelle Obama, rectangles represent arguments of the event instance, and each edge connecting an argument and the event instance expresses the role of the argument.", 
        "17": "For example, Barack Obama plays a Spouse role in this marriage event instance.", 
        "18": "It seems that we could use an event instance and an argument to automatically generate training data for argument identification just like DS for RE.", 
        "19": "However, an event instance is a virtual node in existing knowledge bases and mentioned implicitly in texts.", 
        "20": "For example, in Freebase, the aforementioned marriage event instance is represented as m.02nqglv (see details in Section 2).", 
        "21": "Thus we cannot directly use an event instance and an argument, like m.02nqglv and Barack Obama, to label back\nMarriageMichelle Obama 10/03/1992 Trinity United Church of Christ Null Spouse Spouse location of ceremony time_from time_to Barack Obama Michelle ObamaSpouse_ofVS An example of marriage event An example of spouse_of relation MarriageMichelle Obama 10/03/1992 Trinity United Church of Christ Null Spouse Spouse location of ceremony time_from time_to Barack Obama Michelle ObamaSpouse_of An example of marriage event An example of spouse_of relation\nMarriageMichelle Obama\n10/03/1992\nTrinity United Church of Christ\nNull\nSpouse Spouse\nlocation of ceremony\ntime_from time_to\nBarack Obama Michelle Obama Spouse_of\nAn example of marriage event An example of spouse_of relation\nMichelle Obama\nFigure 3: A comparison of events and relations.", 
        "22": "in sentences.", 
        "23": "In ACE event extraction program, an event instance is represented as a trigger word, which is the main word that most clearly represents an event occurrence in sentences, like threw in Figure 1.", 
        "24": "Following ACE, we can use trigger words to represent event instance, like married for people.marriage event instance.", 
        "25": "Unfortunately, triggers are not given out in existing knowledge bases.", 
        "26": "To resolve the trigger missing problem mentioned above, we need to discover trigger words before employing distant supervision to automatically label event arguments.", 
        "27": "Following DS in RE, we could naturally assume that a sentence contains all arguments of an event in the knowledge base tend to express that event, and the verbs occur in these sentences tend to evoke this type of events.", 
        "28": "However, arguments for a specific event instance are usually mentioned in multiple sentences.", 
        "29": "Simply employing all arguments in the knowledge base to label back in sentences will generate few sentences as training samples.", 
        "30": "As shown in Table 1, only 0.02% of instances can find all argument mentions in one sentence.", 
        "31": "To solve above problems, we propose an approach to automatically generate labeled data for large scale EE by jointly using world knowledge (Freebase) and linguistic knowledge (FrameNet).", 
        "32": "At first, we put forward an approach to prioritize\narguments and select key or representative arguments (see details in Section 3.1) for each event type by using Freebase; Secondly, we merely use key arguments to label events and figure out trigger words; Thirdly, an external linguistic knowledge resource, FrameNet, is employed to filter noisy trigger words and expand more triggers; After that, we propose a Soft Distant Supervision (SDS) for EE to automatically label training data, which assumes that any sentence containing all key arguments in Freebase and a corresponding trigger word is likely to express that event in some way, and arguments occurring in that sentence are likely to play the corresponding roles in that event.", 
        "33": "Finally, we evaluate the quality of the automatically labeled training data by both manual and automatic evaluations.", 
        "34": "In addition, we employ a CNNbased EE approach with multi-instance learning for the automatically labeled data as a baseline for further research on this data.", 
        "35": "In summary, the contributions of this paper are as follows:\n• To our knowledge, it is the first work to automatically label data for large scale EE via world knowledge and linguistic knowledge.", 
        "36": "All the labeled data in this paper have been released and can be downloaded freely2.", 
        "37": "• We propose an approach to figure out key arguments of an event by using Freebase, and use them to automatically detect events and corresponding trigger words.", 
        "38": "Moreover, we employ FrameNet to filter noisy triggers and expand more triggers.", 
        "39": "• The experimental results show that the quality of our large scale automatically labeled data is competitive with elaborately humanannotated data.", 
        "40": "Also, our automatically labeled data can augment traditional humanannotated data, which could significantly improve the extraction performance.", 
        "41": "2 Background  In this paper, we respectively use Freebase as our world knowledge containing event instance and FrameNet as the linguistic knowledge containing trigger information.", 
        "42": "The articles in Wikipedia are used as unstructured texts to be labeled.", 
        "43": "To understand our method easily, we first introduce them as follows:\n2https://github.com/acl2017submission/event-data\nFreebase is a semantic knowledge base (Bollacker et al., 2008), which makes use of mediators (also called compound value types, CVTs) to merge multiple values into a single value.", 
        "44": "As shown in Figure 3, people.marriage is one type of CVTs.", 
        "45": "There are many instances of people.marriage and the marriage of Barack Obama and Michelle Obama is numbered as m.02nqglv.", 
        "46": "Spouse, from, to and location of ceremony are roles of the people.marriage CVTs.", 
        "47": "Barack Obama, Michelle Obama, 10/3/1992 and Trinity United Church of Christ are the values of the instances.", 
        "48": "In this paper, we regard these CVTs as events, type of CVTs as event type, CVT instances as event instances, values in CVTs as arguments in events and roles of CVTs as the roles of arguments play in the event, respectively.", 
        "49": "According to the statistics of the Freebase released on 23th April, 2015, there are around 1885 CVTs and around 14 million CVTs instances.", 
        "50": "After filtering out useless and meaningless CVTs, such as CVTs about user profiles and website information, we select 21 types of CVTs with around 3.8 million instances for experiments, which mainly involves events about education, military, sports and so on.", 
        "51": "FrameNet3 is a linguistic resource storing information about lexical and predicate argument semantics (Baker et al., 1998).", 
        "52": "FrameNet contains more than 1, 000 frames and 10, 000 Lexical Units (LUs).", 
        "53": "Each frame of FrameNet can be taken as a semantic frame of a type of events (Liu et al., 2016).", 
        "54": "Each frame has a set of lemmas with part of speech tags that can evoke the frame, which are called LUs.", 
        "55": "For example, appoint.v is a LU of Appointing frame in FrameNet, which can be mapped to people.appointment events in Freebase.", 
        "56": "And a LUs of the frame plays a similar role as the trigger of an event.", 
        "57": "Thus we use FrameNet to detect triggers in our automatically data labeling process.", 
        "58": "Wikipedia4 that we used was released on January, 2016.", 
        "59": "All 6.3 million articles in it are used in our experiments.", 
        "60": "We use Wikipedia because it is relatively up-to-date, and much of the information in Freebase is derived from Wikipedia.", 
        "61": "3 Method of Generating Training Data  Figure 4 describes the architecture of automatically labeling data, which primarily involves the following four components: (i) Key argument de-\n3http://framenet.icsi.berkeley.edu 4https://www.wikipedia.org/\nWikipedia\nTrainingDS\ntection, which prioritizes arguments of each event type and selects key arguments for each type of event; (ii) Trigger word detection, which uses key arguments to label sentences that may express events preliminarily, and then detect triggers; (iii) Trigger word filtering and expansion, which uses FrameNet to filter noisy triggers and expand triggers; (iv) Automatically labeled data generation, which uses a SDS to label events in sentences.", 
        "62": "3.1 Key Argument Detection  This section illustrates how to detect key arguments for each event type via Freebase.", 
        "63": "Intuitively, arguments of a type of event play different roles.", 
        "64": "Some arguments play indispensable roles in an event, and serve as vital clues when distinguishing different events.", 
        "65": "For example, compared with arguments like time, location and so on, spouses are key arguments in a marriage event.", 
        "66": "We call these arguments as key arguments.", 
        "67": "We propose to use Key Rate (KR) to estimate the importance of an argument to a type of event, which is decided by two factors: Role Saliency and Event Relevance.", 
        "68": "Role Saliency (RS) reflects the saliency of an argument to represent a specific event instance of a given event type.", 
        "69": "If we tend to use an argument to distinguish one event instance form other instances of a given event type, this argument will play a salient role in the given event type.", 
        "70": "We define RS as follows:\nRSij = Count(Ai, ETj)\nCount(ETj) (1)\nwhere RSij is the role saliency of i-th argument to j-th event type, Count(Ai , ETj) is the number of Arguemnti occurring in all instances of eventTypej in Freebase and Count(ETj) is the number of instances of eventTypej in Freebase.", 
        "71": "Event Relevance (ER) reflects the ability in which an argument can be used to discriminate d-\nifferent event types.", 
        "72": "If an argument occurs in every event type, the argument will have a low event relevance.", 
        "73": "We propose to compute ER as follows:\nERi = log Sum(ET )\n1 + Count(ETCi) (2)\nwhere ERi is the event relevance of i-th argument, Sum (ET ) is the number of all event types in knowledge base and Count(ETCi) is the number of event types containing i-th argument.", 
        "74": "Finally, KR is computed as follows:\nKRij = RSij ∗ ERi (3) We compute KR for all arguments of each event type, and sort them according to KR.", 
        "75": "Then we choose top K arguments as key arguments.", 
        "76": "3.2 Trigger Word Detection  After detecting key arguments for every event types, we use these key arguments to label sentences that may express events in Wikipedia.", 
        "77": "At first, we use Standford CoreNLP tool5 to converts the raw Wikipedia texts into a sequence of sentences, attaches NLP annotations (POS tag, NER tag).", 
        "78": "Finally, we select sentences that contains all key arguments of an event instance in Freebase as sentences expressing corresponding events.", 
        "79": "Then we use these labeled sentences to detect triggers.", 
        "80": "In a sentence, a verb tend to express an occurrence of an event.", 
        "81": "For example, in ACE 2005 English data, there are 60% of events triggered by verbs.", 
        "82": "As shown in Figure 1, threw is a trigger of Attack event.", 
        "83": "Intuitively, if a verb occurs more times than other verbs in the labeled sentences of one event type , the verb tends to trigger this type of event; and if a verb occurs in sentences of every event types, like is, the verb will have a low probability to trigger events.", 
        "84": "Thus we propose Trigger Candidate Frequency (TCF) and Trigger Event Type Frequency (TETF) to evaluate above two aspects.", 
        "85": "Finally we employ Trigger Rate (TR), which is the product of TCF and TETF to estimate the probability of a verb to be a trigger, which is formulated as follows:\nTRij = TCFij ∗ TETFi (4)\nTCFij = Count(Vi, ETSj)\nCount(ETSj) (5)\n5http://stanfordnlp.github.io/CoreNLP/\nTETFi = log Sum(ET )\n1 + Count(ETIi) (6)\nwhere TRij is the trigger rate of i-th verb to jth event type, Count(Vi, ETSj) is the number of sentences, which express j-th type of event and contain i-th verb, Count(ETSj) is the number of sentences expressing j-th event type, Count(ETIi) is the number of event types, which have the labeled sentences containing i-th verb.", 
        "86": "Finally, we choose verbs with high TR values as the trigger words for each event type.", 
        "87": "3.3 Trigger Word Filtering and Expansion  We can obtain an initial verbal trigger lexicon by above trigger word detection.", 
        "88": "However, this initial trigger lexicon is noisy and merely contains verbal triggers.", 
        "89": "The nominal triggers like marriage are missing.", 
        "90": "Because the number of nouns in one sentence is usually larger than that of verbs, it is hard to use TR to find nominal triggers.", 
        "91": "Thus, we propose to use linguistic resource FrameNet to filter noisy verbal triggers and expand nominal triggers.", 
        "92": "As the success of word embedding in capturing semantics of words (Turian et al., 2010), we employ word embedding to map the events in Freebase to frames in FrameNet.", 
        "93": "Specifically, we use the average word embedding of all words in i-th Freebase event type name ei and word embedding of k-th lexical units of j-th frame ej,k to compute the semantic similarity.", 
        "94": "Finally, we select the frame contains max similarity of ei and ej,k as the mapped frame, which can be formulated as follows:\nframe(i) = argmax j (similarity(ei, ej,k)) (7)\nThen, we filter the verb, which is in initial verbal trigger word lexicon and not in the mapping frame.", 
        "95": "And we use nouns with high confidence in the mapped frame to expand trigger lexicon.", 
        "96": "3.4 Automatically labeled data generation  Finally, we propose a Soft Distant Supervision and use it to automatically generate training data, which assumes that any sentence containing all key arguments in Freebase and a corresponding trigger word is likely to express that event in some way, and arguments occurring in that sentence are likely to play the corresponding roles in that event.", 
        "97": "4 Method of Event Extraction  In this paper, event extraction is formulated as a two-stage, multi-class classification task.", 
        "98": "The\nfirst stage is called Event Classification, which aims to predict whether the key argument candidates participate in a Freebase event.", 
        "99": "If the key arguments participate a Freebase event, the second stage is conducted, which aims to assign arguments to the event and identify their corresponding roles.", 
        "100": "We call this stage as argument classification.", 
        "101": "We employ two similar Dynamic Multi-pooling Convolutional Neural Networks with Multi-instance Learning (DMCNNs-MIL) for above two stages.", 
        "102": "The Dynamic Multi-pooling Convolutional Neural Networks (DMCNNs) is the best reported CNN-based model for event extraction (Chen et al., 2015) by using human-annotated training data.", 
        "103": "However, our automatically labeled data face a noise problem, which is a intrinsic problem of using DS to construct training data (Hoffmann et al., 2011; Surdeanu et al., 2012).", 
        "104": "In order to alleviate the wrong label problem, we use Multi-instance Learning (MIL) for two DMCNNs.", 
        "105": "Because the second stage is more complicated and limited in space, we take the MIL used in arguments classification as an example and describes as follows:\nWe define all of the parameters for the stage of argument classification to be trained in DMCNNs as θ.", 
        "106": "Suppose that there are T bags {M1,M2, ...,MT } and that the i-th bag contains qi instances (sentences) Mi = { m1i ,m 2 i , ...,m qi i } , the objective of multi-instance learning is to predict the labels of the unseen bags.", 
        "107": "In stage of argument classification, we take sentences containing the same argument candidate and triggers with a same event type as a bag and all instances in a bag are considered independently.", 
        "108": "Given an input instance mji , the network with the parameter θ outputs a vector O, where the r-th component Or corresponds to the score associated with argument role r. To obtain the conditional probability p(r|mji , θ), we apply a softmax operation over all argument role types:\np(r|mji , θ) = eor\nn∑ k=1 eok (8)\nwhere, n is the number of roles.", 
        "109": "And the objective of multi-instance learning is to discriminate bags rather than instances.", 
        "110": "Thus, we define the objective function on the bags.", 
        "111": "Given all (T ) training bags (Mi, yi), we can define the objective function\nusing cross-entropy at the bag level as follows:\nJ (θ) = T∑\ni=1\nlog p(yi|mji , θ) (9)\nwhere j is constrained as follows:\nj∗ = argmax j p(r|mji , θ) 1 ≤ j ≤ qi (10)\nTo compute the network parameter θ, we maximize the log likelihood J (θ) through stochastic gradient descent over mini-batches with the Adadelta (Zeiler, 2012) update rule.", 
        "112": "5 Experiments  In this section, we first manually evaluate our automatically labeled data.", 
        "113": "Then, we conduct automatic evaluations for our labeled data based on ACE corpus and analyze effects of different approaches to automatically label training data.", 
        "114": "Finally, we shows the performance of DMCNNs-MIL on our automatically labeled data.", 
        "115": "5.1 Our Automatically Labeled Data  By using the proposed methods, a large set of labeled data could be generated automatically.", 
        "116": "Table 2 shows the statistics of the five largest automatically labeled events among selected 21 Freebase events.", 
        "117": "Two hyper parameters, the number of key arguments and the value of TR in our automatically data labeling, are set as 2 and 0.8, by grid search respectively.", 
        "118": "When we merely use two key arguments to label data, we will obtain 421, 602 labeled sentences.", 
        "119": "However, these sentences miss labeling triggers.", 
        "120": "Thus, we leverage these rough labeled data and FrameNet to find triggers and use SDS to generate labeled data.", 
        "121": "Finally, 72, 611 labeled sentences are generated automatically.", 
        "122": "Compared with nearly 6, 000 human annotated labeled sentence in ACE, our method can automatically generate large scale labeled training data.", 
        "123": "5.2 Manual Evaluations of Labeled Data  We firstly manually evaluate the precision of our automatically generated labeled data.", 
        "124": "We randomly select 500 samples from our automatically labeled data.", 
        "125": "Each selected sample is a sentence with a highlighted trigger, labeled arguments and corresponding event type and argument roles.", 
        "126": "Figure 5 gives some samples.", 
        "127": "Annotators are asked to assign one of two labels to each sample.", 
        "128": "“Y”: the word highlighted in the given sentence indeed triggers an event of the corresponding type or the word indeed plays the corresponding role in that event.", 
        "129": "Otherwise “N” is labeled.", 
        "130": "It is very easy to annotate a sample for annotators, thus the annotated results are expected to be of high quality.", 
        "131": "Each sample is independently annotated by three annotators6 (including one of the authors and two of our colleagues who are familiar with event extraction task) and the final decision is made by voting.", 
        "132": "We repeat above evaluation process on the final 72, 611 labeled data three times and the average precision is shown in Table 3.", 
        "133": "Our automatically generated data can achieve a precision of 88.9 and 85.4 for trigger labeling and argument labeling re-\n6The inter-agreement rate is 87.5%\nspectively, which demonstrates that our automatically labeled data is of high quality.", 
        "134": "5.3 Automatic Evaluations of Labeled Data  To prove the effectiveness of the proposed approach automatically, we add automatically generated labeled data into ACE dataset to expand the training sets and see whether the performance of the event extractor trained on such expanded training sets is improved.", 
        "135": "In our automatically labeled data, there are some event types that can correspond to those in ACE dataset.", 
        "136": "For example, our people.marriage events can be mapped to life.marry events in ACE2005 dataset.", 
        "137": "We mapped these types of events manually and we add them into ACE training corpus in two ways.", 
        "138": "(1) we delete the human annotated ACE data for these mapped event types in ACE dataset and add our automatically labeled data to remainder ACE training data.", 
        "139": "We call this Expanded Data (ED) as ED Only.", 
        "140": "(2) We directly add our automatically labeled data of mapped event types to ACE training data and we call this training data as ACE+ED.", 
        "141": "Then we use such data to train the same event extraction model (DMCNN) and evaluate them on the ACE testing data set.", 
        "142": "Following (Nguyen et al., 2016; Chen et al., 2015; Li et al., 2013), we used the same test set with 40 newswire articles and the same development set with 30 documents and the rest 529 documents are used for ACE training set.", 
        "143": "And we use the same evaluation metric P, R, F as ACE task defined.", 
        "144": "We select three baselines trained with ACE data.", 
        "145": "(1) Li’s structure, which is the best reported structured-based system (Li et al., 2013).", 
        "146": "(2) Chen’s DMCNN, which is the best reported CNN-based system (Chen et al., 2015).", 
        "147": "(3) Nguyen’s JRNN, which is the state-ofthe-arts system (Nguyen et al., 2016).", 
        "148": "The results are shown in Table 4.", 
        "149": "Compared with all models, DMCNN trained with ACE+ED achieves the highest performance.", 
        "150": "This demonstrates that our automatically generated labeled\ndata could expand human annotated training data effectively.", 
        "151": "Moreover, compared with Chen’s DMCNN trained with ACE, DMCNN trained with ED Only achieves a competitive performance.", 
        "152": "This demonstrates that our large scale automatically labeled data is competitive with elaborately humanannotated data.", 
        "153": "5.4 Discussion  Impact of Key Rate\nIn this section, we prove the effectiveness of KR to find key arguments and explore the impact of different numbers of key arguments to automatically generate data.", 
        "154": "We specifically select two methods as baselines for comparison with our KR method: ER and RS, which use the event relevance and role salience to sort arguments of each type of events respectively.", 
        "155": "Then we choose the same number of key arguments in all methods and use these key arguments to label data.", 
        "156": "After that we evaluate these methods by using above automatic evaluations based on ACE data.", 
        "157": "Results are shown in Table 5.", 
        "158": "ACE+KR achieve the best performance in both stages.", 
        "159": "This demonstrates the effectiveness of our KR methods.", 
        "160": "To explore the impact of different numbers of key arguments, we sort all arguments of each type of events according to KR value and select top k arguments as the key arguments.", 
        "161": "Examples are shown in Table 2.", 
        "162": "Then we automatically evaluate the performance by using automatic evaluations proposed above.", 
        "163": "Figure 6 shows the results, when we set k = 2, the method achieves a best\nperformance in both stages.", 
        "164": "Then, the F1 value reduces as k grows.", 
        "165": "The reason is that the heuristics for data labeling are stricter as k grows.", 
        "166": "As a result, less training data is generated.", 
        "167": "For example, if k = 2, we will get 25, 797 sentences labeled as people.marriage events and we will get 534 labeled sentences, if k = 3.", 
        "168": "However, when we set k = 1, although more labeled data are generated, the precision could not be guaranteed.", 
        "169": "Impact of Trigger Rate and FrameNet\nIn this section, we prove the effectiveness of TR and FrameNet to find triggers.", 
        "170": "We specifically select two methods as baselines: TCF and TETF.", 
        "171": "TCF, TETF and TR respectively use the trigger candidate frequency, trigger event type frequency and trigger rate to sort trigger candidates of each type of events.", 
        "172": "Then we generate initial trigger lexicon by using all trigger candidates with high TCF value, TETF value or TR value.", 
        "173": "We set these hyper parameters as 0.8, 0.9 and 0.8, respectively, which are determined by grid search from (0.5, 0.6, 0.7, 0.8, 0.9, 1.0).", 
        "174": "FrameNet was used to filter noisy verbal triggers and expand nominal triggers.", 
        "175": "Trigger examples generated by TR+Framenet are shown in Table 2.", 
        "176": "Then we evaluate the performance of these methods by using above automatic evaluations.", 
        "177": "Results are shown in Table 6, Compared with ACE+TCF and ACE+TETF, ACE+TR gains a higher performance in both stages.", 
        "178": "It demonstrates the effectiveness of our TR methods.", 
        "179": "When we use FrameNet to generate triggers, compared with ACE+TR, we get a 1.0 improvement on trigger classification and a 1.7 improvement on argument classification.", 
        "180": "Such improvements are higher than improvements gained by other methods (TCF, IEF, TR), which demonstrates the effectiveness of the usage of FrameNet.", 
        "181": "5.5 Performance of DMCNN-MIL  Following previous work (Mintz et al., 2009) in distant supervised RE, we evaluate our method in two ways: held-out and manual evaluation.", 
        "182": "Held-out Evaluation In the held-out evaluation, we hold out part of the Freebase event data during training, and compare newly discovered event instances against this heldout data.", 
        "183": "We use the following criteria to judge the correctness of each predicted event automatically: (1) An event is correct if its key arguments and event type match those of an event instance in Freebase; (2) An argument is correctly classified if its event type and argument role match those of any of the argument instance in the corresponding Freebase event.", 
        "184": "Figure 7 and Figure 8 show the precision-recall (P-R) curves for each method in the two stages of event extraction respectively.", 
        "185": "We can see that multi-instance learning is effective to alleviate the noise problem in our distant supervised event extraction.", 
        "186": "Human Evaluation Because the incomplete nature of Freebase, heldout evaluation suffers from false negatives problem.", 
        "187": "We also perform a manual evaluation to eliminate these problems.", 
        "188": "In the manual evaluation, we manually check the newly discovered event instances that are not in Freebase.", 
        "189": "Because the number of these event instances in the test data is unknown, we cannot calculate the recall in this case.", 
        "190": "Instead, we calculate the precision of the top n extracted event instances.", 
        "191": "The human evaluation results are presented in Table 7.", 
        "192": "We can see that DMCNNs-MIL achieves the best performance.", 
        "193": "6 Related Work  Most of previous event extraction work focused on supervised learning paradigm and trained event extractors on human-annotated data which yield relatively high performance.", 
        "194": "(Ahn, 2006; Ji and Grishman, 2008; Hong et al., 2011; McClosky et al., 2011; Li et al., 2013, 2014; Chen et al., 2015; Nguyen and Grishman, 2015; Nguyen et al., 2016).", 
        "195": "However, these supervised methods depend on the quality of the training data and labeled training data is expensive to produce.", 
        "196": "Unsupervised methods can extract large numbers of events without using labeled data (Chambers and Jurafsky, 2011; Cheung et al., 2013; Huang et al., 2016).", 
        "197": "But extracted events may not be easy to be mapped to events for a particular knowledge base.", 
        "198": "Distant supervision have been used in relation extraction for automatically labeling training data (Mintz et al., 2009; Hinton et al., 2012; Krause et al., 2012; Krishnamurthy and Mitchell, 2012; Berant et al., 2013; Surdeanu et al., 2012; Zeng et al., 2015).", 
        "199": "But DS for RE cannot directly use for EE.", 
        "200": "For the reasons that an event is more complicated than a relation and the task of EE is more difficult than RE.", 
        "201": "The best reported supervised RE and EE system got a F1-score of 88.0% (Wang et al., 2016) and 55.4% (Nguyen et al., 2016) respectively.", 
        "202": "Reschke et al.", 
        "203": "(2014) extended the distant supervision approach to fill slots in plane crash.", 
        "204": "However, the method can only extract arguments of one plane crash type and need flight number strings as input.", 
        "205": "In other words, the approach cannot extract whole event with different types automatically.", 
        "206": "7 Conclusion and Future Work  In this paper, we present an approach to automatically label training data for EE.", 
        "207": "The experimental\nresults show the quality of our large scale automatically labeled data is competitive with elaborately human-annotated data.", 
        "208": "Also, we provide a DMCNN-MIL model for this data as a baseline for further research.", 
        "209": "In the future, we will use the proposed automatically data labeling method to more event types and explore more models to extract events by using automatically labeled data.", 
        "210": "Acknowledgments  This work was supported by the Natural Science Foundation of China (No.", 
        "211": "61533018) and the National Basic Research Program of China (No.", 
        "212": "2014CB340503).", 
        "213": "And this research work was also supported by Google through focused research awards program."
    }, 
    "document_id": "P17-1038.pdf.json"
}
