{
    "abstract_sentences": {
        "1": "Named entities are frequently used in a metonymic manner.", 
        "2": "They serve as references to related entities such as people and organisations.", 
        "3": "Accurate identification and interpretation of metonymy can be directly beneficial to various NLP applications, such as Named Entity Recognition and Geographical Parsing.", 
        "4": "Until now, metonymy resolution (MR) methods mainly relied on parsers, taggers, dictionaries, external word lists and other handcrafted lexical resources.", 
        "5": "We show how a minimalist neural approach combined with a novel predicate window method can achieve competitive results on the SemEval 2007 task on Metonymy Resolution.", 
        "6": "Additionally, we contribute with a new Wikipedia-based MR dataset called RelocaR, which is tailored towards locations as well as improving previous deficiencies in annotation guidelines."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1248–1259 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1115  1 Introduction  In everyday language, we come across many types of figurative speech.", 
        "2": "These irregular expressions are understood with little difficulty by humans but require special attention in NLP.", 
        "3": "One of these is metonymy, a type of common figurative language, which stands for the substitution of the concept, phrase or word being meant with a semantically related one.", 
        "4": "For example, in “Moscow traded gas and aluminium with Beijing.”, both location names were substituted in place of governments.", 
        "5": "Named Entity Recognition (NER) taggers have no provision for handling metonymy, meaning that this frequent linguistic phenomenon goes largely undetected within current NLP.", 
        "6": "Classi-\nfication decisions presently focus on the entity using features such as orthography to infer its word sense, largely ignoring the context, which provides the strongest clue about whether a word is used metonymically.", 
        "7": "A common classification approach is choosing the N words to the immediate left and right of the entity or the whole paragraph as input to the model.", 
        "8": "However, this “greedy” approach also processes input that should in practice be ignored.", 
        "9": "Metonymy is problematic for applications such as Geographical Parsing (Monteiro et al., 2016; Gritta et al., 2017, GP) and other information extraction tasks in NLP.", 
        "10": "In order to accurately identify and ground location entities, for example, we must recognise that metonymic entities constitute false positives and should not be treated the same way as regular locations.", 
        "11": "For example, in “London voted for the change.”, London refers to the concept of “people” and should not be classified as a location.", 
        "12": "There are many types of metonymy (Shutova et al., 2013), however, in this paper, we primarily address metonymic location mentions with reference to GP and NER.", 
        "13": "Contributions: (1) We investigate how to improve classification tasks by introducing a novel minimalist method called Predicate Window (PreWin), which outperforms common feature selection baselines.", 
        "14": "Our final minimalist classifier is comparable to systems which use many external features and tools.", 
        "15": "(2) We improve the annotation guidelines in MR and contribute with a new Wikipedia-based MR dataset called ReLocaR to address the training data shortage.", 
        "16": "(3) We make an annotated subset of the CoNLL 2003 (NER) Shared Task available for extra MR training data, alongside models, tools and other data.", 
        "17": "1248  2 Related Work  Some of the earliest work on MR that used an approach similar to our method (machine learning and dependency parsing) was by Nissim and Markert (2003a).", 
        "18": "The decision list classifier with backoff was evaluated using syntactic head-modifier relations, grammatical roles and a thesaurus to overcome data sparseness and generalisation problems.", 
        "19": "However, the method was still limited for classifying unseen data.", 
        "20": "Our method uses the same paradigm but adds more features, a different machine learning architecture and a better usage of the parse tree structure.", 
        "21": "Much of the later work on MR comes from the SemEval 2007 Shared Task 8 (Markert and Nissim, 2007) and later by Markert and Nissim (2009).", 
        "22": "The feature set of Nissim and Markert (2003a) was updated to include: grammatical role of the potentially metonymic word (PMW) (such as subj, obj), lemmatised head/modifier of PMW, determiner of PMW, grammatical number of PMW (singular, plural), number of words in PMW and number of grammatical roles of PMW in current context.", 
        "23": "The winning system by Farkas et al.", 
        "24": "(2007) used these features and a maximum entropy classifier to achieve 85.2% accuracy.", 
        "25": "This was also the “leanest” system but still made use of feature engineering and some external tools.", 
        "26": "Brun et al.", 
        "27": "(2007) achieved 85.1% accuracy using local syntactical and global distributional features generated with an adapted, proprietary Xerox deep parser.", 
        "28": "This was the only unsupervised approach, based on using syntactic context similarities calculated on large corpora such as the the British National Corpus (BNC) with 100M tokens.", 
        "29": "Nastase and Strube (2009) used a Support Vector Machine (SVM) with handcrafted features (in addition to the features provided by Markert and Nissim (2007)) including grammatical collocations extracted from the BNC to learn selectional preferences, WordNet 3.0, Wikipedia’s category network, whether the entity “has-a-product” such as Suzuki and whether the entity “has-an-event” such as Vietnam (both obtained from Wikipedia).", 
        "30": "The bigger set of around 60 features and leveraging global (paragraph) context enabled them to achieve 86.1% accuracy.", 
        "31": "Once again, we draw attention to the extra training, external tools and additional feature generation.", 
        "32": "Similar recent work by Nastase and Strube (2013) which extends that of Nastase et al.", 
        "33": "(2012) involved transforming Wikipedia into a large-scale multilingual concept network called WikiNet.", 
        "34": "By building on Wikipedia’s existing network of categories and articles, their method automatically discovers new relations and their instances.", 
        "35": "As one of their extrinsic evaluations, metonymy resolution was tested.", 
        "36": "Global context (whole paragraph) was used to interpret the target word.", 
        "37": "Using an SVM and a powerful knowledge base built from Wikipedia, the highest performance to date (a 0.1% improvement from Nastase and Strube (2009)) was achieved at 86.2%, which has remained the SOTA until now.", 
        "38": "The related work on MR so far has made limited use of dependency trees.", 
        "39": "Typical features came in the form of a head dependency of the target entity, its dependency label and its role (subj-of-win, dobj-of-visit, etc).", 
        "40": "However, other classification tasks made good use of dependency trees.", 
        "41": "Liu et al.", 
        "42": "(2015) used the shortest dependency path and dependency sub-trees successfully to improve relation classification (new SOTA on SemEval 2010 Shared Task).", 
        "43": "Bunescu and Mooney (2005) show that using dependency trees to generate the input sequence to a model performs well in relation extraction tasks.", 
        "44": "Dong et al.", 
        "45": "(2014) used dependency parsing for Twitter sentiment classification to find the words syntactically connected to the target of interest.", 
        "46": "Joshi and Penstein-Rosé (2009) used dependency parsing to explore how features based on syntactic dependency relations can be used to improve performance on opinion mining.", 
        "47": "In unsupervised lymphoma (type of cancer) classification, Luo et al.", 
        "48": "(2014) constructed a sentence graph from the results of a two-phase dependency parse to mine pathology reports for the relationships between medical concepts.", 
        "49": "Our methods also exploit the versatility of dependency parsing to leverage information about the sentence structure.", 
        "50": "2.1 SemEval 2007 Dataset  Our main standard for performance evaluation is the SemEval 2007 Shared Task 8 (Markert and Nissim, 2007) dataset first introduced in Nissim and Markert (2003b).", 
        "51": "Two types of entities were evaluated, organisations and locations, randomly retrieved from the British National Corpus (BNC).", 
        "52": "We only use the locations dataset, which comprises a train (925 samples) and a test (908 samples) partition.", 
        "53": "For medium evaluation, the classes are literal (geographical territories and political entities), metonymic (place-for-people, place-forproduct, place-for-event, capital-for-government or place-for-organisation) and mixed (metonymic and literal frames invoked simultaneously or unable to distinguish).", 
        "54": "The metonymic class further breaks down into two levels of subclasses allowing for fine evaluation.", 
        "55": "The class distribution within SemEval is approx 80% literal, 18% metonymic and 2% mixed.", 
        "56": "This seems to be the approximate natural distribution of the classes for location metonymy, which we have also observed while sampling Wikipedia for our new dataset.", 
        "57": "3 Our Approach  Our contribution broadly divides into two main parts, data and methodology.", 
        "58": "Section 3 introduces our new dataset, Section 4 introduces our new feature extraction method.", 
        "59": "3.1 Design and Motivation  As part of our contribution, we created a new MR dataset called ReLocaR (Real Location Retrieval), partly due to the lack of quality annotated train/test data and partly because of the shortcomings with the SemEval 2007 dataset (see Section 3.2).", 
        "60": "Our corpus is designed to evaluate the capability of a classifier to distinguish literal, metonymic and mixed location mentions.", 
        "61": "In terms of dataset size, ReLocaR contains 1,026 training and 1,000 test instances.", 
        "62": "The data was sampled using Wikipedia’s Random Article API1.", 
        "63": "We kept the sentences, which contained at least one of the places from a manually compiled list2 of countries and capitals of the world.", 
        "64": "The natural distribution of literal versus metonymic examples is approximately 80/20 so we had to discard the excess literal examples during sampling to balance the classes.", 
        "65": "3.2 ReLocaR - Improvements over SemEval  1.", 
        "66": "We do not break down the metonymic class further as the distinction between the subclasses is subtle and hard to agree on.", 
        "67": "2.", 
        "68": "The distribution of the three classes in ReLocaR (literal, metonymic, mixed) is approximately 1https://www.mediawiki.org/wiki/API:Random 2https://github.com/milangritta/Minimalist-LocationMetonymy-Resolution/data/locations.txt\n(49%, 49%, 2%) eliminating the high bias (80%, 18%, 2%) of SemEval.", 
        "69": "We will show how such a high bias transpires in the test results (Section 5).", 
        "70": "3.", 
        "71": "We have reviewed the annotation of the test partition and found that we disagreed with up to 11% of the annotations.", 
        "72": "Zhang and Gelernter (2015) disagreed with the annotation 8% of the time.", 
        "73": "Poibeau (2007) also challenged some annotation decisions.", 
        "74": "ReLocaR was annotated by 4 trained linguists (undergraduate and graduate) and 2 computational linguists (authors).", 
        "75": "Linguists were independently instructed (see section 3.3) to assign one of the two classes to each example with little guidance.", 
        "76": "We leveraged their linguistic training and expertise to make decisions rather than imposing some specific scheme.", 
        "77": "Unresolved sentences would receive the mixed class label.", 
        "78": "4.", 
        "79": "The most prominent difference is a small change in the annotation scheme (after independent linguistic advice).", 
        "80": "The SemEval 2007 Task 8 annotation scheme (Markert and Nissim, 2007) considers the political entity interpretation a literal reading.", 
        "81": "It suggests that in “Britain’s current account deficit...”, Britain refers to a literal location, rather than a government (which is an organisation).", 
        "82": "This is despite acknowledging that “The locative and the political sense is often distinguished in dictionaries as well as in the ACE annotation scheme...”.", 
        "83": "In ReLocaR datasets, we consider a political entity a metonymic reading.", 
        "84": "3.2.1 Why government is not a location  A government/nation/political entity is semantically much closer to Organisation/Person than a Location.", 
        "85": "“Moscow talks to Beijing.” does not tell us where this is happening.", 
        "86": "It most likely means a politician is talking to another politician.", 
        "87": "These are not places but people and/or groups.", 
        "88": "It is paramount to separate references to “inanimate” places from references to “animate” entities.", 
        "89": "3.3 Annotation Guidelines (Summary)  ReLocaR has three classes, literal, metonymic and mixed.", 
        "90": "Literal reading comprises territorial interpretations (the geographical territory, the land, soil and physical location) i.e.", 
        "91": "inanimate places that serve to point to a set of coordinates (where something might be located and/or happening) such as “The treaty was signed in Italy.”, “Peter comes from Russia.”, “Britain’s\nAndy Murray won the Grand Slam today.”, “US companies increased exports by 50%.”, “China’s artists are among the best in the world.” or “The reach of the transmission is as far as Brazil.”.", 
        "92": "A metonymic reading is any location occurrence that expresses animacy (Coulson and Oakley, 2003) such as “Jamaica’s indifference will not improve the negotiations.”, “Sweden’s budget deficit may rise next year.”.", 
        "93": "The following are other metonymic scenarios: a location name, which stands for any persons or organisations associated with it such as “We will give aid to Afghanistan.”, a location as a product such as “I really enjoyed that delicious Bordeaux.”, a location posing as a sports team “India beat Pakistan in the playoffs.”, a governmental or other legal entity posing as a location “Zambia passed a new justice law today.”, events acting as locations “Vietnam was a bad experience for me”.", 
        "94": "The mixed reading is assigned in two cases: either both readings are invoked at the same time such as in “The Central European country of Slovakia recently joined the EU.” or there is not enough context to ascertain the reading i.e.", 
        "95": "both are plausible such as in “We marvelled at the art of ancient Mexico.”.", 
        "96": "In difficult cases such as these, the mixed class is assigned.", 
        "97": "3.4 Inter-Annotator Agreement  We give the IAA for the test partition only.", 
        "98": "The whole dataset was annotated by the first author as the main annotator.", 
        "99": "Two pairs of annotators (4 linguists) then labelled 25% of the dataset each for a 3-way agreement.", 
        "100": "The agreement before adjudication was 91% and 93%, 97.2% and 99.2% after adjudication (for pair one and two respectively).", 
        "101": "The other 50% of sentences were then once again labelled by the main annotator with a 97% agreement with self.", 
        "102": "The remainder of the sentences (unable to agree on among annotators even after adjudication) were labelled as a mixed class (1.8% of all sentences).", 
        "103": "3.5 CoNLL 2003 and MR  We have also annotated a small subset of the CoNLL 2003 NER Shared Task data for metonymy resolution (locations only).", 
        "104": "Respecting the Reuters RCV1 Corpus (Lewis et al., 2004)\ndistribution permissions3, we make only a heavily processed subset available on GitHub4.", 
        "105": "There are 4,089 positive (literal) and 2,126 negative (metonymic) sentences to assist with algorithm experimentation and model prototyping.", 
        "106": "Due to the lack of annotated training data for MR, this is a valuable resource.", 
        "107": "The data was annotated by the first author, there are no IAA figures.", 
        "108": "4 Methodology    4.1 Predicate Window (PreWin)  Through extensive experimentation and observation, we arrived at the intuition behind PreWin, our novel feature extraction method.", 
        "109": "The classification decision of the class of the target entity is mostly informed not by the whole sentence (or paragraph), rather it is a small and focused “predicate window” pointed to by the entity’s head dependency.", 
        "110": "In other words, most of the sentence is not only superfluous for the task, it actually lowers the accuracy of the model due to irrelevant input.", 
        "111": "This is particularly important in metonymy resolution as the entity’s surface form is not taken into consideration, only its context.", 
        "112": "In Figure 1, we show the process of extracting the Predicate Window from a sample sentence (more examples are available in the Appendix).", 
        "113": "We start by using the SpaCy dependency parser by Honnibal and Johnson (2015), which is the fastest in the world, open source and highly customisable.", 
        "114": "Each dependency tree provides the following features: dependency labels and entity head dependency.", 
        "115": "Rather than using most of the tree, we only use a single local head dependency relationship to point to the predicate.", 
        "116": "Leveraging a dependency parser helps PreWin with selecting the minimum relevant input to the model while discarding irrelevant input, which may cause the neural model to behave unpredictably.", 
        "117": "Finally, the entity itself is never used as input in any of our methods, we only rely on context.", 
        "118": "PreWin then extracts up to 5 words and their dependency labels starting at the head of the entity (see the next paragraph for exceptions), going in the away (from the entity) direction.", 
        "119": "The method always skips the conjunct (“and”, “or”) 3http://trec.nist.gov/data/reuters/reuters.html 4https://github.com/milangritta/Minimalist-LocationMetonymy-Resolution\nrelationships in order to find the predicate (see Figure 3 in the Appendix for a visual example of why this is important).", 
        "120": "The reason for the choice of 5 words is the balance between too much input, feeding the model with less relevant context and just enough context to capture the necessary semantics.", 
        "121": "We have experimented with lengths of 3-10 words, however 5 words typically achieved the best results.", 
        "122": "The following are the three types of exceptions when the output will not start with the head of the entity.", 
        "123": "In these cases, PreWin will include the neighbouring word as well.", 
        "124": "In a sentence “The pub is located in southern Zambia.”, the head of the entity is “in”, however in this case PreWin will include “southern” (adjectival modifier) as this carries important semantics for the classification.", 
        "125": "Similarly, PreWin will also include the neighbouring compound noun as in: “Lead coffins were very rare in colonial America.”, the output will include “colonial” as a feature plus the next four words.", 
        "126": "In another sentence: “Vancouver’s security is the best in the world.’, PreWin will include the “’s” (case) plus the next four words continuing from the head of the entity (the word “security”).", 
        "127": "4.2 Neural Network Architecture  The output of PreWin is used to train the following machine learning model.", 
        "128": "We decided to use the Long Short Term Memory (LSTM) architecture by Keras5 (Chollet, 2015).", 
        "129": "Two LSTMs are used, one for the left and right side (up to 5 words each).", 
        "130": "Two fully connected (dense) layers are used for the left and right dependency relation labels (up to\n5https://keras.io/\n5 labels each, encoded as one-hot).", 
        "131": "The full architecture is available in the Appendix, please see Figure 2.", 
        "132": "You can download the models and data from GitHub6.", 
        "133": "LSTMs are excellent at processing language sequences (Hochreiter and Schmidhuber, 1997; Sak et al., 2014; Graves et al., 2013), which is why we use this architecture.", 
        "134": "It allows the model to encode the word sequences, preserve important word order and provide superior classification performance.", 
        "135": "Both the Multilayer Perceptron and the Convolutional Neural Network were consistently inferior (typically 5% - 10% lower accuracy) in our earlier performance comparisons.", 
        "136": "For all experiments, we used a vocabulary of the first (most frequent) 100,000 word vectors in GloVe7 (Pennington et al., 2014).", 
        "137": "Finally, unless explicitly stated otherwise, the standard dimension of word embeddings was 50, which we found to work best.", 
        "138": "4.3 “Immediate” Baseline  A common approach in lexical classification tasks is choosing the 5 to 10 words to the immediate right and left of the entity as input to a model (Mikolov et al., 2013; Mesnil et al., 2013; Baroni et al., 2014; Collobert et al., 2011).", 
        "139": "We evaluate this method (its 5 and 10-word variant) alongside PreWin and Paragraph.", 
        "140": "4.4 Paragraph Baseline  The paragraph baseline method extends the “immediate” one by taking 50 words from each side of the entity as the input to the classifier.", 
        "141": "In practice, this extends the feature window to include extrasentential evidence in the paragraph.", 
        "142": "This ap-\n6https://github.com/milangritta/Minimalist-LocationMetonymy-Resolution 7http://nlp.stanford.edu/projects/glove/\nproach is also popular in machine learning (Melamud et al., 2016; Zhang et al., 2016).", 
        "143": "4.5 Ensemble of Models  In addition to a single best performing model, we have combined several models trained on different data and/or using different model configurations.", 
        "144": "For the SemEval test, we combined three separate models trained on the newly annotated CoNLL dataset and the training data for SemEval.", 
        "145": "For the ReLocaR test, we once again let three models vote, trained on CooNLL and ReLocaR data.", 
        "146": "5 Results  We evaluate all methods using three datasets for training (ReLocaR, SemEval, CoNLL) and two for testing (ReLocaR, SemEval).", 
        "147": "Due to inherent randomness in the deep learning libraries, we performed 10 runs for each setup and averaged the figures (we also report standard deviation).", 
        "148": "5.1 Metrics and Significance  Following the SemEval 2007 convention, we use two metrics to evaluate performance, accuracy and f-scores (for each class).", 
        "149": "We only evaluate at the coarse level, which means literal versus nonliteral (metonymic and mixed are merged into one class).", 
        "150": "In terms of statistical significance, our best score on the SemEval dataset (908 samples) is not significant at the 95% confidence level.", 
        "151": "However, the accuracy improvements of PreWin over the common baselines are highly statistically significant with 99.9%+ confidence.", 
        "152": "5.2 Predicate Window  Tables 1 and 2 show PreWin performing consistently better than other baselines, in many instances, significantly better and with fewer words (smaller input).", 
        "153": "The standard deviation is also lower for PreWin meaning more stable test runs.", 
        "154": "Compared with the 5 and 10 window “immediate” baseline, which is the common approach in classification, PreWin is more discriminating with its input.", 
        "155": "Due to the linguistic variety and the myriad of ways the target word sense can be triggered in a sentence, it is not always the case that the 5 or 10 nearest words inform us of the target entity’s meaning/type.", 
        "156": "We ought to ask what else is being expressed in the same 5 to 10-word window?", 
        "157": "Conventional classification methods (Immediate, Paragraph) can also be seen as prioritising either feature precision or feature recall.", 
        "158": "Paragraph maximises the input sequence size, which maximises recall at the expense of including features that are either irrelevant or mislead the model, lowering precision.", 
        "159": "Immediate baseline maximises precision by using features close to the target entity at the expense of missing important features positioned outside of its small window, lowering recall.", 
        "160": "PreWin can be understood as an integration of both approaches.", 
        "161": "It retains high precision by limiting the size of the feature window to 5 while maximising recall by searching anywhere in the sentence, frequently outside of a limited “immediate” window.", 
        "162": "Perhaps we can also caution against a simple adherence to Firth (1957) “You shall know a word by the company it keeps”.", 
        "163": "This does not appear to be the case in our experiments as PreWin regularly performs better than the “immediate” baseline.", 
        "164": "Further prototypical examples of the method can be viewed in the Appendix.", 
        "165": "Our intuition that most words in the sentence, indeed in the paragraph do not carry the semantic information required to classify the target entity is ultimately based on evidence.", 
        "166": "The model uses only a small window, linked to the entity via a head dependency relationship for the final classification decision.", 
        "167": "5.3 Common Errors  Most of the time (typically 85% for the two datasets), PreWin is sufficient for an accurate classification.", 
        "168": "However, it does not work well in some cases.", 
        "169": "The typical 15% error rate breaks down as follows (percentages were estimated based on extensive experimentation and observation):\nDiscarding important context (3%): Sometimes the 5 or 10 word “immediate” baseline method would actually have been preferred such as in the sentence “...REF in 2014 ranked Essex in the top 20 universities...”.", 
        "170": "PreWin discards the right-hand side input, which is required in this case for a correct classification.", 
        "171": "Since ”ranked” is the head of ”Essex”, the rest of the sentence gets ignored and the valuable context gets lost.", 
        "172": "More complex semantic patterns (11%): Many common mistakes were due to the lack\nof the model’s understanding of more complex predicates such as in the following sentences: “ ...of military presence of Germany.”, “Houston also served as a member and treasurer of the...” or ”...invitations were extended to Yugoslavia ...”.", 
        "173": "We think this is due to a lack of training data (around 1,000 sentences per dataset).", 
        "174": "Additional examples such as “...days after the tour had exited Belgium.” expose some of the limitations of the neural model to recognise uncommon ways of expressing a reference to a literal place.", 
        "175": "Recall that no external resources or tools were used to supplement the training/features, the model had to learn to generalise from what it has seen during training, which was limited in our experiments.", 
        "176": "Parsing mistakes (1%): were less common though still present.", 
        "177": "It is important to choose the right dependency parser for the task since different parsers will often generate slightly different parse trees.", 
        "178": "We have used SpaCy8 for all our experiments, which is a Python-based industrial strength NLP library.", 
        "179": "Sometimes, tokenisation errors for acronyms like “U.S.A.” and wrongly hyphenated words may also cause parsing errors, however, this was infrequent.", 
        "180": "5.4 Flexibility of Neural Model  The top accuracy figures for ReLocaR are almost identical to SemEval.", 
        "181": "The highest single model\n8https://spacy.io/\naccuracy for ReLocaR was 83.6% (84.8% with Ensemble), which was within 0.5% of the equivalent methods for SemEval (83.1%, 84.6% for Ensemble).", 
        "182": "Both were achieved using the same methods (PreWin or Ensemble), neural architecture and size of corpora.", 
        "183": "When the models were trained on the CoNLL data, the accuracies were 82.8% and 79.5%.", 
        "184": "However, when the models trained on ReLocaR and tested on SemEval (and vice versa), accuracy dropped to between 62.4% and 69% showing that what was learnt does not seem to transfer well to another dataset.", 
        "185": "We think the reason for this is the difference in annotation guidelines; the government is a metonymic reading, not a literal one.", 
        "186": "This causes the model to make more mistakes.", 
        "187": "5.5 Ensemble Method  The highest accuracy and f-scores were achieved with the ensemble method for both datasets.", 
        "188": "We combined three models (previously described in section 4.5) for SemEval to achieve 84.6% accuracy and three models for ReLocaR to achieve 84.8% for the new dataset.", 
        "189": "Training separate models with different parameters and/or on different datasets does increase classification capability as various models learn distinct aspects of the task, enabling the 1.2 - 1.5% improvement.", 
        "190": "5.6 Dimensionality of Word Embeddings  We found that increasing dimension size (up to 300) did not materially improve performance.", 
        "191": "The neural network tended to overfit, even with fewer epochs, the results were comparable to our default 50-dimensional embeddings.", 
        "192": "We posit that fewer dimensions of the distributed word representations force the abstraction level higher as the meaning of words must be expressed more succinctly.", 
        "193": "We think this helps the model generalise better, particularly for smaller datasets.", 
        "194": "Lastly, learning word embeddings from scratch on datasets this small (around 1,000 samples) is possible but impractical, the performance typically decreases by around 5% if word embeddings are not initialised first.", 
        "195": "Dataset / Method Literal Non-Literal  5.7 F-Scores and Class Imbalance  Table 3 shows the SOTA f-scores, our best results for SemEval 2007 and the best f-scores for ReLocaR.", 
        "196": "The class imbalance inside SemEval (80% literal, 18% metonymic, 2% mixed) is reflected as a high bias in the final model.", 
        "197": "This is not the case with ReLocaR and its 49% literal, 49% metonymic and 2% mixed ratio of 3 classes.", 
        "198": "The model was equally capable of distinguishing between literal and non-literal cases.", 
        "199": "5.8 Another baseline  There was another baseline we tested, however, it was not covered anywhere so far because of its low performance.", 
        "200": "It was a type of extreme parse tree pruning, during which most of the sentence gets discarded and we only retain 3 to 4 content words.", 
        "201": "The method uses non-local (long range) dependencies to construct a short input sequence.", 
        "202": "However, the method was a case of ignoring too many relevant words and accuracy was fluctuating in the mid-60% range, which is why we did not report the results.", 
        "203": "However, it serves to further justify the choice of 5 words as the predicate window as fewer words caused the model to underperform.", 
        "204": "6 Discussion    6.1 NER, GP and Metonymy  We think the next frontier is a NER tagger, which actively handles metonymy.", 
        "205": "The task of labelling entities should be mainly driven by context rather than the word’s surface form.", 
        "206": "If the target entity looks like “London”, this should not mean the entity is automatically a location.", 
        "207": "Metonymy is a frequent linguistic phenomenon (around 20% of location mentions are metonymic, see section 3.1) and could be handled by NER taggers to enable many innovative downstream NLP applications.", 
        "208": "Geographical Parsing is a pertinent use case.", 
        "209": "In order to monitor/mine text documents for geographical information only, the current NER technology does not have a solution.", 
        "210": "We think it is incorrect for any NER tagger to label “Vancouver” as a location in “Vancouver welcomes you!”.", 
        "211": "A better output might be something like the following: Vancouver = location AND metonymy = True.", 
        "212": "This means Vancouver is usually a location but is used metonymically in this case.", 
        "213": "How this information is used will be up to the developer.", 
        "214": "Organisations behaving as persons, share prices or products are but a few other examples of metonymy.", 
        "215": "6.2 Simplicity and Minimalism  Previous work in MR such as most of the SemEval 2007 participants (Farkas et al., 2007; Nicolae et al., 2007; Leveling, 2007; Brun et al., 2007; Poibeau, 2007) and the more recent contributions used a selection of many of the following features/tools for classification: handmade trigger word lists, WordNet, VerbNet, FrameNet, extra features generated/learnt from parsing Wikipedia (approx 3B words) and BNC (approx 100M words), custom databases, handcrafted features, multiple (sometimes proprietary) parsers, Levin’s verb classes, 3,000 extra training instances from a corpus called MAScARA9 by Markert and Nissim (2002) and other extra resources including the SemEval Task 8 features.", 
        "216": "We managed to achieve comparable performance with a small neural network typically trained in no more than 5 epochs, minimal training data, a basic dependency parser and the new PreWin method by being highly discriminating in choosing signal over noise.", 
        "217": "9http://homepages.inf.ed.ac.uk/mnissim/mascara/  7 Conclusions and Future Work  We showed how a minimalist neural approach can replace substantial external resources, handcrafted features and how the PreWin method can even ignore most of the paragraph where the entity is positioned and still achieve competitive performance in metonymy resolution.", 
        "218": "The pressing new question is: “How much better the performance could have been if our method availed itself of the extra training data and resources used by previous works?” Indeed this may be the next research chapter for PreWin.", 
        "219": "We discussed how tasks such as Geographical Parsing can benefit from “metonymy-enhanced” NER tagging.", 
        "220": "We have also presented a case for better annotation guidelines for MR (after consulting with a number of linguists), which now means that a government is not a literal class, rather it is a metonymic one.", 
        "221": "We fully agreed with the rest of the previous annotation guidelines.", 
        "222": "We also introduced ReLocaR, a new corpus for (location) metonymy resolution and encourage researchers to make effective use of it (including the additional CoNLL 2003 subset we annotated for metonymy).", 
        "223": "Future work may involve testing PreWin on an NER task to see if and how it can generalise to a different classification task and how the results compare to the SOTA and similar methods such as that of Collobert et al.", 
        "224": "(2011) using the CoNLL 2003 NER datasets.", 
        "225": "Word Sense Disambiguation (Yarowsky, 2010; Pilehvar and Navigli, 2014) with neural networks (Melamud et al., 2016) is another related classification task suitable for testing PreWin.", 
        "226": "If it does perform better, this will be of considerable interest to classification research (and beyond) in NLP.", 
        "227": "Acknowledgments  We gratefully acknowledge the funding support of the Natural Environment Research Council (NERC) PhD Studentship NE/M009009/1 (Milan Gritta, DREAM CDT), EPSRC (Nigel Collier and Nut Limsopatham - Grant No.", 
        "228": "EP/M005089/1) and MRC (Mohammad Taher Pilehvar) Grant No.", 
        "229": "MR/M025160/1 for PheneBank."
    }, 
    "document_id": "P17-1115.pdf.json"
}
