{
    "abstract_sentences": {
        "1": "We propose a new method for extracting pseudo-parallel sentences from a pair of large monolingual corpora, without relying on any document-level information.", 
        "2": "Our method first exploits word embeddings in order to efficiently evaluate trillions of candidate sentence pairs and then a classifier to find the most reliable ones.", 
        "3": "We report significant improvements in domain adaptation for statistical machine translation when using a translation model trained on the sentence pairs extracted from in-domain monolingual corpora."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 392–398 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2062  1 Introduction  Parallel corpus is an indispensable resource for statistical and neural machine translation.", 
        "2": "Generally, using more sentence pairs to train a translation system makes it able to produce better translations.", 
        "3": "However, for most language pairs and domains, parallel corpora remain scarce due mainly to the cost of their creation (Germann, 2001).", 
        "4": "In the last two decades, numerous methods have been proposed to extract parallel sentences from comparable corpora.", 
        "5": "In addition to comparable corpora in large quantity, to the best of our knowledge, all previous methods heavily rely on document-level information and/or lexical translation models, such as those for statistical machine translation (SMT) systems (Zhao and Vogel, 2002; Fung and Cheung, 2004; Munteanu and Marcu, 2005; Tillmann and Xu, 2009) and manually-created bilingual lexicon (Utiyama and Isahara, 2003).", 
        "6": "The most successful approaches use cross-lingual information retrieval techniques (Abdul Rauf and Schwenk, 2011; S, tefănescu et al., 2012) to extract sentence pairs from comparable documents.", 
        "7": "Using such document pairs\nhas the strong advantage that it drastically reduces the search space; we need to consider only sentence pairs in each document pair instead of scoring all sentence pairs in the two monolingual corpora.", 
        "8": "However, in many cases, we do not have access to document-level information.", 
        "9": "Only Tillmann and Xu (2009) have explored this scenario using efficient caching strategies to extract useful sentence pairs from nearly one trillion candidates in comparable data.", 
        "10": "Yet, their approach is tightly related to the exploitation of accurate lexical translation models and does not allow us to introduce other features.", 
        "11": "The reliance on lexical translation models implies that we must have already access to parallel data sufficiently large for obtaining accurate estimates.", 
        "12": "Nevertheless, the most useful sentence pairs for SMT are actually the ones that contain infrequent or even unseen tokens in these parallel data.", 
        "13": "Relying only on lexical translation models thus seems rather inadequate to extract sentence pairs containing numerous infrequent or unseen tokens, and may actually be more prone to extract sentence pairs that contain words and phrases for which we already have accurate translation probability estimates.", 
        "14": "This paper proposes a new method that exploits word embeddings to efficiently extract pseudoparallel sentences1 from raw monolingual data without using any document-level information.", 
        "15": "We report significant improvements of translation quality in a domain adaptation scenario for SMT.", 
        "16": "2 Sentence pair extraction  During the sentence pair extraction, we do not assume an access to document-level information.", 
        "17": "Our method thus has to be efficient in evaluating\n1As in previous work, we regard the sentence pairs extracted by our method as “pseudo-parallel” because they are not necessarily parallel.", 
        "18": "As shown by Goutte et al.", 
        "19": "(2012), even very noisy parallel corpora may be useful for SMT.", 
        "20": "392\ntrillions of sentence pairs hypothesized from two monolingual corpora, each containing millions of sentences.", 
        "21": "To achieve this computationally challenging task, we need a fast way to compute some similarity between the source and target sentences, without relying on large lexical translation models that may not be available or accurate enough in some low-resourced conditions.", 
        "22": "2.1 Step 1: Filtering with sentence embeddings  Assuming the availability of large-scale monolingual data, our method exploits word embeddings (Mikolov et al., 2013b) that are fast to estimate.", 
        "23": "First, word embeddings for each language are learned from the given monolingual data.", 
        "24": "This enables us to evaluate arbitrary sentence pair given all the words it contains, which is not fully guaranteed by a lexical translation model as some tokens may be out-of-vocabulary (OOV).", 
        "25": "We then proceed to the projection of all the source word embeddings to the target embedding space, following Mikolov et al.", 
        "26": "(2013a),2 in order to represent both source and target words in the same space.", 
        "27": "To compute the similarity between arbitrary sentence pairs, we represent each sentence by averaging the embeddings of its constituent words.3\nAs a result of this first step, our method keeps for each source sentence the n closest target sentences (n being small, for instance with a value of 100) according to the similarity score.", 
        "28": "2.2 Step 2: Refining with a classifier  Given a far smaller search space, this second step evaluates and re-ranks the remaining sentence pairs, incorporating more complex features to train a classifier.", 
        "29": "We use a total of five features.", 
        "30": "For each sentence pair, we use the score computed in the first step and a more accurate similarity score based on alignments between word embeddings, following the work in Kajiwara and\n2Despite the availability of more accurate methods (Coulmance et al., 2015; Duong et al., 2016) we choose this method considering its low computational cost and its reasonable need of external resources to estimate the translation matrix, i.e., only a small bilingual dictionary.", 
        "31": "3As shown by Adi et al.", 
        "32": "(2016), this can be effective to encode sentence-level information such as content and length, while being computationally more efficient than other methods, such as inducing paragraph vectors (Le and Mikolov, 2014) and using LSTM auto-encoders (Li et al., 2015).", 
        "33": "Our decision also relies on the promising accuracy of linear projection of word (not sentence) embeddings across different languages (Mikolov et al., 2013a).", 
        "34": "Komachi (2016).", 
        "35": "They found out that the average of the cosine similarity between all the best word pairs, for each source word, taken from the sentence pair, shown in Eq.", 
        "36": "(1), was a good indicator of similarity between two sentences.", 
        "37": "S(x,y) = 1\n|x|\n|x|∑\ni=1\nmax j φ(xembi , y emb j ) (1)\nwhere x and y are respectively the source and target sentences, |x| the length of x, and φ the cosine similarity between the embeddings in the target language space of the i-th word in x, i.e., xembi , and the j-th word in y, i.e., yembj .", 
        "38": "The computation of this score can be highly costly, depending on the sentence length and the number of dimensions of the word embeddings.", 
        "39": "Thus, we compute this score only for the source to target direction, unlike Kajiwara and Komachi (2016).", 
        "40": "In many situations, we may also have an access to a lexical translation model trained on some parallel data.", 
        "41": "We therefore incorporate the scores proposed by Tillmann and Xu (2009), but considering one probability for each translation direction, instead of summing them up, so that our classifier can optimize their weight separately.", 
        "42": "P (x|y) = |x|∑\ni=1\n1 |x| log( 1 |y|\n|y|∑\nj=1\np(xtoki |ytokj )) (2)\nP (y|x) = |y|∑\nj=1\n1 |y| log( 1 |x|\n|x|∑\ni=1\np(ytokj |xtoki )) (3)\nwhere xtoki is the i-th token in x, y tok j the j-th token in y and p the probability given by an already estimated lexical translation model.", 
        "43": "Our last feature is the length ratio of the source and target sentences (Munteanu and Marcu, 2005).", 
        "44": "To assign a real-valued score to each sentence pair in order to filter and rank them, we train a Maximum Entropy (ME) classifier, following Munteanu and Marcu (2005).", 
        "45": "ME classifier suits particularly well our situation, since we deal with a small number of dense features and have hundred millions of sentence pairs to classify quickly.", 
        "46": "Positive examples for training the classifier can be obtained straightforwardly: we use true sentence pairs sampled from parallel data, different from the one used to train the lexical translation model.", 
        "47": "As for negative examples, Munteanu and Marcu (2005) randomly paired sentences from\ntheir parallel data using two constraints: a length ratio not greater than two, and a coverage constraint that considers a negative example only if more than half of the words of the source sentence has a translation in the given target sentence according to some bilingual lexicon.", 
        "48": "However, from a large parallel corpus, one can easily retrieve another target sentence, almost identical, containing most of the words that the true target sentence also contains.", 
        "49": "In this case, the negative example will be almost as semantically close as the positive one, weakening the discriminative power of the features based on word embeddings.", 
        "50": "To circumvent this problem, we generate negative examples, as many as positive examples, without using this coverage constraint.", 
        "51": "Having assigned a score for each sentence pair, we make a pseudo-parallel corpus selecting the target sentence with the best score for each source sentence and retaining only the sentence pairs with a score above some threshold, th .", 
        "52": "This pseudoparallel corpus can then be used to train a new phrase table.", 
        "53": "3 Experiments  We evaluated our method in a scenario of domain adaptation for phrase-based SMT (PBSMT).", 
        "54": "In this scenario, we assumed a lot of general-domain parallel data to train a general-domain phrase table and a lot of in-domain monolingual data as our source of in-domain pseudo-parallel sentences.", 
        "55": "3.1 Data and SMT system  We experimented with the French–English language pair, both translation directions, on the medical domain.", 
        "56": "We used Moses (Koehn et al., 2007) to train, tune, and test our PBSMT systems.", 
        "57": "The general-domain phrase table was trained on Europarl V74 (1.99M sentences).", 
        "58": "The in-domain monolingual data were prepared by applying the NLTK5 sentence segmenter to the concatenation of all the monolingual corpora provided for the WMT’14 medical translation task.6 As the source of extracting in-domain sentence pairs, we randomly sampled 1M sentences (33M tokens) from the French data and 5M sentences (164M tokens) from the English data.", 
        "59": "Given pseudo-parallel sentences extracted by our method from these data\n4http://statmt.org/europarl/ 5http://www.nltk.org/ 6http://statmt.org/wmt14/medical-task/\n(see Section 3.2), we trained an in-domain phrase table.", 
        "60": "Moses exploits the two phrase tables, i.e., general-domain and in-domain ones, with its multiple decoding path ability.", 
        "61": "The PBSMT systems used one language model trained on the entire target in-domain monolingual data concatenated to the target side of Europarl and News Crawl data provided by WMT’15.7 The development and test data used to tune and evaluate the PBSMT systems were excerpts of the EMEA parallel corpus (Carpuat et al., 2012).", 
        "62": "3.2 Parameters for sentence pair extraction  We used word2vec8 to learn word embeddings with the parameters -cbow 1 -window 10 -negative 15 -sample 1e-4 -iter 15 -min-count 1, specifying 800 and 300 dimensions for the source and target languages, respectively,9 on the same data used to train the language models.", 
        "63": "The translation matrix used to project the source word embeddings to the target embedding space was trained on a bilingual lexicon containing the 5k10 most frequent French tokens,11 from Europarl, and their most probable single token in English given by the Europarl phrase table.", 
        "64": "The first step of our method evaluated five trillion (1M×5M) sentence pairs and retained the 100 closest target sentences for each source sentence.", 
        "65": "The second step then dealt with only 100M (1M×100) sentence pairs.", 
        "66": "The lexical translation probabilities used to compute our features were given by the Europarl lexical translation models.", 
        "67": "We used Scikit-learn12 to train the ME classifier, with default parameters, on 5k positive and 5k negative examples13 randomly generated from the MultiUn corpus.14 According to the classifier’s score, only the 1-best target sentence for each source sentence was retained.", 
        "68": "We discarded sentence pairs having a score lower than a thresh-\n7http://statmt.org/wmt15/ 8http://word2vec.googlecode.com/ 9Mikolov et al.", 
        "69": "(2013a) observed that a more accurate projection is obtained when using a greater number of dimensions on the source side than that for the target side.", 
        "70": "10Vulić and Korhonen (2016) demonstrated that 5k word pairs is enough to train a useful translation matrix.", 
        "71": "11We extracted sentence pairs regarding French and English as source and target languages, respectively, but used the resulted parallel corpus for both translation directions.", 
        "72": "12http://scikit-learn.org/ 13We chose this number empirically through observing the\nclassification accuracy on a set of held-out sentence pairs.", 
        "73": "14http://opus.lingfil.uu.se/MultiUN.php\nold value.", 
        "74": "We examined {0.5, 0.6, 0.7, 0.8, 0.9} as the threshold value through tuning PBSMT systems, and determined 0.7 to be optimal.", 
        "75": "We regarded the method proposed by Tillmann and Xu (2009) as a baseline, because it does not rely on document-level information, as ours.", 
        "76": "Unlike our method, in addition to the constraint based on length ratio, this method also used the coverage constraint.", 
        "77": "As discussed in Section 2.2, this constraint speeds up the extraction, but sacrifices source sentences with numerous OOV due to its heavy reliance on a bilingual lexicon learned from parallel data.", 
        "78": "To measure the effect of the coverage constraint, we also activated it in some of our experiments using our method.", 
        "79": "Then, as for our method, we discarded sentence pairs having a score lower than a threshold value and found the threshold value of -10 to be the best among {-15, -12, -10, -7}.", 
        "80": "3.3 Results  Table 1 presents the results.", 
        "81": "Both the baseline and our methods outperformed the system using only the general-domain phrase table in both translation directions.", 
        "82": "This may be explained by the presence of highly parallel sentences in the in-domain monolingual data, from Wikipedia articles for instance, that can be retrieved by both methods.", 
        "83": "Our method significantly outperformed the baseline, with 1.4 and 1.7 BLEU points gains respectively for Fr→En and En→Fr.", 
        "84": "Our method,\nwith the optimal threshold of 0.7, extracted 361k sentence pairs from the in-domain monolingual data, while the baseline method extracted only 121k sentence pairs due presumably to the use of the coverage constraint that might remove source sentences with a high OOV ratio.", 
        "85": "Less OOV tokens remained with the system using our method, highlighting the positive effect of exploiting word embeddings in addition to lexical translation models.", 
        "86": "Activating the coverage constraint on our method was harmful and was significantly worse than the baseline.", 
        "87": "This constraint excludes candidate sentence pairs by relying only on generaldomain lexical translation models, while our classifier is trained to use word embeddings that are more robust but unhelpful to discriminate the remaining candidates.", 
        "88": "Therefore, the optimal threshold value allowed the extraction of only 11k sentence pairs.", 
        "89": "In contrast, without this constraint, even with a high threshold value of 0.955 that retrieved as many sentence pairs as the baseline method, the extracted sentence pairs resulted in a significantly higher BLEU score than the baseline method, with a slightly better lexical coverage.", 
        "90": "Last but not least, our method is 11.9 times faster than the baseline method.", 
        "91": "4 Feature contribution  To evaluate the impact of the features used during classification, we performed a feature ablation experiment.", 
        "92": "The results for the EMEA translation\ntask are reported in Table 2.", 
        "93": "For both translation directions, the features that have the most important were the ones based on lexical translaiton probabilities and alignments between embeddings.", 
        "94": "For instance, in En→Fr translation, removing them led to a significant drop of 0.4 and 0.8 BLEU points, respectively.", 
        "95": "For the Fr→En translation direction, surprisingly, we observed improvements on the test set for all configurations, except when removing either of the above two types of features.", 
        "96": "However, we did not observe such improvements for the En→Fr translation direction; removing any feature(s) consistently led to a lower or equal BLEU score.", 
        "97": "Feature ablation did not improve the performance on the development set for both translation directions, neither.", 
        "98": "5 Classifier accuracy  To better understand the performance of our method, we also evaluated the accuracy of the classifier used in step 2 (see Section 2.2).", 
        "99": "Note that this evaluation does not intend to show how well the classifier retrieves useful pseudo-parallel sentences.", 
        "100": "We cannot directly evaluate it, as we do not have an evaluation data set that contains gold pseudo-parallel sentences at hand.", 
        "101": "A set of in-domain truly parallel sentences was used for our evaluation.", 
        "102": "We selected the 50k first source sentences from the held-out in-domain EMEA parallel corpus,15 and used each one of them to make two sentence pairs in order to obtain a positive and a negative example.", 
        "103": "For the positive example, the source sentence is associated to its correct translation from the EMEA corpus, while for the negative example, we associated the source sentence with a target sentence randomly extracted from the EMEA corpus.", 
        "104": "The classifier has then to decide if the sentence pair is correct or incorrect.", 
        "105": "The classifier is the same one that was presented in Section 3.2 and trained on the MultiUn parallel data.", 
        "106": "On our EMEA evaluation data set, this classifier achieves an accuracy of 85.98%.", 
        "107": "This high accuracy highlights the potential of our method in retrieving highly, or truly, parallel sentences if such kinds of sentence pairs exist in the monolingual data exploited by our approach.", 
        "108": "6 Conclusion and future work  We presented a method for extracting pseudoparallel sentences from a pair of large monolingual corpora, without relying on any document-level information.", 
        "109": "Our domain adaptation experiments showed that our method outperformed the state-ofthe-art method by more efficiently extracting more useful sentence pairs from in-domain monolingual data.", 
        "110": "In addition to the improved BLEU scores, our method provides a better handling of OOV, ignored by other methods that strongly rely on already trained lexical translation models.", 
        "111": "Our method can further be speeded up by some approximation, such as local sensitive hashing, or by using a smaller number of dimensions for word embeddings.", 
        "112": "We leave the study of their impact to our future work.", 
        "113": "We believe that our work is also useful for other downstream tasks that need comparable or pseudo-parallel sentences, such as parallel phrase extraction (Hewavitharana and Vogel, 2016) and adaptation of neural machine translation systems (Luong and Manning, 2015; Freitag and Al-Onaizan, 2016).", 
        "114": "Acknowledgments  We would like to thank all the reviewers for their valuable comments and suggestions.", 
        "115": "15We used the EMEA training data provided by the same workshop on domain adaptation (Carpuat et al., 2012) that released the development and test data used in our experiments."
    }, 
    "document_id": "P17-2062.pdf.json"
}
