{
    "abstract_sentences": {
        "1": "We present a novel cross-lingual transfer method for paradigm completion, the task of mapping a lemma to its inflected forms, using a neural encoder-decoder model, the state of the art for the monolingual task.", 
        "2": "We use labeled data from a high-resource language to increase performance on a lowresource language.", 
        "3": "In experiments on 21 language pairs from four different language families, we obtain up to 58% higher accuracy than without transfer and show that even zero-shot and one-shot learning are possible.", 
        "4": "We further find that the degree of language relatedness strongly influences the ability to transfer morphological knowledge."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1993–2003 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1182  1 Introduction  Low-resource natural language processing (NLP) remains an open problem for many tasks of interest.", 
        "2": "Furthermore, for most languages in the world, highcost linguistic annotation and resource creation are unlikely to be undertaken in the near future.", 
        "3": "In the case of morphology, out of the 7000 currently spoken (Lewis, 2009) languages, only about 200 have computer-readable annotations (Sylak-Glassman et al., 2015) – although morphology is easy to annotate compared to syntax and semantics.", 
        "4": "Transfer learning is one solution to this problem: it exploits annotations in a high-resource language to train a system for a low-resource language.", 
        "5": "In this work, we present a method for cross-lingual transfer of inflectional morphology using an encoder-decoder recurrent neural network (RNN).", 
        "6": "This allows for the development of tools for computational morphology with limited annotated data.", 
        "7": "In many languages, individual lexical entries may be realized as distinct inflections of a single\nlemma depending on the syntactic context.", 
        "8": "For example, the 3SgPresInd of the English verbal lemma to bring is brings.", 
        "9": "In morphologically rich languages, a lemma can have hundreds of individual forms.", 
        "10": "Thus, both generation and analysis of such morphological inflections are active areas of research in NLP and morphological processing has been shown to be a boon to several other down-stream applications, e.g., machine translation (Dyer et al., 2008), speech recognition (Creutz et al., 2007), parsing (Seeker and Çetinoğlu, 2015), keyword spotting (Narasimhan et al., 2014) and word embeddings (Cotterell et al., 2016b), inter alia.", 
        "11": "In this work, we focus on paradigm completion, a form of morphological generation that maps a given lemma to a target inflection, e.g., (bring, Past) 7→ brought (with Past being the target tag).", 
        "12": "RNN sequence-to-sequence models (Sutskever et al., 2014; Bahdanau et al., 2015) are the state of the art for paradigm completion (Faruqui et al., 2016; Kann and Schütze, 2016a; Cotterell et al., 2016a).", 
        "13": "However, these models require a large amount of data to achieve competitive performance; this makes them unsuitable for out-of-thebox application to paradigm completion in the low-resource scenario.", 
        "14": "To mitigate this, we consider transfer learning: we train an end-to-end neural system jointly with limited data from a lowresource language and a larger amount of data from a high-resource language.", 
        "15": "This technique allows\n1993\nthe model to apply knowledge distilled from the high-resource training data to the low-resource language as needed.", 
        "16": "We conduct experiments on 21 language pairs from four language families, emulating a lowresource setting.", 
        "17": "Our results demonstrate successful transfer of morphological knowledge.", 
        "18": "We show improvements in accuracy and edit distance of up to 58% (accuracy) and 4.62 (edit distance) over the same model with only in-domain language data on the paradigm completion task.", 
        "19": "We further obtain up to 44% (resp.", 
        "20": "14%) improvement in accuracy for the one-shot (resp.", 
        "21": "zero-shot) setting, i.e., one (resp.", 
        "22": "zero) in-domain language sample per target tag.", 
        "23": "We also show that the effectiveness of morphological transfer depends on language relatedness, measured by lexical similarity.", 
        "24": "2 Inflectional Morphology and Paradigm Completion  Many languages exhibit inflectional morphology, i.e., the form of an individual lexical entry mutates to show properties such as person, number or case.", 
        "25": "The citation form of a lexical entry is referred to as the lemma and the collection of its possible inflections as its paradigm.", 
        "26": "Tab.", 
        "27": "1 shows an example of a partial paradigm; we display several forms for the Spanish verbal lemma soñar.", 
        "28": "We may index the entries of a paradigm by a morphological tag, e.g., the 2SgPresInd form sueñas in Tab.", 
        "29": "1.", 
        "30": "In generation, the speaker must select an entry of the paradigm given the form’s context.", 
        "31": "In general, the presence of rich inflectional morphology is problematic for NLP systems as it greatly increases the token-type ratio and, thus, word form sparsity.", 
        "32": "An important task in inflectional morphology is paradigm completion (Durrett and DeNero, 2013; Ahlberg et al., 2014; Nicolai et al., 2015; Cotterell et al., 2015; Faruqui et al., 2016).", 
        "33": "Its goal is to map a lemma to all individual inflections, e.g., (soñar, 1SgPresInd) 7→ sueño.", 
        "34": "There are good solutions for paradigm completion when a large amount of annotated training data is available (Cotterell et al., 2016a).1 In this work, we address the lowresource setting, a yet unsolved challenge.", 
        "35": "1The SIGMORPHON 2016 shared task (Cotterell et al., 2016a) on morphological reinflection, a harder generalization of paradigm completion, found that ≥ 98% accuracy can be achieved in many languages with neural sequence-to-sequence models, improving the state of the art by 10%.", 
        "36": "2.1 Transferring Inflectional Morphology  In comparison to other NLP annotations, e.g., partof-speech (POS) and named entities, morphological inflection is especially challenging for transfer learning: we can define a universal set of POS tags (Petrov et al., 2012) or of entity types (e.g., coarsegrained types like person and location or finegrained types (Yaghoobzadeh and Schütze, 2015)), but inflection is much more language-specific.", 
        "37": "It is infeasible to transfer morphological knowledge from Chinese to Portuguese as Chinese does not use inflected word forms.", 
        "38": "Transferring named entity recognition, however, among Chinese and European languages works well (Wang and Manning, 2014a).", 
        "39": "But even transferring inflectional paradigms from morphologically rich Arabic to Portuguese seems difficult as the inflections often mark dissimilar subcategories.", 
        "40": "In contrast, transferring morphological knowledge from Spanish to Portuguese, two languages with similar conjugations and 89% lexical similarity, appears promising.", 
        "41": "Thus, we conjecture that transfer of inflectional morphology is only viable among related languages.", 
        "42": "2.2 Formalization of the Task  We now offer a formal treatment of the crosslingual paradigm completion task and develop our notation.", 
        "43": "Let Σ` be a discrete alphabet for language ` and let T` be a set of morphological tags for `.", 
        "44": "Given a lemma w` in `, the morphological paradigm (inflectional table) π can be formalized as a set of pairs\nπ(w`) = {( fk[w`], tk )} k∈T (w`)\n(1)\nwhere fk[w`] ∈ Σ+` is an inflected form, tk ∈ T` is its morphological tag and T (w`) is the set of slots in the paradigm; e.g., a Spanish paradigm is: π(soñar)= {( sueño, 1SgPresInd ) , .", 
        "45": ".", 
        "46": ".", 
        "47": ", ( soñaran, 3PlPastSbj )}\nParadigm completion consists of predicting missing slots in the paradigm π(w`) of a given lemma w`.", 
        "48": "In cross-lingual paradigm completion, we consider a high-resource source language `s (lots of training data available) and a low-resource target language `t (little training data available).", 
        "49": "We denote the source training examples as Ds (with |Ds| = ns) and the target training examples as\nDt (with |Dt| = nt).", 
        "50": "The goal of cross-lingual paradigm completion is to populate paradigms in the low-resource target language with the help of data from the high-resource source language, using only few in-domain examples.", 
        "51": "3 Cross-Lingual Transfer as Multi-Task Learning  We describe our probability model for morphological transfer using terminology from multi-task learning (Caruana, 1997; Collobert et al., 2011).", 
        "52": "We consider two tasks, training a paradigm completor (i) for a high-resource language and (ii) for a low-resource language.", 
        "53": "We want to train jointly, so we reap the benefits of having related languages.", 
        "54": "Thus, we define the log-likelihood as\nL(θ)= ∑\n(k,w`t )∈Dt log pθ (fk[w`t ] | w`t , tk, λ`t) (2)\n+ ∑\n(k,w`s )∈Ds log pθ(fk[w`s ] | w`s , tk, λ`s)\nwhere we tie parameters θ for the two languages together to allow the transfer of morphological knowledge between languages.", 
        "55": "The λs are special language tags, cf.", 
        "56": "Sec.", 
        "57": "3.2.", 
        "58": "Each probability distribution pθ defines a distribution over all possible realizations of an inflected form, i.e., a distribution over Σ∗.", 
        "59": "For example, consider the related Romance languages Spanish and French; focusing on one term from each of the summands in Eq.", 
        "60": "(2) (the past participle of the translation of to visit in each language), we arrive at\nLvisit(θ) = log pθ(visitado | visitar, PastPart, ES) + log pθ(visité | visiter, PastPart, FR) (3)\nOur cross-lingual setting forces both transductions to share part of the parameter vector θ, to represent morphological regularities between the two languages in a common embedding space and, thus, to enable morphological transfer.", 
        "61": "This is no different from monolingual multi-task settings, e.g., jointly training a parser and tagger for transfer of syntax.", 
        "62": "Based on recent advances in neural transducers, we parameterize each distribution as an encoderdecoder RNN, as in (Kann and Schütze, 2016b).", 
        "63": "In their setup, the RNN encodes the input and predicts the forms in a single language.", 
        "64": "In contrast, we force the network to predict two or more languages.", 
        "65": "3.1 Encoder-Decoder RNN  We parameterize the distribution pθ as an encoderdecoder gated RNN (GRU) with attention (Bahdanau et al., 2015), the state-of-the-art solution for the monolingual case (Kann and Schütze, 2016b).", 
        "66": "A bidirectional gated RNN encodes the input sequence (Cho et al., 2014) – the concatenation of (i) the language tag, (ii) the morphological tag of the form to be generated and (iii) the characters of the input word – represented by embeddings.", 
        "67": "The input to the decoder consists of concatenations of−→ hi and ←− hi , the forward and backward hidden states of the encoder.", 
        "68": "The decoder, a unidirectional RNN, uses attention: it computes a weight αi for each hi.", 
        "69": "Each weight reflects the importance given to that input position.", 
        "70": "Using the attention weights, the probability of the output sequence given the input sequence is:\np(y | x1, .", 
        "71": ".", 
        "72": ".", 
        "73": ", x|X|) = |Y |∏\nt=1\ng(yt−1, st, ct) (4)\nwhere y = (y1, .", 
        "74": ".", 
        "75": ".", 
        "76": ", y|Y |) is the output sequence (a sequence of |Y | characters), x = (x1, .", 
        "77": ".", 
        "78": ".", 
        "79": "x|X|) is the input sequence (a sequence of |X| characters), g is a non-linear function, st is the hidden state of the decoder and ct is the sum of the encoder states hi, weighted by attention weights αi(st−1) which depend on the decoder state:\nct =\n|X|∑\ni=1\nαi(st−1)hi (5)\nFig.", 
        "80": "1 shows the encoder-decoder.", 
        "81": "See Bahdanau et al.", 
        "82": "(2015) for further details.", 
        "83": "3.2 Input Format  Each source form is represented as a sequence of characters; each character is represented as an embedding.", 
        "84": "In the same way, each source tag is represented as a sequence of subtags, and each subtag is represented as an embedding.", 
        "85": "More formally, we define the alphabet Σ = ∪`∈LΣ` as the set of characters in the languages in L, with L being the set of languages in the given experiment.", 
        "86": "Next, we define S as the set of subtags that occur as part of the set of morphological tags T = ∪`∈LT`; e.g., if 1SgPresInd ∈ T , then 1, Sg, Pres, Ind ∈ S .", 
        "87": "Note that the set of subtags S is defined as attributes from the UNIMORPH schema (Sylak-Glassman, 2016) and, thus, is universal across languages; the schema is\nderived from research in linguistic typology.2 The format of the input to our system is S+Σ+.", 
        "88": "The output format is Σ+.", 
        "89": "Both input and output are padded with distinguished BOW and EOW symbols.", 
        "90": "What we have described is the representation of Kann and Schütze (2016b).", 
        "91": "In addition, we preprend a symbol λ ∈ L to the input string (e.g., λ = Es, also represented by an embedding), so the RNN can handle multiple languages simultaneously and generalize over them.", 
        "92": "Thus, our final input is of the form λS+Σ+.", 
        "93": "4 Languages and Language Families  To verify the applicability of our method to a wide range of languages, we perform experiments on example languages from several different families.", 
        "94": "Romance languages, a subfamily of IndoEuropean, are widely spoken, e.g., in Europe and Latin America.", 
        "95": "Derived from the common ancestor Vulgar Latin (Harris and Vincent, 2003), they share large parts of their lexicon and inflectional morphology; we expect knowledge among them to be easily transferable.", 
        "96": "2Note that while the subtag set is universal, which subtags a language actually uses is language-specific; e.g., Spanish does not mark animacy as Russian does.", 
        "97": "We contrast this with the universal POS set (Petrov et al., 2012), where it is more likely that we see all 17 tags in most languages.", 
        "98": "We experiment on Catalan, French, Italian, Portuguese and Spanish.", 
        "99": "Tab.", 
        "100": "2 shows that Spanish – which takes the role of the low-resource language in our experiments – is closely related with the other four, with Portuguese being most similar.", 
        "101": "We hypothesize that the transferability of morphological knowledge between source and target corresponds to the degree of lexical similarity; thus, we expect Portuguese and Catalan to be more beneficial for Spanish than Italian and French.", 
        "102": "The Indo-European Slavic language family has its origin in eastern-central Europe (Corbett and Comrie, 2003).", 
        "103": "We experiment on Bulgarian, Macedonian, Russian and Ukrainian (Cyrillic script) and on Czech, Polish and Slovene (Latin script).", 
        "104": "Macedonian and Ukranian are low-resource languages, so we assign them the low-resource role.", 
        "105": "For Romance and for Uralic, we experiment with groups containing three or four source languages.", 
        "106": "To arrive at a comparable experimental setup for Slavic, we run two experiments, each with three source and one target language: (i) from Russian, Bulgarian and Czech to Macedonian; and (ii) from Russian, Polish and Slovene to Ukrainian.", 
        "107": "We hope that the paradigm completor learns similar embeddings for, say, the characters “e” in Polish and “ ” in Ukrainian.", 
        "108": "Thus, the use of two scripts in Slavic allows us to explore transfer across different alphabets.", 
        "109": "We further consider a non-Indo-European language family, the Uralic languages.", 
        "110": "We experiment on the three most commonly spoken languages – Finnish, Estonian and Hungarian (Abondolo, 2015) – as well as Northern Sami, a language used in Northern Scandinavia.", 
        "111": "While Finnish and Estonian are closely related (both are members of the Finnic subfamily), Hungarian is a more distant cousin.", 
        "112": "Estonian and Northern Sami are lowresource languages, so we assign them the lowresource role, resulting in two groups of experiments: (i) Finnish, Hungarian and Estonian to Northern Sami; (ii) Finnish, Hungarian and Northern Sami to Estonian.", 
        "113": "Arabic (baseline) is a Semitic language (part of the Afro-Asiatic family (Hetzron, 2013)) that is\nspoken in North Africa, the Arabian Peninsula and other parts of the Middle East.", 
        "114": "It is unrelated to all other languages used in this work.", 
        "115": "Both in terms of form (new words are mainly built using a templatic system) and categories (it has tags such as construct state), Arabic is very different.", 
        "116": "Thus, we do not expect it to support morphological knowledge transfer and use it as a baseline for all target languages.", 
        "117": "5 Experiments  We run four experiments on 21 distinct pairings of languages to show the feasibility of morphological transfer and analyze our method.", 
        "118": "We first discuss details common to all experiments.", 
        "119": "We keep hyperparameters during all experiments (and for all languages) fixed to the following values.", 
        "120": "Encoder and decoder RNNs each have 100 hidden units and the size of all subtag, character and language embeddings is 300.", 
        "121": "For training we use ADADELTA (Zeiler, 2012) with minibatch size 20.", 
        "122": "All models are trained for 300 epochs.", 
        "123": "Following Le et al.", 
        "124": "(2015), we initialize all weights in the encoder, decoder and the embeddings except for the GRU weights in the decoder to the identity matrix.", 
        "125": "Biases are initialized to zero.", 
        "126": "Evaluation metrics: (i) 1-best accuracy: the percentage of predictions that match the true answer exactly; (ii) average edit distance between prediction and true answer.", 
        "127": "The two metrics differ in that accuracy gives no partial credit and incorrect answers may be drastically different from the annotated form without incurring additional penalty.", 
        "128": "In contrast, edit distance gives partial credit for forms that are closer to the true answer.", 
        "129": "5.1 Exp.", 
        "130": "1: Transfer Learning for Paradigm Completion  In this experiment, we investigate to what extent our model transfers morphological knowledge from a high-resource source language to a low-resource target language.", 
        "131": "We experimentally answer three questions.", 
        "132": "(i) Is transfer learning possible for morphology?", 
        "133": "(ii) How much annotated data do we need in the low-resource target language?", 
        "134": "(iii) How closely related must the two languages be to achieve good results?", 
        "135": "Data.", 
        "136": "Based on complete inflection tables from unimorph.org (Kirov et al., 2016), we create datasets as follows.", 
        "137": "Each training set consists of 12,000 samples in the high-resource source\nlanguage and nt∈{50, 200} samples in the lowresource target language.", 
        "138": "We create target language dev and test sets of sizes 1600 and 10,000, respectively.3 For Romance and Arabic, we create learning curves for nt∈{100, 400, 800, 1600, 3200, 6400, 12000}.", 
        "139": "Due to the data available to us, we use only verbs for the Romance and Uralic language families, but nouns, verbs and adjectives for the Slavic language family and Arabic.", 
        "140": "Lemmata and inflections are randomly selected from all available paradigms.", 
        "141": "Results and Discussion.", 
        "142": "Tab.", 
        "143": "3 shows the effectiveness of transfer learning.", 
        "144": "There are two baselines.", 
        "145": "(i) “0”: no transfer, i.e., we consider only in-domain data; (ii) “AR”: Arabic, which is unrelated to all target languages.", 
        "146": "With the exception of the 200 sample case of ET→SME, cross-lingual transfer is always better than the two baselines; the maximum improvement is 0.58 (0.58 vs. 0.00) in accuracy for the 50 sample case of CA→ES.", 
        "147": "More closely related source languages improve performance more than distant ones.", 
        "148": "French, the Romance language least similar to Spanish, performs worst for →ES.", 
        "149": "For the target language Macedonian, Bulgarian provides most benefit.", 
        "150": "This can again be explained by similarity: Bulgarian is closer to Macedonian than the other languages in this group.", 
        "151": "The best result for Ukrainian is RU→UK.", 
        "152": "Unlike Polish and Slowenian, Russian is the only language in this group that uses the same script as Ukrainian, showing\n3For Estonian, we use 7094 (not 12,000) train and 5000 (not 10,000) test samples as more data is unavailable.", 
        "153": "the importance of the alphabet for transfer.", 
        "154": "Still, the results also demonstrate that transfer works across alphabets (although not as well); this suggests that similar embeddings for similar characters have been learned.", 
        "155": "Finnish is the language that is closest to Estonian and it again performs best as a source language for Estonian.", 
        "156": "For Northern Sami, transfer works least well, probably because the distance between sources and target is largest in this case.", 
        "157": "The distance of the Sami languages from the Finnic (Estonian, Finnish) and Ugric (Hungarian) languages is much larger than the distances within Romance and within Slavic.", 
        "158": "However, even for Northern Sami, the worst performing language, adding an additional language is still always beneficial compared to the monolingual baseline.", 
        "159": "Learning curves for Romance and Arabic further support our finding that language similarity is important.", 
        "160": "In Fig.", 
        "161": "2, knowledge is transferred to Spanish, and a baseline – a model trained only on Spanish data – shows the accuracy obtained without any transfer learning.", 
        "162": "Here, Catalan and Italian help the most, followed by Portuguese, French and, finally, Arabic.", 
        "163": "This corresponds to the order of lexical similarity with Spanish, except for the performance of Portuguese (cf.", 
        "164": "Tab.", 
        "165": "2).", 
        "166": "A possible explanation is the potentially confusing overlap of lemmata between the two languages – cf.", 
        "167": "discussion in the next subsection.", 
        "168": "That the transfer learning setup improves performance for the unrelated language Arabic as source is at first surprising.", 
        "169": "However, adding new samples to a small training set helps prevent overfitting (e.g., rote memorization) even if the source is a morphologically unrelated language; effectively acting as a regularizer.", 
        "170": "Following (Kann and Schütze, 2016b) we did not use standard regularizers.", 
        "171": "To verify that the\neffect of Arabic is mainly a regularization effect, we ran a small monolingual experiment on ES (200 setting) with dropout 0.5 (Srivastava et al., 2014).", 
        "172": "The resulting accuracy is 0.57, very similar to the comparable Arabic number of 0.54 in the table.", 
        "173": "The accuracy for dropout and 50 ES samples stays at 0.00, showing that in extreme low-resource settings an unrelated language might be preferable to a standard regularizer.", 
        "174": "Error Analysis for Romance.", 
        "175": "Even for only 50 Spanish instances, many inflections are correctly produced in transfer.", 
        "176": "For, e.g., (criar, 3PlFutSbj) 7→ criaren, model outputs are: fr: criaren, ca: criaren, es: crntaron, it: criaren, ar: ecriren, pt: criaren (all correct except for the two baselines).", 
        "177": "Many errors involve accents, e.g., (contrastar, 2PlFutInd) 7→ contrastaréis; model outputs are: fr: contrastareis, ca: contrastareis, es: conterarı́an, it: contrastareis, ar: contastarı́as, pt: contrastareis.", 
        "178": "Some inflected forms are produced incorrectly by all systems, mainly because they apply the inflectional rules of the source language directly to the target.", 
        "179": "Finally, the output of the model trained on Portuguese contains a class of errors that are unlike those of other systems.", 
        "180": "Example: (contraatacar, 1SgCond) 7→ contraatacarı́a with the following solutions: fr: contratacarı́am, ca: contraatacarı́a, es: concarnar, it: contratacé, ar: cuntatarı́a and pt: contra-atacarı́a.", 
        "181": "The Portuguese model inserts “-” because Portuguese train data contains contraatacar and “-” appears in its inflected form.", 
        "182": "Thus, it seems that shared lemmata between the highresource source language and the low-resource target language hurt our model’s performance.4 An\n4To investigate this in more detail we retrain the Portuguese model with 50 Spanish samples, but exclude all lemmata that appear in Spanish train/dev/test, resulting in only 3695\nexample for the generally improved performance across languages for 200 Spanish training samples is (contrastar, 2PlIndFut) 7→ contrastaréis: all models now produce the correct form.", 
        "183": "5.2 Exp.", 
        "184": "2: Multiple Source Languages  We now want to investigate the effect of multiple source languages.", 
        "185": "Data.", 
        "186": "Our experimental setup is similar to §5.1: we use the same dev, test and low-resource train sets as before.", 
        "187": "However, we limit this experiment to the Romance language family and the highresource train data consists of samples from two different source languages at once.", 
        "188": "Choosing those which have the highest accuracies on their own, we experiment with the following pairs: CA&PT, as well as CA&IT.", 
        "189": "In order to keep all experiments easily comparable, we use half of each source language’s data, again ending up with a total of 12,000 high-resource samples.", 
        "190": "Results and Discussion.", 
        "191": "Results are shown in Tab.", 
        "192": "4.", 
        "193": "Training on two source languages improves over training on a single one.", 
        "194": "Increases in accuracy are minor, but edit distance is reduced by up to 0.13 (50 low-resource samples) and 0.08 (200 lowresource samples).", 
        "195": "That using data from multiple languages is beneficial might be due to a weaker tendency of the final model to adapt wrong rules from the source language, since different alternatives are presented during training.", 
        "196": "5.3 Exp.", 
        "197": "3: Zero-Shot/One-Shot Transfer  In §5.1, we investigated the relationship between indomain (target) training set size and performance.", 
        "198": "Here, we look at the extreme case of training set sizes 1 (one-shot) and 0 (zero-shot) for a tag.", 
        "199": "We train our model on a single sample for half of the tags appearing in the low-resource language, i.e.,\ntraining samples.", 
        "200": "Accuracy on test increases by 0.09 despite the reduced size of the training set.", 
        "201": "if T` is the set of morphological tags for the target language, train set size is |T`|/2.", 
        "202": "As before, we add 12,000 source samples.", 
        "203": "We report one-shot accuracy (resp.", 
        "204": "zero-shot accuracy), i.e., the accuracy for samples with a tag that has been seen once (resp.", 
        "205": "never) during training.", 
        "206": "Note that the model has seen the individual subtags each tag is composed of.5\nData.", 
        "207": "Now, we use the same dev, test and highresource train sets as in §5.1.", 
        "208": "However, the lowresource data is created in the way specified above.", 
        "209": "To remove a potentially confounding variable, we impose the condition that no two training samples belong to the same lemma.", 
        "210": "Results and Discussion.", 
        "211": "Tab.", 
        "212": "5 shows that the Spanish and Arabic systems do not learn anything useful for either half of the tags.", 
        "213": "This is not surprising as there is not enough Spanish data for the system to generalize well and Arabic does not contribute exploitable information.", 
        "214": "The systems trained on French and Italian, in contrast, get a nonzero accuracy for the zero-shot case as well as 0.13 and 0.23, respectively, in the one-shot case.", 
        "215": "This shows that a single training example is sometimes sufficient for successful generation although generalization to tags never observed is rarely possible.", 
        "216": "Catalan and Portuguese show the best performance in both settings; this is intuitive since they are the languages closest to the target (cf.", 
        "217": "Tab.", 
        "218": "2).", 
        "219": "In fact, adding Portuguese to the training data yields an absolute increase in accuracy of 0.44 (0.44 vs. 0.00) for one-shot and 0.14 (0.14 vs. 0.00) for zero-shot with corresponding improvements in edit distance.", 
        "220": "Overall, this experiment shows that with transfer learning from a closely related language the per-\n5It is very unlikely that due to random selection a subtag will not be in train; this case did not occur in our experiments.", 
        "221": "formance of zero-shot morphological generation improves over the monolingual approach, and, in the one-shot setting, it is possible to generate the right form nearly half the time.", 
        "222": "5.4 Exp.", 
        "223": "4: True Transfer vs. Other Effects  We would like to separate the effects of regularization that we saw for Arabic from true transfer.", 
        "224": "To this end, we generate a random cipher (i.e., a function γ : Σ ∪ S 7→ Σ ∪ S) and apply it to all word forms and morphological tags of the high-resource train set; target language data are not changed.", 
        "225": "Ciphering makes it harder to learn true “linguistic” transfer of morphology.", 
        "226": "Consider the simplest case of transfer: an identical mapping in two languages, e.g., (visitar, 1SgPresInd) 7→ visito in both Portuguese and Spanish.", 
        "227": "If we transform Portuguese using the cipher γ(iostv...) = kltqa..., then visito becomes aktkql in Portuguese and its tag becomes similarly unrecognizable as being identical to the Spanish tag 1SgPresInd.", 
        "228": "Our intuition is that ciphering will disrupt transfer of morphology.6 On the other hand, the regularization effect we observed with Arabic should still be effective.", 
        "229": "Data.", 
        "230": "We use the Portuguese-Spanish and Arabic-Spanish data from §5.1.", 
        "231": "We generate a random cipher and apply it to morphological tags and word forms for Portuguese and Arabic.", 
        "232": "The language tags are kept unchanged.", 
        "233": "Spanish is also not changed.", 
        "234": "For comparability with Tab.", 
        "235": "3, we use the same dev and test sets as before.", 
        "236": "Results and Discussion.", 
        "237": "Tab.", 
        "238": "6 shows that performance of PT→ES drops a lot: from 0.48 to 0.09 for 50 samples and from 0.62 to 0.54 for 200 samples.", 
        "239": "This is because there are no overt similarities between the two languages left after applying the cipher, e.g., the two previously identical forms visito are now different.", 
        "240": "The impact of ciphering on AR→ES varies: slightly improved in one case (0.54 vs. 0.56), slightly worse in three cases.", 
        "241": "We also apply the cipher to the tags and Arabic and Spanish share subtags, e.g., Sg.", 
        "242": "Just the knowledge that something is a subtag is helpful because subtags must not be generated as part of the output.", 
        "243": "We can explain the tendency of ciphering to decrease performance on AR→ES by the “masking” of common subtags.", 
        "244": "6Note that ciphered input is much harder than transfer between two alphabets (Latin/Cyrillic) because it creates ambiguous input.", 
        "245": "In the example, Spanish “i” is totally different from Portuguese “i” (which is really “k”), but the model must use the same representation.", 
        "246": "For 200 samples and ciphering, there is no clear difference in performance between Portuguese and Arabic.", 
        "247": "However, for 50 samples and ciphering, Portuguese (0.09) seems to perform better than Arabic (0.02) in accuracy.", 
        "248": "Portuguese uses suffixation for inflection whereas Arabic is templatic and inflectional changes are not limited to the end of the word.", 
        "249": "This difference is not affected by ciphering.", 
        "250": "Perhaps even ciphered Portugese lets the model learn better that the beginnings of words just need to be copied.", 
        "251": "For 200 samples, the Spanish dataset may be large enough, so that ciphered Portuguese no longer helps in this regard.", 
        "252": "Comparing no transfer with transfer from a ciphered language to Spanish, we see large performance gains, at least for the 200 sample case: 0.38 (0→ES) vs. 0.54 (PT→ES) and 0.56 (AR→ES).", 
        "253": "This is evidence that our conjecture is correct that the baseline Arabic mainly acts as a regularizer that prevents the model from memorizing the training set and therefore improves performance.", 
        "254": "So performance improves even though no true transfer of morphological knowledge takes place.", 
        "255": "6 Related Work  Cross-lingual transfer learning has been used for many tasks, e.g., automatic speech recognition (Huang et al., 2013), parsing (Cohen et al., 2011; Søgaard, 2011; Naseem et al., 2012; Ammar et al., 2016), language modeling (Tsvetkov et al., 2016), entity recognition (Wang and Manning, 2014b) and machine translation (Johnson et al., 2016; Ha et al., 2016).", 
        "256": "One straightforward method is to translate datasets and then train a monolingual model (Fortuna and Shawe-Taylor, 2005; Olsson et al., 2005).", 
        "257": "Also, aligned corpora have been used to project information from annotations in one language to another (Yarowsky et al., 2001; Padó and Lapata, 2005).", 
        "258": "The drawback is that machine translation\nerrors cause errors in the target.", 
        "259": "Therefore, alternative methods have been proposed, e.g., to port a model trained on the source language to the target language (Shi et al., 2010).", 
        "260": "In the realm of morphology, Buys and Botha (2016) recently adapted methods for the training of POS taggers to learn weakly supervised morphological taggers with the help of parallel text.", 
        "261": "Snyder and Barzilay (2008a, 2008b) developed a non-parametric Bayesian model for morphological segmentation.", 
        "262": "They performed identification of cross-lingual abstract morphemes and segmentation simultaneously and reported, similar to us, best results for related languages.", 
        "263": "Work on paradigm completion has recently been encouraged by the SIGMORPHON 2016 shared task on morphological reinflection (Cotterell et al., 2016a).", 
        "264": "Some work first applies an unsupervised alignment model to source and target string pairs and then learns a string-to-string mapping (Durrett and DeNero, 2013; Nicolai et al., 2015), using, e.g., a semi-Markov conditional random field (Sarawagi and Cohen, 2004).", 
        "265": "Encoderdecoder RNNs (Aharoni et al., 2016; Faruqui et al., 2016; Kann and Schütze, 2016b), a method which our work further develops for the cross-lingual scenario, define the current state of the art.", 
        "266": "Encoder-decoder RNNs were developed in parallel by Cho et al.", 
        "267": "(2014) and Sutskever et al.", 
        "268": "(2014) for machine translation and extended by Bahdanau et al.", 
        "269": "(2015) with an attention mechanism, supporting better generalization.", 
        "270": "They have been applied to NLP tasks like speech recognition (Graves and Schmidhuber, 2005; Graves et al., 2013), parsing (Vinyals et al., 2015) and segmentation (Kann et al., 2016).", 
        "271": "More recently, a number of papers have used encoder-decoder RNNs in multitask and transfer learning settings; this is mainly work in machine translation: (Dong et al., 2015; Zoph and Knight, 2016; Chu et al., 2017; Johnson et al., 2016; Luong et al., 2016; Firat et al., 2016; Ha et al., 2016), inter alia.", 
        "272": "Each of these papers has both similarities and differences with our approach.", 
        "273": "(i) Most train several distinct models whereas we train a single model on input augmented with an explicit encoding of the language (similar to (Johnson et al., 2016)).", 
        "274": "(ii) Let k and m be the number of different input and output languages.", 
        "275": "We address the case k ∈ {1, 2, 3} and m = k. Other work has addressed cases with k > 3 or m > 3; this\nwould be an interesting avenue of future research for paradigm completion.", 
        "276": "(iii) Whereas training RNNs in machine translation is hard, we only experienced one difficult issue in our experiments (due to the low-resource setting): regularization.", 
        "277": "(iv) Some work is word- or subword-based, our work is character-based.", 
        "278": "The same way that similar word embeddings are learned for the inputs cow and vache (French for “cow”) in machine translation, we expect similar embeddings to be learned for similar Cyrillic/Latin characters.", 
        "279": "(v) Similar to work in machine translation, we show that zero-shot (and, by extension, one-shot) learning is possible.", 
        "280": "(Ha et al., 2016) (which was developed in parallel to our transfer model although we did not prepublish our paper on arxiv) is most similar to our work.", 
        "281": "Whereas Ha et al.", 
        "282": "(2016) address machine translation, we focus on the task of paradigm completion in low-resource settings and establish the state of the art for this problem.", 
        "283": "7 Conclusion  We presented a cross-lingual transfer learning method for paradigm completion, based on an RNN encoder-decoder model.", 
        "284": "Our experiments showed that information from a high-resource language can be leveraged for paradigm completion in a related low-resource language.", 
        "285": "Our analysis indicated that the degree to which the source language data helps for a certain target language depends on their relatedness.", 
        "286": "Our method led to significant improvements in settings with limited training data – up to 58% absolute improvement in accuracy – and, thus, enables the use of state-of-the-art models for paradigm completion in low-resource languages.", 
        "287": "8 Future Work  In the future, we want to develop methods to make better use of languages with different alphabets or morphosyntactic features, in order to increase the applicability of our knowledge transfer method.", 
        "288": "Acknowledgments  We would like to thank the anonymous reviewers for their insightful comments.", 
        "289": "We are grateful to Siemens and Volkswagenstiftung for their generous support.", 
        "290": "This research would not have been possible without the organizers of the SIGMORPHON shared task, especially John Sylak-Glassman and Christo Kirov, who created the resources we use."
    }, 
    "document_id": "P17-1182.pdf.json"
}
