{
    "abstract_sentences": {
        "1": "Cybersecurity risks and malware threats are becoming increasingly dangerous and common.", 
        "2": "Despite the severity of the problem, there has been few NLP efforts focused on tackling cybersecurity.", 
        "3": "In this paper, we discuss the construction of a new database for annotated malware texts.", 
        "4": "An annotation framework is introduced based around the MAEC vocabulary for defining malware characteristics, along with a database consisting of 39 annotated APT reports with a total of 6,819 sentences.", 
        "5": "We also use the database to construct models that can potentially help cybersecurity researchers in their data collection and analytics efforts."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1557–1567 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1143\nIn this paper, we discuss the construction of a new database for annotated malware texts.", 
        "2": "An annotation framework is introduced based around the MAEC vocabulary for defining malware characteristics, along with a database consisting of 39 annotated APT reports with a total of 6,819 sentences.", 
        "3": "We also use the database to construct models that can potentially help cybersecurity researchers in their data collection and analytics efforts.", 
        "4": "1 Introduction  In 2010, the malware known as Stuxnet physically damaged centrifuges in Iranian nuclear facilities (Langner, 2011).", 
        "5": "More recently in 2016, a botnet known as Mirai used infected Internet of Things (IoT) devices to conduct large-scale Distributed Denial of Service (DDoS) attacks and disabled Internet access for millions of users in the US West Coast (US-CERT, 2016).", 
        "6": "These are only two cases in a long list ranging from ransomeware on personal laptops (Andronio et al., 2015) to taking over control of moving cars (Checkoway et al., 2011).", 
        "7": "Attacks such as these are likely to become increasingly frequent and dangerous as more devices and facilities become connected and digitized.", 
        "8": "Recently, cybersecurity defense has also been recognized as one of the “problem areas likely to be important both for advancing AI and for\nits long-run impact on society\" (Sutskever et al., 2016).", 
        "9": "In particular, we feel that natural language processing (NLP) has the potential for substantial contribution in cybersecurity and that this is a critical research area given the urgency and risks involved.", 
        "10": "There exists a large repository of malwarerelated texts online, such as detailed malware reports by various cybersecurity agencies such as Symantec (DiMaggio, 2015) and Cylance (Gross, 2016) and in various blog posts.", 
        "11": "Cybersecurity researchers often consume such texts in the process of data collection.", 
        "12": "However, the sheer volume and diversity of these texts make it difficult for researchers to quickly obtain useful information.", 
        "13": "A potential application of NLP can be to quickly highlight critical information from these texts, such as the specific actions taken by a certain malware.", 
        "14": "This can help researchers quickly understand the capabilities of a specific malware and search in other texts for malware with similar capabilities.", 
        "15": "An immediate problem preventing application of NLP techniques to malware texts is that such\n1557\ntexts are mostly unannotated.", 
        "16": "This severely limits their use in supervised learning techniques.", 
        "17": "In light of that, we introduce a database of annotated malware reports for facilitating future NLP work in cybersecurity.", 
        "18": "To the best of our knowledge, this is the first database consisting of annotated malware reports.", 
        "19": "It is intended for public release, where we hope to inspire contributions from other research groups and individuals.", 
        "20": "The main contributions of this paper are:\n• We initiate a framework for annotating malware reports and annotate 39 Advanced Persistent Threat (APT) reports (containing 6,819 sentences) with attribute labels from the Malware Attribute Enumeration and Characterization (MAEC) vocabulary (Kirillov et al., 2010).", 
        "21": "• We propose the following tasks, construct models for tackling them, and discuss the challenges:\n• Classify if a sentence is useful for inferring malware actions and capabilities, • Predict token, relation and attribute labels for a given malware-related text, as defined by the earlier framework, and • Predict a malware’s signatures based only on text describing the malware.", 
        "22": "2 Background    2.1 APTnotes  The 39 APT reports in this database are sourced from APTnotes, a GitHub repository of publiclyreleased reports related to APT groups (Blanda, 2016).", 
        "23": "The repository is constantly updated, which means it is a constant source of reports for annotations.", 
        "24": "While the repository consists of 384 reports (as of writing), we have chosen 39 reports from the year 2014 to initialize the database.", 
        "25": "2.2 MAEC  The MAEC vocabulary was devised by The MITRE Corporation as a standardized language for describing malware (Kirillov et al., 2010).", 
        "26": "The MAEC vocabulary is used as a source of labels for our annotations.", 
        "27": "This will facilitate crossapplications in other projects and ensure relevance in the cybersecurity community.", 
        "28": "2.3 Related Work  There are datasets available, which are used for more general tasks such as content extraction\n(Walker et al., 2006) or keyword extraction (Kim et al., 2010).", 
        "29": "These may appear similar to our dataset.", 
        "30": "However, a big difference is that we are not performing general-purpose annotation and not all tokens are annotated.", 
        "31": "Instead, we only annotated tokens relevant to malware capabilities and provide more valuable information by annotating the type of malware capability or action implied.", 
        "32": "These are important differentiating factors, specifically catered to the cybersecurity domain.", 
        "33": "While we are not aware of any database catering specifically to malware reports, there are various databases in the cybersecurity domain that provide malware hashes, such as the National Software Reference Library (NSRL) (NIST, 2017; Mead, 2006) and the File Hash Repository (FHR) by the Open Web Application Security Project (OWASP, 2015).", 
        "34": "Most work on classifying and detecting malware has also been focusing on detecting system calls (Alazab et al., 2010; Briones and Gomez, 2008; Willems et al., 2007; Qiao et al., 2013).", 
        "35": "More recently, Rieck et al.", 
        "36": "(2011) has incorporated machine learning techniques for detecting malware, again through system calls.", 
        "37": "To the best of our knowledge, we are not aware of any work on classifying malware based on analysis of malware reports.", 
        "38": "By building a model that learns to highlight critical information on malware capabilities, we feel that malware-related texts can become a more accessible source of information and provide a richer form of malware characterization beyond detecting file hashes and system calls.", 
        "39": "3 Data Collection  We worked together with cybersecurity researchers while choosing the preliminary dataset, to ensure that it is relevant for the cybersecurity community.", 
        "40": "The factors considered when selecting the dataset include the mention of most current malware threats, the range of author sources, with blog posts and technical security reports, and the range of actor attributions, from several suspected state actors to smaller APT groups.", 
        "41": "3.1 Preprocessing  After the APT reports have been downloaded in PDF format, the PDFMiner tool (Shinyama, 2004) is used to convert the PDF files into plaintext format.", 
        "42": "The reports often contain non-sentences, such as the cover page or document header and\nfooter.", 
        "43": "We went through these non-sentences manually and subsequently removed them before the annotation.", 
        "44": "Hence only complete sentences are considered for subsequent steps.", 
        "45": "3.2 Annotation  The Brat Rapid Annotation Tool (Stenetorp et al., 2012) is used to annotate the reports.", 
        "46": "The main aim of the annotation is to map important word phrases that describe malware actions and behaviors to the relevant MAEC vocabulary, such as the ones shown in Figure 1.", 
        "47": "We first extract and enumerate the labels from the MAEC vocabulary, which we call attribute labels.", 
        "48": "This gives us a total of 444 attribute labels, consisting of 211 ActionName labels, 20 Capability labels, 65 StrategicObjectives labels and 148 TacticalObjectives labels.", 
        "49": "These labels are elaborated in Section 3.5.", 
        "50": "There are three main stages to the annotation process.", 
        "51": "These are cumulative and eventually build up to the annotation of the attribute labels.", 
        "52": "3.3 Stage 1 - Token Labels  The first stage involves annotating the text with the following token labels, illustrated in Figure 2:\nAction This refers to an event, such as “registers”, “provides” and “is written”.", 
        "53": "Subject This refers to the initiator of the Action such as “The dropper” and “This module”.", 
        "54": "Object This refers to the recipient of the Action such as “itself ”, “remote persistent access” and “The ransom note”; it also refers to word phrases that provide elaboration on the Action such as “a service”, “the attacker” and “disk”.", 
        "55": "Modifier This refers to tokens that link to other word phrases that provide elaboration on the Action such as “as” and “to”.", 
        "56": "This stage helps to identify word phrases that are relevant to the MAEC vocabulary.", 
        "57": "Notice that for the last sentence in Figure 2, “The ransom note” is tagged as an Object instead of a Subject.", 
        "58": "This is because the Action “is written” is not being initiated by “The ransom note”.", 
        "59": "Instead, the Subject is absent in this sentence.", 
        "60": "3.4 Stage 2 - Relation Labels  The second stage involves annotating the text with the following relation labels:\nSubjAction This links an Action with its relevant Subject.", 
        "61": "ActionObj This links an Action with its relevant Object.", 
        "62": "ActionMod This links an Action with its relevant Modifier.", 
        "63": "ModObj This links a Modifier with the Object that provides elaboration.", 
        "64": "This stage helps to make the links between the labelled tokens explicit, which is important in cases where a single Action has multiple Subjects, Objects or Modifiers.", 
        "65": "Figure 2 demonstrates how the relation labels are used to link the token labels.", 
        "66": "3.5 Stage 3 - Attribute Labels  The third stage involves annotating the text with the attribute labels extracted from the MAEC vocabulary.", 
        "67": "Since the Action is the main indicator of a malware’s action or capability, the attribute labels are annotated onto the Actions tagged in Stage 1.", 
        "68": "Each Action should have one or more attribute labels.", 
        "69": "There are four classes of attribute labels: ActionName, Capability, StrategicObjectives and TacticalObjectives.", 
        "70": "These labels describe different actions and capabilities of the malware.", 
        "71": "Refer to Appendix A for examples and elaboration.", 
        "72": "3.6 Summary  The above stages complete the annotation process and is done for each document.", 
        "73": "There are also sentences that are not annotated at all since they do not provide any indication of malware actions or capabilities, such as the sentences in Figure 3.", 
        "74": "We call these sentences irrelevant sentences.", 
        "75": "At the time of writing, the database consists of 39 annotated APT reports with a combined total of 6,819 sentences.", 
        "76": "Out of the 6,819 sentences,\n2,080 sentences are annotated.", 
        "77": "Table 1 shows the breakdown of the annotation statistics.", 
        "78": "3.7 Annotators’ Challenges  We can calculate the Cohen’s Kappa (Cohen, 1960) to quantify the agreement between annotators and to give an estimation of the difficulty of this task for human annotators.", 
        "79": "Using annotations from pairs of annotators, the Cohen’s Kappa was calculated to be 0.36 for annotation of the Token labels.", 
        "80": "This relatively low agreement between annotators suggests that this is a rather difficult task.", 
        "81": "In the following subsections, we discuss some possible reasons that make this annotation task difficult.", 
        "82": "3.7.1 Complex Sentence Structures  In many cases, there may be no definite way to label the tokens.", 
        "83": "Figure 4 shows two ways to annotate the same sentence.", 
        "84": "Both annotations essentially serve to highlight the Gen 2 sub-family’s capability of hiding the DLL’s functionality.", 
        "85": "The first annotation highlights the method used by the malware to hide the library, i.e., employing the Driver.", 
        "86": "The second annotation focuses on the malware hiding the library and does not include the method.", 
        "87": "Also notice that the Modifiers highlighted are different in the two cases, since this depends on the Action highlighted and are hence mutually exclusive.", 
        "88": "Such cases occur more commonly when the sentences contain complex noun- and verbphrases that can be decomposed in several ways.", 
        "89": "Repercussions surface later in the experiments de-\nscribed in Section 5.2, specifically in the second point under Discussion.", 
        "90": "3.7.2 Large Quantity of Labels  Due to the large number (444) of attribute labels, it is challenging for annotators to remember all of the attribute labels.", 
        "91": "Moreover, some of the attribute labels are subject to interpretation.", 
        "92": "For instance, should Capability: 005: MalwareCapability-command_and_control be tagged for sentences that mention the location or IP addresses of command and control servers, even though such sentences may not be relevant to the capabilities of the malware?", 
        "93": "3.7.3 Specialized Domain Knowledge Required  Finally, this task requires specialized cybersecurity domain knowledge from the annotator and the ability to apply such knowledge in a natural language context.", 
        "94": "For example, given the phrase “load the DLL into memory”, the annotator has to realize that this phrase matches the attribute label ActionName: 119: ProcessMemorymap_library_into_process.", 
        "95": "The abundance of labels with the many ways that each label can be expressed in natural language makes this task extremely challenging.", 
        "96": "4 Proposed Tasks  The main goal of creating this database is to aid cybersecurity researchers in parsing malwarerelated texts for important information.", 
        "97": "To this end, we propose several tasks that build up to this main goal.", 
        "98": "Task 1 Classify if a sentence is relevant for inferring malware actions and capabilities\nTask 2 Predict token labels for a given malwarerelated text\nTask 3 Predict relation labels for a given malware-related text\nTask 4 Predict attribute labels for a given malware-related text\nTask 5 Predict a malware’s signatures based on the text describing the malware and the text’s annotations\nTask 1 arose from discussions with domain experts where we found that a main challenge for cybersecurity researchers is having to sift out critical sentences from lengthy malware reports and articles.", 
        "99": "Figure 3 shows sentences describing the political and military background of North Korea in the APT report HPSR SecurityBriefing_Episode16_NorthKorea.", 
        "100": "Such information is essentially useless for cybersecurity researchers focused on malware actions and capabilities.", 
        "101": "It will be helpful to build a model that can filter relevant sentences that pertain to malware.", 
        "102": "Tasks 2 to 4 serve to automate the laborious annotation procedure as described earlier.", 
        "103": "With sufficient data, we hope that it becomes possible to build an effective model for annotating malwarerelated texts, using the framework and labels we defined earlier.", 
        "104": "Such a model will help to quickly increase the size of the database, which in turn facilitate other supervised learning tasks.", 
        "105": "Task 5 explores the possibility of using malware texts and annotations to predict a malware’s signatures.", 
        "106": "While conventional malware analyzers generate a list of malware signatures based on the malware’s activities in a sandbox, such analysis is often difficult due to restricted distribution of malware samples.", 
        "107": "In contrast, numerous malware reports are freely available and it will be helpful for cybersecurity researchers if such texts can be used to predict malware signatures instead of having to rely on a limited supply of malware samples.", 
        "108": "In the following experiments, we construct models for tackling each of these tasks and discuss the performance of our models.", 
        "109": "5 Experiments and Results  Since the focus of this paper is on the introduction of a new framework and database for annotating malware-related texts, we only use simple algorithms for building the models and leave more complex models for future work.", 
        "110": "For the following experiments, we use linear support vector machine (SVM) and multinomial Naive Bayes (NB) implementations in the scikitlearn library (Pedregosa et al., 2011).", 
        "111": "The regularization parameter in SVM and smoothing parame-\nter in NB were tuned (with the values 10−3 to 103 in logarithmic increments) by taking the value that gave the best performance in development set.", 
        "112": "For experiments where Conditional Random Field (CRF) (Lafferty et al., 2001) is used, we utilized the CRF++ implementation (Kudo, 2005).", 
        "113": "For scoring the predictions, unless otherwise stated, we use the metrics module in scikit-learn for SVM and NB, as well as the CoNLL2000 conlleval Perl script for CRF1.", 
        "114": "Also, unless otherwise mentioned, we make use of all 39 annotated documents in the database.", 
        "115": "The experiments are conducted with a 60%/20%/20% training/development/test split, resulting in 23, 8 and 8 documents in the respective datasets.", 
        "116": "Each experiment is conducted 5 times with a different random allocation of the dataset splits and we report averaged scores2.", 
        "117": "Since we focus on building a database, we weigh recall and precision as equally important in the following experiments and hence focus on the F1 score metric.", 
        "118": "The relative importance of recall against precision will ultimately depend on the downstream tasks.", 
        "119": "5.1 Task 1 - Classify sentences relevant to malware  We make use of the annotations in our database for this supervised learning task and consider a sentence to be relevant as long as it has an annotated token label.", 
        "120": "For example, the sentences in Figure 2 will be labeled relevant whereas the sentences in Figure 3 will be labeled irrelevant.", 
        "121": "A simple bag-of-words model is used to represent each sentence.", 
        "122": "We then build two models – SVM and NB – for tackling this task.", 
        "123": "Results: Table 2 shows that while the NB model outperforms the SVM model in terms of F1 score, the performance of both models are still rather low with F1 scores below 70 points.", 
        "124": "We proceed to discuss possible sources of errors for the models.", 
        "125": "1www.cnts.ua.ac.be/conll2000/chunking/output.html 2Note that therefore the averaged F1 may not be the har-\nmonic mean of averaged P and R in the result tables.", 
        "126": "Discussion: We find that there are two main types of misclassified sentences.", 
        "127": "1.", 
        "128": "Sentences describing malware without implying specific actions\nThese sentences often contain malware-specific terms, such as “payload” and “malware” in the following sentence.", 
        "129": "This file is the main payload of the malware.", 
        "130": "These sentences are often classified as relevant, probably due to the presence of malware-specific terms.", 
        "131": "However, such sentences are actually irrelevant because they merely describe the malware but do not indicate specific malware actions or capabilities.", 
        "132": "2.", 
        "133": "Sentences describing attacker actions Such sentences mostly contain the term “attacker” or names of attackers.", 
        "134": "For instance, the following sentence is incorrectly classified as irrelevant.", 
        "135": "This is another remote administration tool often used by the Pitty Tiger crew.", 
        "136": "Such sentences involving the attacker are often irrelevant since the annotations focus on the malware and not the attacker.", 
        "137": "However, the above sentence implies that the malware is a remote administration tool and hence is a relevant sentence that implies malware capability.", 
        "138": "5.2 Task 2 - Predict token labels  Task 2 concerns automating Stage 1 for the annotation process described in Section 3.3.", 
        "139": "Within the annotated database, we find several cases where a single word-phrase may be annotated with both Subject and Object labels (see Figure 5).", 
        "140": "In order to simplify the model for prediction, we redefine Task 2 as predicting Entity, Action and Modifier labels for word-phrases.", 
        "141": "The single Entity label is used to replace both Subject and Object labels.", 
        "142": "Since the labels may extend beyond a single word token, we use the BIO format for indicating the span of the labels (Sang and Veenstra, 1999).", 
        "143": "We use two approaches for tackling this task: a) CRF is used to train a model for directly predicting token labels, b) A pipeline approach where the NB model from Task 1 is used to filter relevant sentences.", 
        "144": "A CRF model is then trained to predict token labels for relevant sentences.", 
        "145": "The CRF model in Approach 1 is trained on the entire training set, whereas the CRF model in Approach 2 is trained only on the gold relevant sentences in the training set.", 
        "146": "For features in both approaches, we use unigrams and bigrams, part-of-Speech labels from the Stanford POStagger (Toutanova et al., 2003), and Brown clustering features after optimizing the cluster size (Brown et al., 1992).", 
        "147": "A C++ implementation of the Brown clustering algorithm is\nused (Liang, 2005).", 
        "148": "The Brown cluster was trained on a larger corpus of APT reports, consisting of 103 APT reports not in the annotated database and the 23 APT reports from the training set.", 
        "149": "We group together low-frequency words that appear 4 or less times in the set of 126 APT reports into one cluster and during testing we assign new words into this cluster.", 
        "150": "Results: Table 3 demonstrates that Approach 2 outperforms Approach 1 on most scores.", 
        "151": "Nevertheless, both approaches still give low performance for tackling Task 2 with F1-scores below 50 points.", 
        "152": "Discussion: There seem to be three main categories of wrong predictions:\n1.", 
        "153": "Sentences describing attacker actions Such sentences are also a main source of prediction errors in Task 1.", 
        "154": "Again, most sentences describing attackers are deemed irrelevant and left unannotated because we focus on malware actions rather than human attacker actions.", 
        "155": "However, these sentences may be annotated in cases where the attacker’s actions imply a malware action or capability.", 
        "156": "For example, the Figure 6a describes the attackers stealing credentials.", 
        "157": "This implies that the malware used is capable of stealing and exfiltrating credentials.", 
        "158": "It may be challenging for the model to distinguish whether such sentences describing attackers should be annotated since a level of inference is required.", 
        "159": "2.", 
        "160": "Sentences containing noun-phrases made up of participial phrases and/or prepositional phrases\nThese sentences contain complex noun-phrases with multiple verbs and prepositions, such as in Figures 6b and 6c.", 
        "161": "In Figure 6b, “the RCS sample sent to Ahmed” is a noun-phrase annotated as a single Subject/Entity.", 
        "162": "However, the model decomposes the noun-phrase into the subsidiary noun “the RCS sample” and participial phrase “sent to Ahmed” and further decompose the participial phrase into the constituent words, predict-\ning Action, Modifier and Entity labels for “sent”, “to” and “Ahmed” respectively.", 
        "163": "There are cases where such decomposition of noun-phrases is correct, such as in Figure 6c.", 
        "164": "As mentioned in Section 3.7, this is also a challenge for human annotators because there may be several ways to decompose the sentence, many of which serve equally well to highlight certain malware aspects (see Figure 4).", 
        "165": "Whether such decomposition is correct depends on the information that can be extracted from the decomposition.", 
        "166": "For instance, the decomposition in Figure 6c implies that the malware can receive remote commands from attackers.", 
        "167": "In contrast, the decomposition predicted by the model in Figure 6b does not offer any insight into the malware.", 
        "168": "This is a difficult task that requires recognition of the phrase spans and the ability to decide which level of decomposition is appropriate.", 
        "169": "3.", 
        "170": "Sentences containing noun-phrases made up of determiners and adjectives\nThese sentences contain noun-phrases with determiners and adjectives such as “All the requests” in Figure 6d.", 
        "171": "In such cases, the model may only predict the Entity label for part of the noun-phrase.", 
        "172": "This is shown in Figure 6d, where the model predicts the Entity label for “the requests” instead of “All the requests”.", 
        "173": "Thus, we also consider a relaxed scoring scheme where predictions are scored in token level instead of phrase level (see Table 4).", 
        "174": "The aim of the relaxed score is to give credit to the model when the span for a predicted label intersects with the span for the actual label, as in Figure 6d.", 
        "175": "5.3 Task 3 - Predict relation labels  Following the prediction of token labels in Task 2, we move on to Task 3 for building a model for predicting relation labels.", 
        "176": "Due to the low performance of the earlier models for predicting token labels, for this experiment we decided to use the gold token labels as input into the model for predicting relation labels.", 
        "177": "Nevertheless, the models can still be chained in a pipeline context.", 
        "178": "The task initially appeared to be similar to a dependency parsing task where the model predicts dependencies between the entities demarcated by the token labels.", 
        "179": "However, on further inspection, we realized that there are several entities which have more than one parent entity (see Figure 7).", 
        "180": "As such, we treat the task as a binary classification task, by enumerating all possible pairs of entities and predicting whether there is a relation between each pair.", 
        "181": "Predicting the relation labels from the token labels seem to be a relatively straightforward task and hence we design a simple rule-based model for the predictions.", 
        "182": "We tuned the rule-based model on one of the documents (AdversaryIntelligenceReport_DeepPanda_0 (1)) and tested it on the remaining 38 documents.", 
        "183": "The rules are documented in Appendix B.", 
        "184": "Results: Table 5 shows the scores from testing the model on the remaining 38 documents.", 
        "185": "The results from the rule-based model are better than expected, with the average F1-scores exceeding 84 points for all the labels.", 
        "186": "This shows that the relation labels can be reliably predicted given good predictions of the preceding token labels.", 
        "187": "Discussion: The excellent performance from the rule-based model suggests that there is a welldefined structure in the relations between the entities.", 
        "188": "It may be possible to make use of this inherent structure to help improve the results for predicting the token labels.", 
        "189": "Also, notice that by predicting the SubjAction, ActionObj and ActionMod relations, we are simultaneously classifying the ambiguous Entity labels into specific Subject and Object labels.", 
        "190": "For instance, Rule 1 predicts a ModObj relation be-\ntween a Modifier and an Entity, implying that the Entity is an Object, whereas Rule 3 predicts a SubjAction relation between an Entity and an Action, implying that the Entity is a Subject.", 
        "191": "5.4 Task 4 - Predict attribute labels  A significant obstacle in the prediction of attribute labels is the large number of attribute labels available.", 
        "192": "More precisely, we discover that many of these attribute labels occur rarely, if not never, in the annotated reports.", 
        "193": "This results in a severely sparse dataset for training a model.", 
        "194": "Due to the lack of substantial data, we decide to use token groups instead of entire sentences for predicting attribute labels.", 
        "195": "Token groups are the set of tokens that are linked to each other via relation labels.", 
        "196": "We extract the token groups from the gold annotations and then build a model for predicting the attribute labels for each token group.", 
        "197": "Again, we use a bag-of-words model to represent the token groups while SVM and NB are each used to build a model for predicting attribute labels.", 
        "198": "Results: Table 6 shows the average scores over 5 runs for the four separate attribute categories.", 
        "199": "For this task, SVM appears to perform generally better than NB, although much more data seems to be required in order to train a reliable model for predicting attribute labels.", 
        "200": "The Capability category shows the best performance, which is to be expected, since the Capability attributes occur the most frequently.", 
        "201": "Discussion: The main challenge for this task is the sparse data and the abundant attribute labels available.", 
        "202": "In fact, out of the 444 attribute labels, 190 labels do not appear in the database.", 
        "203": "For the remaining 254 attribute labels that do occur in the database, 92 labels occur less than five times and 50 labels occur only once.", 
        "204": "With the sparse data\navailable, particularly for rare attribute labels, effective one-shot learning models might have to be designed to tackle this difficult task.", 
        "205": "5.5 Task 5 - Predict malware signatures using text and annotations  Conventional malware analyzers, such as malwr.com, generate a list of signatures based on the malware’s activities in a sandbox.", 
        "206": "Examples of such signatures include antisandbox_sleep, which indicates anti-sandbox capabilities or persistence_autorun, which indicates persistence capabilities.", 
        "207": "If it is possible to build an effective model to predict malware signatures based on natural language texts about the malware, this can help cybersecurity researchers predict signatures of malware samples that are difficult to obtain, using the malware reports freely available online.", 
        "208": "By analyzing the hashes listed in each APT report, we obtain a list of signatures for the malware discussed in the report.", 
        "209": "However, we are unable to obtain the signatures for several hashes due to restricted distribution of malware samples.", 
        "210": "There are 8 APT reports without any obtained signatures, which are subsequently discarded for the following experiments.", 
        "211": "This leaves us with 31 out of 39 APT reports.", 
        "212": "The current list of malware signatures from Cuckoo Sandbox3 consists of 378 signature types.", 
        "213": "However, only 68 signature types have been identified for the malware discussed in the 31 documents.", 
        "214": "Furthermore, out of these 68 signature types, 57 signature types appear less than 10 times, which we exclude from the experiments.", 
        "215": "The experiments that follow will focus on predicting the remaining 11 signature types using the 31 documents.", 
        "216": "The OneVsRestClassifier implementation in scikit-learn is used in the following experiments, since this is a multilabel classification problem.", 
        "217": "We also use SVM and NB to build two types of\n3https://cuckoosandbox.org/\nmodels for comparison.", 
        "218": "Three separate methods are used to generate features for the task: a) the whole text in each APT report is used as features via a bag-of-words representation, without annotations, b) the gold labels from the annotations are used as features, without the text, and c) both the text and the gold annotations are used, via a concatenation of the two feature vectors.", 
        "219": "Results: Comparing the first two rows in Table 7, we can see that using the annotations as features significantly improve the results, especially the precision.", 
        "220": "SVM model also seems to benefit more from the annotations, even outperforming NB in one case.", 
        "221": "Discussion: The significant increase in precision suggests that the annotations provide a condensed source of features for predicting malware signatures, improving the models’ confidence.", 
        "222": "We also observe that some signatures seem to benefit more from the annotations, such as persistence_autorun and has_pdb.", 
        "223": "In particular, persistence_autorun has a direct parallel in attribute labels, which is MalwareCapability-persistence, showing that using MAEC vocabulary as attribute labels is appropriate.", 
        "224": "6 Conclusion  In this paper, we presented a framework for annotating malware reports.", 
        "225": "We also introduced a database with 39 annotated APT reports and proposed several new tasks and built models for extracting information from the reports.", 
        "226": "Finally, we discuss several factors that make these tasks extremely challenging given currently available models.", 
        "227": "We hope that this paper and the accompanying database serve as a first step towards NLP being applied in cybersecurity and that other researchers will be inspired to contribute to the database and to construct their own datasets and implementations.", 
        "228": "More details about this database can be found at http://statnlp.org/research/re/.", 
        "229": "Acknowledgments  We would like to thank the anonymous reviewers for their helpful comments.", 
        "230": "This work is supported by ST Electronics – SUTD Cyber Security Laboratory Project 1 Big Data Security Analytics, and is partly supported by MOE Tier 1 grant SUTDT12015008.", 
        "231": "A Attribute Labels  The following elaborates on the types of malware actions described by each class of attribute labels and gives specific examples.", 
        "232": "A.1 ActionName The ActionName labels describe specific actions taken by the malware, such as downloading a file ActionName: 090: Network- download_ file or creating a registry key ActionName: 135: Registry-create_registry_key.", 
        "233": "A.2 Capability The Capability labels describe general capabilities of the malware, such as exfiltrating\nstolen data Capability: 006: MalwareCapabilitydata_exfiltration or spying on the victim Capability: 019: MalwareCapability-spying.", 
        "234": "A.3 StrategicObjectives\nThe StrategicObjectives labels elaborate on the Capability labels and provide more details on the capabilities of the malware, such as preparing stolen data for exfiltration StrategicObjectives: 021: DataExfiltrationstage_data_for_exfiltration or capturing information from input devices connected to the victim’s machine StrategicObjectives: 061: Spyingcapture_system_input_peripheral_data.", 
        "235": "Each StrategicObjectives label belongs to a Capability label.", 
        "236": "A.4 TacticalObjectives\nThe TacticalObjectives labels provide third level of details on the malware’s capability, such as encrypting stolen data for exfiltration TacticalObjectives: 053: DataExfiltration-encrypt_data or an ability to perform key-logging TacticalObjectives: 140: Spying-capture_keyboard_input.", 
        "237": "Again, each TacticalObjectives label belongs to a Capability label.", 
        "238": "B Rules for Rule-based Model in Task 3  The following are the rules used in the rule-based model described in Section 5.3.", 
        "239": "1.", 
        "240": "If a Modifier is followed by an Entity, a Mod-\nObj relation is predicted between the Modifier and the Entity 2.", 
        "241": "If an Action is followed by an Entity, an ActionObj relation is predicted between the Action and the Entity 3.", 
        "242": "If an Entity is followed by an Action of tokenlength 1, a SubjAction relation is predicted between the Entity and the Action 4.", 
        "243": "An ActionObj relation is predicted between any Action that begins with be and the most recent previous Entity 5.", 
        "244": "An ActionObj relation is predicted between any Action that begins with is, was, are or were and ends with -ing and the most recent previous Entity 6.", 
        "245": "An ActionMod relation is predicted between all Modifiers and the most recent previous Action"
    }, 
    "document_id": "P17-1143.pdf.json"
}
