{
    "abstract_sentences": {
        "1": "People around the globe respond to major real world events through social media.", 
        "2": "To study targeted public sentiments across many languages and geographic locations, we introduce multilingual connotation frames: an extension from English connotation frames of Rashkin et al.", 
        "3": "(2016) with 10 additional European languages, focusing on the implied sentiments among event participants engaged in a frame.", 
        "4": "As a case study, we present large scale analysis on targeted public sentiments toward salient events and entities using 1.2 million multilingual connotation frames extracted from Twitter."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 459–464 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2073  1 Introduction  People around the globe use social media to express their reflections and opinions on major real world events (Atefeh and Khreich, 2015; Radinsky and Horvitz, 2013).", 
        "2": "In order to facilitate multilingual public sentiment tracking on social media, we introduce multilingual connotation frames,1 a multilingual extension from English connotation frames of Rashkin et al.", 
        "3": "(2016) with 10 additional European languages, including low-resource languages such as Polish, Finnish, and Russian.", 
        "4": "Definition 1.1.", 
        "5": "Connotation Frames: A framework for encoding predicate-specific connotative relationships implied by a predicate towards its arguments.", 
        "6": "Figure 1 shows a selected subset of the connotation frames that is relevant in our study.", 
        "7": "See Rashkin et al.", 
        "8": "(2016) for the full description of the connotation frames.", 
        "9": "1Publicly available at homes.cs.washington.", 
        "10": "edu/~hrashkin/multicf.html.", 
        "11": "English Verb: survive Other languages: survivre, sobrevivir, überleben…\n“L'incroyable miraculé des explosions à Brussels: ce Mormon avait déjà survécu aux attentats de Boston et de Paris”\n“Este joven ha sobrevivido a los atentados de Boston, de París y de Bruselas”\n“US teenager … also survived Boston Marathon bombing”\n“19-jähriger Missionar überlebt drei Terroranschläge”\nExample Tweets\n=Reader\n———\nThere are two important benefits to develop multilingual connotation frames.", 
        "12": "First, they serve as a unique lexical resource to enable targeted sentiment analysis, which rarely exists for most languages.", 
        "13": "Definition 1.2.", 
        "14": "Targeted Sentiment: A sentiment label indicating how a source entity feels about a target entity.", 
        "15": "In the example shown in Figure 1, “teenager survived Boston Marathon bombing”, the connotation frame allows us to correctly interpret (implied) targeted sentiments including:\n1. sentiment(teenager→ bombing) = – 2. sentiment(writer→ bombing) = – 3. sentiment(writer→ teenager) = + Second, they allow us to study a broad spectrum of sentiments including nuanced ones; in the ex-\n459\namples discussed above, connotation frames allow us to infer (1) the likely sentiment among the event participants (e.g., a surviving teenager is likely to be negative toward the Boston bombing), and (2) the likely sentiment of the author towards events and entities (e.g., the writer is likely to be sympathetic toward the teenager while negative toward the incident), even though none of these sentiment implications are overtly expressed.", 
        "16": "To validate the empirical utility of the new multilingual connotation lexicon, we present a successful case study of large scale connotation analysis (Section 4.1) and forecast (Section 4.2) based on connotation frames extracted from 1.2 million tweets in 10 different European languages spanning over a 15 day period.", 
        "17": "2 Multilingual Twitter Dataset  We obtained multilingual geo-located tweets spanning Mar 15 – Mar 29, 2016.", 
        "18": "This 15 day duration covers Brussels attacks on Mar 22 as well as one whole week before and after, allowing us to study the public sentiment dynamics in response to a major terrorist event.", 
        "19": "We focus on tweets that are likely to be about “news-worthy” topics by selecting tweets that came from trusted sources such as twitter-verified accounts or known news accounts, or contained hashtags #breaking or #news.2 We used SyntaxNet dependency parser (Andor et al., 2016) and trained additional SyntaxNet models for 10 non-English languages using Universal Dependencies annotations.3 We extracted 1.2 million agent-verb-theme tuples as listed in Table 1.", 
        "20": "2We experimented with other automatic ways of finding news sources by identifying popular hashtags, but this method did not translate well to other languages.", 
        "21": "3http://universaldependencies.org/  3 Methods    3.1 Multilingual Connotation Frames  We perform context-based projection of English connotation frames to 10 additional European languages using large parallel corpora.", 
        "22": "Since connotation of a word arises from the context in which the word is used, we want to ensure the translated connotation frames are used in similar contexts.", 
        "23": "We use existing parallel corpora with automatic word-alignment: the Opus Corpus (Tiedemann, 2012) using Multi-UN parallel data (Eisele and Chen, 2010) for Russian and EuroParl parallel data (Koehn, 2005) for all other languages.", 
        "24": "More concretely, for each non-English verb, v′ (e.g., assassiner in French), we compute the probability of it being translated to English verb v by counting the alignments.", 
        "25": "We then define the connotation frame of v′, F(v′), by transferring the connotation frame of the English verb v∗, F(v∗), that has the highest translation probability:\nv∗ = argmaxvp(v|v′)\nF(v′) = F(v∗) For example, the connotation frame for assassiner is propagated from murder, the English word that it is aligned with the most.", 
        "26": "3.2 Extracting Targeted Sentiments  Using the connotation frame lexicon, we compute the distribution of targeted sentiments towards most-frequently-mentioned named entities.", 
        "27": "We also compute sentiments expressed by each\ncountry by aggregating all sentiments of the writers located in that country (e.g., the distribution of positive, neutral, and negative perspectives expressed towards Obama in British tweets).", 
        "28": "The aggregated polarities can be represented as a 3- dimensional probability vector, p = [p+p=p−], as will be used in the sentiment forecast task below.", 
        "29": "For other analysis, we summarize this polarity distribution as a scalar score by taking the expected value of the polarity: E[p] = p+ − p−.", 
        "30": "3.3 Forecasting Sentiment Dynamics  We also study forecasting sentiment dynamics: predicting the sentiment distribution of the next day given the sentiment trend of previous days.", 
        "31": "For this task, we track the distribution of directional sentiments from each country towards the hundred most-frequently-mentioned named entities.", 
        "32": "At test-time, each model is given directional sentiment distributions for the previous 4 days as input and predicts tomorrow’s distribution (e.g., forecasting 1 day ahead).", 
        "33": "We also train models for predicting the distribution half a week later (forecasting 4 days ahead).", 
        "34": "We performed an additional experiment for English (ENJ ) where the perspectives of all countries are aggregated together in order to predict the global perspective.", 
        "35": "For all experiments, we use 10-fold cross-validation and measure the symmetric Kullback-Leibler (KL) divergence between the true distribution and the predicted one.", 
        "36": "We experiment with Long Short-term Memory\nmodels (LSTMs) (Hochreiter and Schmidhuber, 1997) to integrate the dynamic contextual information from the past, as depicted in 2.", 
        "37": "Hidden dimension is 16, and we use ADAM optimization with KL divergence as the objective.", 
        "38": "For implementation, we use Keras4 on top of Theano.5\nBaselines We use two baselines.", 
        "39": "The first is MEAN, the average distribution seen in the training data.", 
        "40": "The second are SVMs with linear kernels, which worked well in predicting influenza activity in a similar set-up (Santillana et al., 2015).", 
        "41": "For the baselines, we encode the distributions from the 4 previous days as a flattened 12-dim.", 
        "42": "vector, and each portion of the distribution is predicted separately.", 
        "43": "4 Results    4.1 Connotation Analysis  For the most frequently mentioned named entities, we compute heatmaps of the expected perspective being expressed towards that entity.", 
        "44": "In Figure 3A, we use the English tweets from European countries to plot the change in connotative polarity towards these entities over the course of the 15 day period.", 
        "45": "Generally, the changes in polarity from day-to-day seem to be gradual and frequently are similar to the day before.", 
        "46": "There are a couple of exceptions e.g., the polarity towards\n4https://keras.io 5https://deeplearning.net/software/\ntheano\nBrussels changes abruptly on March 22 (the day of the Brussels attacks), reflecting the change in tone of all tweets related to Brussels at that time.", 
        "47": "Overall, there are mostly positive polarities expressed.", 
        "48": "This may reflect people’s tendency to avoid phrasing stories too harshly, choosing to be more euphemistic even when they discuss bad news.", 
        "49": "In Figure 3B, we aggregated the polarities of these tweets by country of origin.", 
        "50": "While most of the polarities are positive-strongly positive, the tweets about Brussels and Belgium are more neutral or even slightly negative.", 
        "51": "Lastly, in Figure 3C, we used all of the tweets from European countries to aggregate expected polarities in 11 different languages.", 
        "52": "Non-English languages show a much higher tendency towards positive scores, particularly the languages with less tweets (Polish, Finnish, Swedish).", 
        "53": "As a more detailed analysis, Figure 4 shows a heatmap of how the connotation expressed towards Obama shifts over time across different languages.", 
        "54": "Obama was not discussed much in Finnish or Swedish, whereas he was discussed everyday in English, Spanish, and Russian.", 
        "55": "In the middle of the two week period, the perspective towards Obama drops slightly, most notably in Spanish, which overlaps with his controversial trip to Cuba (March 20 – 22).", 
        "56": "4.2 Sentiment Dynamics  In Table 2, we summarize the results of our experiments for predicting targetted sentiment dynamics.", 
        "57": "For each language, we report the average Kullback-Leibler divergence for the baselines and the LSTM model (higher scores are worse).", 
        "58": "We show prediction results in two settings: predicting\nthe distribution one day ahead vs. four days ahead.", 
        "59": "The LSTM outperforms the baselines in most languages with a few exceptions, such as Portuguese.", 
        "60": "All models perform worse at forecasting 4 days into the future than one day ahead, demonstrating how much connotation can vary over time as news events change, even in a small time period.", 
        "61": "On average, the LSTM achieves KL-divergence of 1.7 when predicting one day ahead and 3.26 when predicting 4 days ahead, lower than any of the baselines.", 
        "62": "4.3 Error Analysis  For error analysis, we removed entities from Figure 3 from the training data and used them as a small test set for an LSTM trained on the remaining data in English with aggregation over all countries.", 
        "63": "In Figure 5, we have plotted the predicted marginal probabilities of four entities with the positive portion of the distribution (blue line) on the top half of the y-axis and the negative portion (red line) flipped onto the negative half of the axis.", 
        "64": "The LSTM follows the general shape of the true curves, but frequently misses sudden spikes (e.g., the spike in negative polarity towards Russia on March 27th).", 
        "65": "In Table 3, we also report the KL divergences on predictions towards these entities.", 
        "66": "The model tends to perform less well at predicting sentiment towards entities where there were sudden spikes in sentiment based on news stories.", 
        "67": "5 Related Work  There have been substantial studies for sentiment analysis on twitter (Agarwal et al., 2011; Kouloumpis et al., 2011; Pak and Paroubek, 2010;\nLiu and Zhang, 2012), as well as targetted sentiment (Deng and Wiebe, 2015), implicit sentiment (Deng and Wiebe, 2014; Feng et al., 2013; Greene and Resnik, 2009) and specific aspects of subjective language (Mohammad and Turney, 2010; Choi and Wiebe, 2014) in other domains.", 
        "68": "Previous investigations include using targetted sentiment to predict international relations (Chambers et al., 2015), analyzing stylistic elements to predict tweet popularity (Tan et al., 2014), and exploring the re-phrasing of social media posts referencing specific news articles (Tan et al., 2016).", 
        "69": "Compared to most prior studies that focused on overt sentiment in English-only tweets, our work aims to study targeted implied sentiments across temporal, spatial, and linguistic borders.", 
        "70": "Some work (Tsytsarau et al., 2014; O’Connor et al., 2010; De et al., 2016) has analyzed the transition of overt sentiment over a period of time and related the shifts in sentiment to news events.", 
        "71": "A body of work has also used predictive signals in Twitter to track and sense upcoming unrest and protests in specific countries (Ramakrishnan et al., 2014; Goode et al., 2015), and the future progression of flu activity based on multiple text sources (Santillana et al., 2015).", 
        "72": "In contrast, we focus on\npredicting the sentiment dynamics in social media based on previous trends.", 
        "73": "6 Conclusions  When reporting news, people write with their own implicit and explicit biases and judgments.", 
        "74": "An author’s choice of language reveals connotations towards entities, which can be captured within the connotation frames that we have extended to 10 European languages.", 
        "75": "This work is one of the first to present a large scale analysis of multilingual connotation dynamics, and helps explore multiple perspectives on diverse issues across languages, time and countries – a critical piece in understanding journalistic portrayal and biases.", 
        "76": "7 Acknowledgments  This research was conducted at Pacific Northwest National Laboratory, a multiprogram national laboratory operated by Battelle for the U.S. We would like to thank Josh Harrison, Jill Schroeder and Justin Day for their contribution.", 
        "77": "We would also like to thank anonymous reviewers for providing insightful feedback.", 
        "78": "This material is based upon work supported by the National Science Foundation Graduate Research Fellowship Program under Grant No.", 
        "79": "DGE-1256082, in part by NSF grants IIS-1408287, IIS-1524371, and gifts by Google and Facebook."
    }, 
    "document_id": "P17-2073.pdf.json"
}
