{
    "abstract_sentences": {
        "1": "Cross-lingual text classification(CLTC) is the task of classifying documents written in different languages into the same taxonomy of categories.", 
        "2": "This paper presents a novel approach to CLTC that builds on model distillation, which adapts and extends a framework originally proposed for model compression.", 
        "3": "Using soft probabilistic predictions for the documents in a label-rich language as the (induced) supervisory labels in a parallel corpus of documents, we train classifiers successfully for new languages in which labeled training data are not available.", 
        "4": "An adversarial feature adaptation technique is also applied during the model training to reduce distribution mismatch.", 
        "5": "We conducted experiments on two benchmark CLTC datasets, treating English as the source language and German, French, Japan and Chinese as the unlabeled target languages.", 
        "6": "The proposed approach had the advantageous or comparable performance of the other state-of-art methods."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1415–1425 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1130  1 Introduction  The availability of massive multilingual data on the Internet makes cross-lingual text classification (CLTC) increasingly important.", 
        "2": "The task is defined as to classify documents in different languages using the same taxonomy of predefined categories.", 
        "3": "CLTC systems build on supervised machine learning require a sufficiently amount of labeled training data for every domain of interest in each language.", 
        "4": "But in reality, labeled data are not evenly distributed among languages and across domains.", 
        "5": "English, for example, is a label-rich lan-\nguage in the domains of news stories, Wikipedia pages and reviews of hotels, products, etc.", 
        "6": "But many other languages do not necessarily have such rich amounts of labeled data.", 
        "7": "This leads to an open challenge in CLTC, i.e., how can we effectively leverage the trained classifiers in a label-rich source language to help the classification of documents in other label-poor target languages?", 
        "8": "Existing methods in CLTC use either a bilingual dictionary or a parallel corpus to bridge language barriers and to translate classification models (Xu et al., 2016) or text data(Zhou et al., 2016a).", 
        "9": "There are limitations and challenges in using either type of resources.", 
        "10": "Dictionary-based methods often ignore the dependency of word meaning and its context, and cannot leverage domainspecific disambiguation when the dictionary on hand is a general-purpose one.", 
        "11": "Parallel-corpus based methods, although more effective in deploying context (when combined with word embedding in particular), often have an issue of domain mismatch or distribution mismatch if the available source-language training data, the parallel corpus (human-aligned or machine-translation induced one) and the target documents of interest are not in exactly the same domain and genre(Duh et al., 2011).", 
        "12": "How to solve such domain/distribution mismatch problems is an open question for research.", 
        "13": "This paper proposes a new parallel-corpus based approach, focusing on the reduction of domain/distribution matches in CLTC.", 
        "14": "We call this approach Cross-lingual Distillation with Feature Adaptation or CLDFA in short.", 
        "15": "It is inspired by the recent work in model compression (Hinton et al., 2015) where a large ensemble model is transformed to a compact (small) model.", 
        "16": "The assumption of knowledge distillation for model compression is that the knowledge learned by the large model can be viewed as a mapping from in-\n1415\nput space to output (label) space.", 
        "17": "Then, by training with the soft labels predicted by the large model, the small model can capture most of the knowledge from the large model.", 
        "18": "Extending this key idea to CLTC, if we see parallel documents as different instantiations of the same semantic concepts in different languages, a target-language classifier should gain the knowledge from a welltrained source classifier by training with the targetlanguage part of the parallel corpus and the soft labels made by the source classifier on the source language side.", 
        "19": "More specifically, we propose to distillate knowledge from the source language to the target language in the following 2-step process:\n• Firstly, we train a source-language classifier with both labeled training documents and adapt it to the unlabeled documents from the source-language side of the parallel corpus.", 
        "20": "The adaptation enforces our classifier to extract features that are: 1) discriminative for the classification task and 2) invariant with regard to the distribution shift between training and parallel data.", 
        "21": "• Secondly, we use the trained source-language classifier to obtain the soft labels for a parallel corpus, and the target-language part of the parallel corpus to train a target classifier, which yields a similar category distribution over target-language documents as that over source-language documents.", 
        "22": "We also use unlabeled testing documents in the target language to adapt the feature extractor in this training step.", 
        "23": "Intuitively, the first step addresses the potential domain/distribution mismatch between the labeled data and the unlabeled data in the source language.", 
        "24": "The second step addresses the potential mismatch between the target-domain training data (in the parallel corpus) and the test data (not in the parallel corpus).", 
        "25": "The soft-label based training of target classifiers makes our approach unique among parallel-corpus based CLTC methods (Section 2.1.", 
        "26": "The feature adaptation step makes our framework particularly robust in addressing the distributional difference between in-domain documents and parallel corpus, which is important for the success of CLTC with low-resource languages.", 
        "27": "The main contributions in this paper are the following:\n• We propose a novel framework (CLDFA) for knowledge distillation in CLTC through a parallel corpus.", 
        "28": "It has the flexibility to be built on a large family of existing monolingual text classification methods and enables the use of a large amount of unlabeled data from both source and target language.", 
        "29": "• CLDFA has the same computational complexity as the plug-in text classification method and hence is very efficient and scalable with the proper choice of plug-in text classifier.", 
        "30": "• Our evaluation on benchmark datasets shows that our method had a better or at least comparable performance than that of other stateof-art CLTC methods.", 
        "31": "2 Related Work  Related work can be outlined with respect to the representative work in CLTC and the recent progress in deep learning for knowledge distillation.", 
        "32": "2.1 CLTC Methods  One branch of CLTC methods is to use lexical level mappings to transfer the knowledge from the source language to the target language.", 
        "33": "The work by Bel et al.", 
        "34": "(Bel et al., 2003) was the first effort to solve CLTC problem.", 
        "35": "They translated the target-language documents to source language using a bilingual dictionary.", 
        "36": "The classifier trained in the source language was then applied on those translated documents.", 
        "37": "Similarly, Mihalcea et al.", 
        "38": "(Mihalcea et al., 2007) built cross-lingual classifier by translating subjectivity words and phrases in the source language into the target language.", 
        "39": "Shi et al.", 
        "40": "(Shi et al., 2010) also utilized a bilingual dictionary.", 
        "41": "Instead of translating the documents, they tried to translate the classification model from source language to target language.", 
        "42": "Prettenhofer and Stein.", 
        "43": "(Prettenhofer and Stein, 2010) also used the bilingual dictionary as a word translation oracle and built their CLTC system on structural correspondence learning, a theory for domain adaptation.", 
        "44": "A more recent work by (Xu et al., 2016) extended seminal bilingual dictionaries with unlabeled corpora in low-resource languages.", 
        "45": "Chen et al.", 
        "46": "(Chen et al., 2016) used bilingual word embedding to map documents in source and target\nlanguage into the same semantic space, and adversarial training was applied to enforce the trained classifier to be language-invariant.", 
        "47": "Some recent efforts in CLTC focus on the use of automatic machine translation (MT) technology.", 
        "48": "For example, Wan (Wan, 2009) used machine translation systems to give each document a source-language and a target-language version, where one version is machine-translated from the another one.", 
        "49": "A co-training (Blum and Mitchell, 1998) algorithm was applied on two versions of both source and target documents to iterative train classifiers in both languages.", 
        "50": "MTbased CLTC also include the work on multi-view learning with different algorithms, such as majority voting(Amini et al., 2009), matrix completion(Xiao and Guo, 2013) and multi-view coregularization(Guo and Xiao, 2012a).", 
        "51": "Another branch of CLTC methods focuses on representation learning or the mapping of the induced representations in cross-language settings (Guo and Xiao, 2012b; Zhou et al., 2016a, 2015, 2016b; Xiao and Guo, 2013; Jagarlamudi et al., 2011; De Smet et al., 2011; Vinokourov et al., 2002; Platt et al., 2010; Littman et al., 1998).", 
        "52": "For example, Meng et al.", 
        "53": "(Meng et al., 2012) and Lu et al.", 
        "54": "(Lu et al., 2011) used a parallel corpus to learn word alignment probabilities in a pre-processing step.", 
        "55": "Some other work attempts to find a languageinvariant (or interlingua) representation for words or documents in different languages using various techniques, such as latent semantic indexing (Littman et al., 1998), kernel canonical correlation analysis (Vinokourov et al., 2002), matrix completion(Xiao and Guo, 2013), principal component analysis (Platt et al., 2010) and Bayesian graphical models (De Smet et al., 2011).", 
        "56": "2.2 Knowledge Distillation  The idea of distilling knowledge in a neural network was proposed by Hinton et al (Hinton et al., 2015), in which they introduced a student-teacher paradigm.", 
        "57": "Once the cumbersome teacher network was trained, the student network was trained according to soften predictions of the teacher network.", 
        "58": "In the field of computer vision, it has been empirically verified that student network trained by distillation performs better than the one trained with hard labels.", 
        "59": "(Hinton et al., 2015; Romero et al., 2014; Ba and Caruana, 2014).", 
        "60": "Gupta et al.", 
        "61": "(Gupta et al., 2015) transfers supervision be-\ntween images from different modalities(e.g.", 
        "62": "from RGB image to depth image).", 
        "63": "There are also some recent works applied distillation in the field of natural language.", 
        "64": "For example, Lili et al.", 
        "65": "(Mou et al., 2015) distilled task specific knowledge from a set of high-dimensional embeddings to a lowdimensional space.", 
        "66": "Zhiting et al.", 
        "67": "used an iterative distillation method to transfer the structured information of logic rules into the weights of a neural network.", 
        "68": "Kim et al.", 
        "69": "(Kim and Rush, 2016) applied knowledge distillation approaches in the field of machine translation to reduce the size of neural machine translation model.", 
        "70": "Our framework shares the same purpose of existing works that transfer knowledge between models of different properties, such as model complexity, modality, and structured logic.", 
        "71": "However, our transfer happens between models working on different languages.", 
        "72": "To the best of knowledge, this is the first work using knowledge distillation to bridge the language gap for NLP tasks.", 
        "73": "3 Preliminary    3.1 Task and Notation  CLTC aims to use the training data in the source language to build a model applicable in the target language.", 
        "74": "In our setting, we have labeled data in source language Lsrc = {xi, yi}Li=1, where xi is the labeled document in source language and yi is the label vector.", 
        "75": "We then have our test data in the target language, given by Ttgt = {x′i}Ti=1.", 
        "76": "Our framework can also use unlabeled documents from both languages in transductive learning settings.", 
        "77": "We use Usrc = {xi}Mi=1 to denote sourcelanguage unlabeled documents,Utgt = {x′i}Ni=1 to denote target-language unlabeled documents, and Uparl = {(xi, x′i)}Pi=1 to denote a unlabeled bilingual parallel corpus where xi and x′i are paired document translations of each other.", 
        "78": "We assume that the unlabeled parallel corpus does not overlap with the source-language training documents and the target-language test documents.", 
        "79": "3.2 Convolutional Neural Network (CNN) as a Plug-in Classifier  We use a state-of-the-art CNN-based neural network classifier (Kim, 2014) as the plug-in classifier in our framework.", 
        "80": "Instead of using a bag-ofwords representation for each document, the CNN model concatenates the word embeddings (vertical vectors) of each input document into a n × k\nmatrix, where n is the length (number of word occurrences) of the document, and k is the dimension of word embedding.", 
        "81": "Denoting by\nx1:n = x1 ⊕ x2 ⊕ ...⊕ xn\nas the resulted matrix, with ⊕ the concatenation operator.", 
        "82": "One-dimensional convolutional filter w ∈ Rhk with window size h operates on every consecutive h words, with non-linear function f and bias b.", 
        "83": "For window of size h started at index i, the feature after convolutional filter is given by:\nci = f(w · xi:i+h−1 + b)\nA max-over-time pooling (Collobert et al., 2011) is applied on c over all possible positions such that each filter extracts one feature.", 
        "84": "The model uses multiple filters with different window sizes.", 
        "85": "The concatenated outputs from filters consist the feature of each document.", 
        "86": "We can see the convolutional filters and pooling layers as feature extractor f = Gf (x, θf ), where θf contains parameters for embedding layer and convolutional layer.", 
        "87": "Theses features are then passed to a fully connected softmax layer to produce probability distributions over labels.", 
        "88": "We see the final fully connected softmax layer as a label classifier Gy(f , θy) that takes the output f from the feature extractor.", 
        "89": "The final output of model is given byGy(Gf (x, θf ), θy), which is jointly parameterized by {θf , θy}\nWe want to emphasize that our choice of the plug-in classifier here is mainly for its simplicity and scalability to demonstrate our framework.", 
        "90": "There is a large family of neural classifiers for monolingual text classification that could be used in our framework as well, including other convolutional neural networks by (Johnson and Zhang, 2014), the recurrent neural networks by (Lai et al., 2015; Zhang et al., 2016; Johnson and Zhang, 2016; Sutskever et al., 2014; Dai and Le, 2015), the attention mechanism by (Yang et al., 2016), the deep dense network by (Iyyer et al., 2015), and more.", 
        "91": "4 Proposed Framework  Let us introduce two versions of our model for cross-language knowledge distillation, i.e., the vanilla version and the full version with feature adaptation.", 
        "92": "Both are supported by the proposed framework.", 
        "93": "We denote the former by CLD-KCNN and the latter by CLDFA-KCNN.", 
        "94": "4.1 Vanilla Distillation  Without loss of generality, assume we are learning a multi-class classifier for the target language.", 
        "95": "We have y ∈ 1, 2, ..., |v |where v is the set of all possible classes.", 
        "96": "We assume the base classification network produces real number logits qj for each class.", 
        "97": "For example, for the case of CNN text classifier, the logits can be produced by a linear transformation which takes features extracted max-pooling layer and outputs a vector of size |v |.", 
        "98": "The logits are converted into probabilities of classes through the softmax layer, by normalizing each qj with all other logits.", 
        "99": "pj = exp(qj/T )∑|v | k=1 exp(qk/T )\n(1)\nwhere T is a temperature and is normally set to 1.", 
        "100": "Using a higher value of T produces a softer probability distribution over classes.", 
        "101": "The first step of our framework is to train the source-language classifier on labeled source documents Lsrc.", 
        "102": "We use standard temperature T = 1 and cross-entropy loss as the objective to minimize.", 
        "103": "For each example and its label (xi, yi) from the source training set, we have:\nL(θsrc) =\n− ∑\n(xi,yi)∈Lsrc\n|v |∑\nk=1\n1{yi = k} log p(y = k|xi; θsrc)\n(2)\nwhere p(y = k|x; θsrc) is source model controlled by parameter θsrc and 1{·} is the indicator function.", 
        "104": "In the second step, the knowledge captured in θsrc is transferred to the distilled model in the target language by training it on the parallel corpus.", 
        "105": "The intuition is that paired documents in parallel corpus should have the same distribution of class predicted by the source model and target model.", 
        "106": "In the simplest version of our framework, for each source-language document in the parallel corpus, we predict a soft class distribution by source model with high temperature.", 
        "107": "Then we minimize the cross-entropy between soft distribution produced by source model and the soft distribution produced by target model on the paired documents in the target language.", 
        "108": "More formally, we optimize θtgt according to the following loss\nfunction for each document pair (xi, x′i) in parallel corpus.", 
        "109": "L(θtgt) = − ∑ (xi,x′i)∈Uparl |v |∑\nk=1\np(y = k|xi; θsrc) log p(y = k|x′i; θtgt) (3)\nDuring distillation, the same high temperature is used for training target model.", 
        "110": "After it has been trained, we set the temperature to 1 for testing.", 
        "111": "We can show that under some assumptions, the two-step cross-lingual distillation is equivalent to distilling a target-language classifier in the targetlanguage input space.", 
        "112": "Lemma 1.", 
        "113": "Assume the parallel corpus {xi, x′i} ∈ Uparl is generated by x′i ∼ p(X ′; η) and xi = t(x′i), where η controls the marginal distribution of xi and t is a differentiable translation function with integrable derivative.", 
        "114": "Let fθsrc(t(x\n′)) be the function that outputs soft labels of p(y = k|t(x′); θsrc).", 
        "115": "The distillation given by equation 3 can be interpreted as distillation of a target language classifier fθsrc(t(x\n′)) on target language documents sampled from p(X ′; η).", 
        "116": "fθsrc(t(x ′)) is the classifier that takes input of target documents, translates them into source documents through t and makes prediction using the source classifier.", 
        "117": "If we further assume the testing documents have the same marginal distribution P (X ′; η), then the distilled classifier should have similar generalization power as fθsrc(t(x ′)).", 
        "118": "Theorem 2.", 
        "119": "Let source training data xi ∈ Lsrc has marginal distribution p(X;λ).", 
        "120": "Under the assumptions of lemma 1, further assume p(t(x′);λ) = p(x′; η), p(y|t(x′)) = p(y|x′) and t′(x′) ≈ C, where C is a constant.", 
        "121": "Then fθsrc(t(x\n′)) actually minimizes the expected loss in target language data Ex′∼p(X;η),y∼p(Y |x′)[L ( y, f(t(x′)) ) ].", 
        "122": "Proof.", 
        "123": "By definition of equation 2, fθsrc(x) minimizes the expected loss Ex∼p(X;λ),y∼p(Y |x)[L ( y, f(x) ) ], where L is\ncross-entropy loss in our case.", 
        "124": "Then we can write\nEx∼p(X;λ),y∼p(Y |x)[L ( y, f(x) ) ]\n= ∫ p(x;λ) ∑\ny\np(y|x)L ( y, f(x) ) dx\n= ∫ p(t(x′);λ) ∑\ny\np(y|t(x′))L ( y, f(t(x′)) ) t′(x′)dx′\n≈C ∫ p(x′; η) ∑\ny\np(y|x′)L ( y, f(t(x′)) ) dx′\n=CEx′∼p(X;η),y∼p(Y |x′)[L ( y, f(t(x′)) ) ]  4.2 Distillation with Adversarial Feature Adaptation  Although vanilla distillation is intuitive and simple, it cannot handle distribution mismatch issues.", 
        "125": "For example, the marginal feature distributions of source-language documents in Lsrc and Uparl could be different, so are the distributions of target-language documents in Uparl and Ttgt.", 
        "126": "According to theorem 2, the vanilla distillation works for the best performance under unrealistic assumption: p(t(x′)|λ) = p(x′|η).", 
        "127": "To further illustrate our point, we trained a CNN classifier according to equation 2 and used the features extracted by Gf to present the source-language documents in both Lsrc and Uparl.", 
        "128": "Then we projected the highdimensional features onto a 2-dimensional space via t-Distributed Stochastic Neighbor Embedding (t-SNE)(Maaten and Hinton, 2008).", 
        "129": "This resulted\nthe visualization of the project data in Figures 1 and 2.", 
        "130": "It is quite obvious in Figure 1 that the generalpurpose parallel corpus has a very different feature distribution from that of the labeled source training set.", 
        "131": "Even for machine-translated parallel data from the same domain, as shown in figure 2, there is still a non-negligible distribution shift from the source language to the target language for the extracted features.", 
        "132": "Our interpretation of this observation is that when the MT system (e.g.", 
        "133": "Google Translate) is a general-purpose one, it non-avoidably add translation ambiguities which would lead the distribution shift from the original domain.", 
        "134": "To address the distribution divergence brought by either a general-purpose parallel corpus or an imperfect MT system, we seek to adapt the features extraction part of our neural classifier such that the feature distributions on both sides should be close as possible in the newly induced feature space.", 
        "135": "We adapt the adversarial training method by (Ganin and Lempitsky, 2014) to the cross-lingual settings in our problems.", 
        "136": "Given a set of training set of L = {xi, yi}i=1,...,N and an unlabeled set U = {x′i}i=1,...,M , our goal is to find a neural classifier Gy(Gf (x, θf ), θy), which has good discriminative performance on L and also extracts features which have similar distributions on L and U .", 
        "137": "One way to maximize the similarity of two distributions is to maximize the loss of a discriminative classifier whose job is to discriminate the two feature distributions.", 
        "138": "We denote this classifier by Gd(·, θd), which is parameterized by θd.", 
        "139": "At training time, we seek θf to minimize the loss of Gy and maximize the loss of Gd.", 
        "140": "Meanwhile, θy and θd are also optimized to minimize their corresponding loss.", 
        "141": "The overall optimization could be summarized as follows:\nE(θf , θy, θd) = ∑\nxi,yi∈L Ly(yi, Gy(Gf (xi, θf ), θy))\n− α ∑\nxi∈L Ld(0, Gd(Gf (xi, θf ), θd))\n− α ∑\nxj∈U Ld(1, Gd(Gf (xj , θf ), θd))\nwhere Ly is the loss function for true labels y, Ld is loss function for binary labels indicating the source of data and α is the hyperparameter that controls the relative importance of two\nlosses.", 
        "142": "We optimize θf , θy for minimizing E and optimize θd for maximizing E. We jointly optimize θf , θy, θd through the gradient reversal layer(Ganin and Lempitsky, 2014).", 
        "143": "We use this feature adaptation technique to firstly adapt the source-language classifier to the source-language documents of the parallel corpus.", 
        "144": "When training the target-language classifier by matching soft labels on the parallel corpus, we also adapt the classifier to the target testing documents.", 
        "145": "We use cross-entropy loss functions as Ly and Ld for both feature adaptation.", 
        "146": "5 Experiments and Discussions    5.1 Dataset  Our experiments used two benchmark datasets, as described below.", 
        "147": "(1) Amazon Reviews\nWe used the multilingual multi-domain Amazon review dataset created by Prettenhofer and Stein (Prettenhofer and Stein, 2010).", 
        "148": "The dataset contains Amazon reviews in three domains: book, DVD and music.", 
        "149": "Each domain has the reviews in four different languages: English, German, French and Japanese.", 
        "150": "We treated English as the source language and the rest three as the target languages, respectively.", 
        "151": "This gives us 9 tasks (the product of the 3 domains and the 3 target languages) in total.", 
        "152": "For each task, there are 1000 positive and 1000 negative reviews in English and the target language, respectively.", 
        "153": "(Prettenhofer and Stein, 2010) also provides 2000 parallel reviews per task,\nthat were generated using Google Translate 1, and used by us for cross-language distillation.", 
        "154": "There are also several thousands of unlabeled reviews in each language.", 
        "155": "The statistics of unlabeled data is summarized in Table 1.", 
        "156": "All the reviews are tokenized using standard regular expressions except for Japanese, for which we used a publicly available segmenter 2.", 
        "157": "(2) English-Chinese Yelp Hotel Reviews This dataset was firstly used for CLTC by (Chen et al., 2016).", 
        "158": "The task is to make sentence-level sentiment classification with 5 labels(rating scale from 1 to 5), using English as the source language and Chinese as the target language.", 
        "159": "The labeled English data consists of balanced labels of 650k Yelp reviews from Zhang et al.", 
        "160": "(Zhang et al., 2015).", 
        "161": "The Chinese data includes 20k labeled Chinese hotel reviews and 1037k unlabeled ones from (Lin et al., 2015).", 
        "162": "Following the approach by (Chen et al., 2016), we use 10k of labeled Chinese data as validation set and another 10k hotel reviews as held-out test data.", 
        "163": "We a random sample of 500k parallel sentences from UM-courpus(Tian et al., 2014), which is a general-purpose corpus designed for machine translation.", 
        "164": "5.2 Baselines  We compare the proposed method with other stateof-the-art methods as outlined below.", 
        "165": "(1) Parallel-Corpus based CLTC Methods Methods in this category all use an unlabeled parallel corpus.", 
        "166": "Methods named PL-LSI (Littman\n1translate.google.com 2https://pypi.python.org/pypi/tinysegmenter\net al., 1998), PL-OPCA (Platt et al., 2010) and PL-KCAA (Vinokourov et al., 2002) learn latent document representations in a shared lowdimensional space by performing the Latent Semantic Indexing (LSI), the Oriented Principal Component Analysis (OPCA) and a kernel (namely KCAA) for the parallel text.", 
        "167": "PL-MC (Xiao and Guo, 2013) recovers missing features via matrix Completion, and also uses LSI to induce a latent space for parallel text.", 
        "168": "All these methods train a classifier in the shared feature space with labeled training data from both the source and target languages.", 
        "169": "(2) MT-based CLTC Methods The methods in this category all use an MT system to translate each test document in the target language to the source language in the testing phase.", 
        "170": "The prediction on each translated document is made by a source-language classifier, which can be a Logistic Regression model (MT+LR) (Chen et al., 2016) or a deep averaging network (MT+DAN) (Chen et al., 2016).", 
        "171": "(3) Adversarial Deep Averaging Network Similar to our approach, the adversarial Deep Averaging Network (ADAN) also exploits adversarial training for CLTC (Chen et al., 2016).", 
        "172": "However, it does not have the parallel-corpus based knowledge distillation part (which we do).", 
        "173": "Instead, it uses averaged bilingual embeddings of words as its input and adapts the feature extractor to produce similar features in both languages.", 
        "174": "We also include the results of mSDA for the Yelp Hotel Reviews dataset.", 
        "175": "mSDA (Chen et al., 2012) is a domain adaptation method based on\nstacked denoising autoencoders, which has been proved to be effective in cross-domain sentiment classification evaluations.", 
        "176": "We show the results reported by (Chen et al., 2012), where they used bilingual word embedding as input for mSDA.", 
        "177": "5.3 Implementation Detail  We pre-trained both the source and target classifier with unlabeled data in each language.", 
        "178": "We ran word2vec(Mikolov et al., 2013) 3 on the tokenized unlabeled corpus.", 
        "179": "The learned word embeddings are used to initialize the word embedding look-up matrix, which maps input words to word embeddings and concatenates them into input matrix.", 
        "180": "We fine-tuned the source-language classifier on the English training data with 5-fold crossvalidation.", 
        "181": "For English-Chinese Yelp-hotel review dataset, the temperature T (Section 4.1) in distillation is tuned on validation set in the target language.", 
        "182": "For Amazon review dataset, since there is no default validation set, we set temperature from low to high in {1, 3, 5, 10} and take the average among all predictions.", 
        "183": "3https://code.google.com/archive/p/word2vec/  5.4 Main Results  In tables 2 and 3 we compare the results of our methods (the vanilla version CLD-KCNN and the full version CLDFA-KCNN) with those of other methods based on the published results in the literature.", 
        "184": "The baseline methods are different in these two tables as they were previously evaluated (by their authors) on different benchmark datasets.", 
        "185": "Clearly, CLDFA-KCNN outperformed the other methods on all except one task in these two datasets, showing that knowledge distillation is successfully carried out in our approach.", 
        "186": "Noticing that CLDFA-KCNN outperformed CLD-KCNN, showing the effectiveness of adversarial feature extraction in reducing the distribution mismatch between the parallel corpus and the train/test data in the target domain.", 
        "187": "We should also point out that in Table 2, the four baseline methods (PL-LSI, PL-KCCA, PL-OPCA and PL-MC) were evaluated under the condition of using additional 100 labeled target documents for training, according to the author’s report (Xiao and Guo, 2013).", 
        "188": "On the other hand, our methods (CLD-KCNN and CLDFA-KCNN) were evaluated under a tougher condition, i.e., not using any labeled data in the target domains.", 
        "189": "We also test our framework when a few training documents in the target language are available.", 
        "190": "A simple way to utilize the target-language supervision is to fit the target-language model with labeled target data after optimizing with our crosslingual distillation framework.", 
        "191": "The performance of CLD-KCNN and CLDFA-KCNN trained with different sizes of labeled target-language data is shown in figure 3.", 
        "192": "We also compare the performance of training the same classifier using only\nthe target-language labels(Target Only in figure 3).", 
        "193": "As we can see, our framework can efficiently utilize the extra supervision and improve the performance over the training using only the targetlanguage labels.", 
        "194": "The margin is most significant when the size of the target-language label is relatively small.", 
        "195": "6 Conclusion  This work introduces a novel framework for distillation of discriminative knowledge across languages, providing effective and efficient algorithmic solutions for addressing domain/distribution mismatch issues in CLTC.", 
        "196": "The excellent performance of our approach is evident in our evaluation on two CLTC benchmark datasets, compared to that of other state-of-the-art methods.", 
        "197": "Acknowledgement  We thank the reviewers for their helpful comments.", 
        "198": "This work is supported in part by Defense Advanced Research Projects Agency Information Innovation Oce (I2O), the Low Resource Languages for Emergent Incidents (LORELEI) Program, Issued by DARPA/I2O under Contract No.", 
        "199": "HR0011-15-C-0114, by the National Science Foundation (NSF) under grant IIS-1546329."
    }, 
    "document_id": "P17-1130.pdf.json"
}
