{
    "abstract_sentences": {
        "1": "Current Chinese social media text summarization models are based on an encoderdecoder framework.", 
        "2": "Although its generated summaries are similar to source texts literally, they have low semantic relevance.", 
        "3": "In this work, our goal is to improve semantic relevance between source texts and summaries for Chinese social media summarization.", 
        "4": "We introduce a Semantic Relevance Based neural model to encourage high semantic similarity between texts and summaries.", 
        "5": "In our model, the source text is represented by a gated attention encoder, while the summary representation is produced by a decoder.", 
        "6": "Besides, the similarity score between the representations is maximized during training.", 
        "7": "Our experiments show that the proposed model outperforms baseline systems on a social media corpus."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 635–640 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2100  1 Introduction  Text summarization is to produce a brief summary of the main ideas of the text.", 
        "2": "For long and normal documents, extractive summarization achieves satisfying performance by selecting a few sentences from source texts (Radev et al., 2004; Woodsend and Lapata, 2010; Cheng and Lapata, 2016).", 
        "3": "However, it does not apply to Chinese social media text summarization, where texts are comparatively short and often full of noise.", 
        "4": "Therefore, abstractive text summarization, which is based on encoder-decoder framework, is a better choice (Rush et al., 2015; Hu et al., 2015).", 
        "5": "For extractive summarization, the selected sentences often have high semantic relevance to the text.", 
        "6": "However, for abstractive text summarization, current models tend to produce grammatical\nand coherent summaries regardless of its semantic relevance with source texts.", 
        "7": "Figure 1 shows that the summary generated by a current model (RNN encoder-decoder) is similar to the source text literally, but it has low semantic relevance.", 
        "8": "In this work, our goal is to improve the semantic relevance between source texts and generated summaries for Chinese social media text summarization.", 
        "9": "To achieve this goal, we propose a Semantic Relevance Based neural model.", 
        "10": "In our model, a similarity evaluation component is introduced to measure the relevance of source texts and generated summaries.", 
        "11": "During training, it maximizes the similarity score to encourage high semantic relevance between source texts and sum-\n635\nmaries.", 
        "12": "The representation of source texts is produced by an encoder, while that of summaries is computed by a decoder.", 
        "13": "We introduce a gated attention encoder to better represent the source text.", 
        "14": "Besides, our decoder generates summaries and provide the summary representation.", 
        "15": "Experiments show that our proposed model has better performance than baseline systems on the social media corpus.", 
        "16": "2 Background: Chinese Abstractive Text Summarization  Current Chinese social media text summarization model is based on encoder-decoder framework.", 
        "17": "Encoder-decoder model is able to compress source texts x = {x1, x2, ..., xN} into continuous vector representation with an encoder, and then generate the summary y = {y1, y2, ..., yM} with a decoder.", 
        "18": "In the previous work (Hu et al., 2015), the encoder is a bi-directional gated recurrent neural network, which maps source texts into sentence vector {h1, h2, ..., hN}.", 
        "19": "The decoder is a unidirectional recurrent neural network, which produces the distribution of output words yt with previous hidden state st−1 and word yt−1:\np(yt|x) = softmaxf(st−1, yt−1) (1)\nwhere f is recurrent neural network output function, and s0 is the last hidden state of encoder hN .", 
        "20": "Attention mechanism is introduced to better capture context information of source texts (Bahdanau et al., 2014).", 
        "21": "Attention vector ct is represented by the weighted sum of encoder hidden states:\nct =\nN∑\ni=1\nαtihi (2)\nαti = eg(st,hi)\n∑N j=1 e g(st,hj) (3)\nwhere g(st, hi) is a relevant score between decoder hidden state st and encoder hidden state hi.", 
        "22": "When predicting an output word, the decoder takes account of attention vector, which contains the alignment information between source texts and summaries.", 
        "23": "3 Proposed Model  Our assumption is that source texts and summaries have high semantic relevance, so our proposed model encourages high similarity between\ntheir representations.", 
        "24": "Figure 2 shows our proposed model.", 
        "25": "The model consists of three components: encoder, decoder and a similarity function.", 
        "26": "The encoder compresses source texts into semantic vectors, and the decoder generates summaries and produces semantic vectors of the generated summaries.", 
        "27": "Finally, the similarity function evaluates the relevance between the sematic vectors of source texts and generated summaries.", 
        "28": "Our training objective is to maximize the similarity score so that the generated summaries have high semantic relevance with source texts.", 
        "29": "3.1 Text Representation  There are several methods to represent a text or a sentence, such as mean pooling of RNN output or reserving the last state of RNN.", 
        "30": "In our model, source text is represented by a gated attention encoder (Hahn and Keller, 2016).", 
        "31": "Every upcoming word is fed into a gated attention network, which measures its importance.", 
        "32": "The gated attention network outputs the important score with a feedforward network.", 
        "33": "At each time step, it inputs a word vector et and its previous context vector ht, then outputs the score βt.", 
        "34": "Then the word vector et is multiplied by the score βt, and fed into RNN encoder.", 
        "35": "We select the last output hN of RNN encoder as the semantic vector of the source text Vt. A natural idea to get the semantic vector of a summary is to feed it into the encoder as well.", 
        "36": "However, this method wastes much time because\nwe encode the same sentence twice.", 
        "37": "Actually, the last output sM contains information of both source text and generated summaries.", 
        "38": "We simply compute the semantic vector of the summary by subtracting hN from sM :\nVs = sM − hN (4)\nPrevious work has proved that it is effective to represent a span of words without encoding them once more (Wang and Chang, 2016).", 
        "39": "3.2 Semantic Relevance  Our goal is to compute the semantic relevance of source text and generated summary given semantic vector Vt and Vs.", 
        "40": "Here, we use cosine similarity to measure the semantic relevance, which is represented with a dot product and magnitude:\ncos(Vs, Vt) = Vs · Vt\n∥Vs∥∥Vt∥ (5)\nSource text and summary share the same language, so it is reasonable to assume that their semantic vectors are distributed in the same space.", 
        "41": "Cosine similarity is a good way to measure the distance between two vectors in the same space.", 
        "42": "3.3 Training  Given the model parameter θ and input text x, the model produces corresponding summary y and semantic vector Vs and Vt.", 
        "43": "The objective is to minimize the loss function:\nL = −p(y|x; θ) − λcos(Vs, Vt) (6)\nwhere p(y|x; θ) is the conditional probability of summaries given source texts, and is computed by the encoder-decoder model.", 
        "44": "cos(Vs, Vt) is cosine similarity of semantic vectors Vs and Vt.", 
        "45": "This term tries to maximize the semantic relevance between source input and target output.", 
        "46": "4 Experiments  In this section, we present the evaluation of our model and show its performance on a popular social media corpus.", 
        "47": "Besides, we use a case to explain the semantic relevance between generated summary and source text.", 
        "48": "4.1 Dataset  Our dataset is Large Scale Chinese Short Text Summarization Dataset (LCSTS), which is constructed by Hu et al.", 
        "49": "(2015).", 
        "50": "The dataset consists\nof more than 2.4 million text-summary pairs, constructed from a famous Chinese social media website called Sina Weibo1.", 
        "51": "It is split into three parts, with 2,400,591 pairs in PART I, 10,666 pairs in PART II and 1,106 pairs in PART III.", 
        "52": "All the textsummary pairs in PART II and PART III are manually annotated with relevant scores ranged from 1 to 5, and we only reserve pairs with scores no less than 3.", 
        "53": "Following the previous work, we use PART I as training set, PART II as development set, and PART III as test set.", 
        "54": "4.2 Experiment Setting  To alleviate the risk of word segmentation mistakes (Xu and Sun, 2016), we use Chinese character sequences as both source inputs and target outputs.", 
        "55": "We limit the model vocabulary size to 4000, which covers most of the common characters.", 
        "56": "Each character is represented by a random initialized word embedding.", 
        "57": "We tune our parameter on the development set.", 
        "58": "In our model, the embedding size is 400, the hidden state size of encoderdecoder is 500, and the size of gated attention network is 1000.", 
        "59": "We use Adam optimizer to learn the model parameters, and the batch size is set as 32.", 
        "60": "The parameter λ is 0.0001.", 
        "61": "Both the encoder and decoder are based on LSTM unit.", 
        "62": "Following the previous work (Hu et al., 2015), our evaluation metric is F-score of ROUGE: ROUGE-1, ROUGE-2 and ROUGE-L (Lin and Hovy, 2003).", 
        "63": "4.3 Baseline Systems  RNN.", 
        "64": "We denote RNN as the basic sequence-tosequence model with bi-directional GRU encoder and uni-directional GRU decoder.", 
        "65": "It is a widely used language generated framework, so it is an important baseline.", 
        "66": "RNN context.", 
        "67": "RNN context is a sequence-tosequence framework with neural attention.", 
        "68": "Attention mechanism helps capture the context information of source texts.", 
        "69": "This model is a stronger baseline system.", 
        "70": "4.4 Results and Discussions  We compare our model with above baseline systems, including RNN and RNN context.", 
        "71": "We refer to our proposed Semantic Relevance Based neural model as SRB.", 
        "72": "Besides, SRB with a gated attention encoder is denoted as +Attention.", 
        "73": "Table 1\n1weibo.sina.com\nshows the results of our models and baseline systems.", 
        "74": "We can see SRB outperforms both RNN and RNN context in the F-score of ROUGE-1, ROUGE-2 and ROUGE-L.", 
        "75": "It concludes that SRB generates more key words and phrases.", 
        "76": "With a gated attention encoder, SRB achieves a better performance with 33.3 F-score of ROUGE-1, 20.0 ROUGE-2 and 30.1 ROUGE-L.", 
        "77": "It shows that the gated attention reduces noisy and unimportant information, so that the remaining information represents a clear idea of source text.", 
        "78": "The better representation of encoder leads to a better se-\nmantic relevance evaluation by the similarity function.", 
        "79": "Therefore, SRB with gated attention encoder is able to generate summaries with high semantic relevance to source text.", 
        "80": "Figure 3 is an example to show the semantic relevance between the source text and the summary.", 
        "81": "It shows that the main idea of the source text is about the reason why Shanghai has few giant company.", 
        "82": "RNN context produces “Shanghai’s giant companies” which is literally similar to the source text, while SRB generates “Shanghai has few giant companies”, which is closer to the main idea in semantics.", 
        "83": "It concludes that SRB produces summaries with higher semantic similarity to texts.", 
        "84": "Table 2 summarizes the results of our model and state-of-the-art systems.", 
        "85": "COPYNET has the highest socres, because it incorporates copying mechanism to deals with out-of-vocabulary word problem.", 
        "86": "In this paper, we do not implement this mechanism in our model.", 
        "87": "In the future work, we will try to incorporates copying mechanism to our model to solve the out-of-vocabulary problem.", 
        "88": "5 Related Work  Abstractive text summarization has achieved successful performance thanks to the sequence-tosequence model (Sutskever et al., 2014) and attention mechanism (Bahdanau et al., 2014).", 
        "89": "Rush et al.", 
        "90": "(2015) first used an attention-based encoder to compress texts and a neural network language decoder to generate summaries.", 
        "91": "Following this work, recurrent encoder was introduced to text summarization, and gained better performance (Lopyrev, 2015; Chopra et al., 2016).", 
        "92": "Towards Chinese texts, Hu et al.", 
        "93": "(2015) built a large corpus of Chinese short text summarization.", 
        "94": "To deal with unknown word problem, Nallapati et al.", 
        "95": "(2016) proposed a generator-pointer model so that the decoder is able to generate words in source texts.", 
        "96": "Gu et al.", 
        "97": "(2016) also solved this issue by incorporating copying mechanism.", 
        "98": "Our work is also related to neural attention model.", 
        "99": "Neural attention model is first proposed by Bahdanau et al.", 
        "100": "(2014).", 
        "101": "There are many other methods to improve neural attention model (Jean et al., 2015; Luong et al., 2015) and accelerate the training process (Sun, 2016).", 
        "102": "6 Conclusion  Our work aims at improving semantic relevance of generated summaries and source texts for Chinese social media text summarization.", 
        "103": "Our model is able to transform the text and the summary into a dense vector, and encourage high similarity of their representation.", 
        "104": "Experiments show that our model outperforms baseline systems, and the generated summary has higher semantic relevance.", 
        "105": "Acknowledgements  This work was supported in part by National High Technology Research and Development Program of China (863 Program, No.", 
        "106": "2015AA015404), and National Natural Science Foundation of China (No.", 
        "107": "61673028).", 
        "108": "Xu Sun is the corresponding author of this paper."
    }, 
    "document_id": "P17-2100.pdf.json"
}
