{
    "abstract_sentences": {
        "1": "Neural machine translation (MT) models obtain state-of-the-art performance while maintaining a simple, end-to-end architecture.", 
        "2": "However, little is known about what these models learn about source and target languages during the training process.", 
        "3": "In this work, we analyze the representations learned by neural MT models at various levels of granularity and empirically evaluate the quality of the representations for learning morphology through extrinsic part-of-speech and morphological tagging tasks.", 
        "4": "We conduct a thorough investigation along several parameters: word-based vs. character-based representations, depth of the encoding layer, the identity of the target language, and encoder vs. decoder representations.", 
        "5": "Our data-driven, quantitative evaluation sheds light on important aspects in the neural MT system and its ability to capture word structure.1"
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 861–872 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1080  1 Introduction  Neural network models are quickly becoming the predominant approach to machine translation (MT).", 
        "2": "Training neural MT (NMT) models can be done in an end-to-end fashion, which is simpler and more elegant than traditional MT systems.", 
        "3": "Moreover, NMT systems have become competitive with, or better than, the previous state-of-the-art, especially since the introduction of sequence-to-sequence models and the attention mechanism (Bahdanau et al., 2014; Sutskever et al., 2014).", 
        "4": "The improved translation quality is often attributed to better handling of non-local dependencies and morphology generation (Luong\n1Our code is available at https://github.com/ boknilev/nmt-repr-analysis.", 
        "5": "and Manning, 2015; Bentivogli et al., 2016; Toral and Sánchez-Cartagena, 2017).", 
        "6": "However, little is known about what and how much these models learn about each language and its features.", 
        "7": "Recent work has started exploring the role of the NMT encoder in learning source syntax (Shi et al., 2016), but research studies are yet to answer important questions such as: (i) what do NMT models learn about word morphology?", 
        "8": "(ii) what is the effect on learning when translating into/from morphologically-rich languages?", 
        "9": "(iii) what impact do different representations (character vs. word) have on learning?", 
        "10": "and (iv) what do different modules learn about the syntactic and semantic structure of a language?", 
        "11": "Answering such questions is imperative for fully understanding the NMT architecture.", 
        "12": "In this paper, we strive towards exploring (i), (ii), and (iii) by providing quantitative, data-driven answers to the following specific questions:\n• Which parts of the NMT architecture capture word structure?", 
        "13": "• What is the division of labor between different components (e.g.", 
        "14": "different layers or encoder vs. decoder)?", 
        "15": "• How do different word representations help learn better morphology and modeling of infrequent words?", 
        "16": "• How does the target language affect the learning of word structure?", 
        "17": "To achieve this, we follow a simple but effective procedure with three steps: (i) train a neural MT system on a parallel corpus; (ii) use the trained model to extract feature representations for words in a language of interest; and (iii) train a classifier using extracted features to make predictions\n861\nfor another task.", 
        "18": "We then evaluate the quality of the trained classifier on the given task as a proxy to the quality of the extracted representations.", 
        "19": "In this way, we obtain a quantitative measure of how well the original MT system learns features that are relevant to the given task.", 
        "20": "We focus on the tasks of part-of-speech (POS) and full morphological tagging.", 
        "21": "We investigate how different neural MT systems capture POS and morphology through a series of experiments along several parameters.", 
        "22": "For instance, we contrast word-based and character-based representations, use different encoding layers, vary source and target languages, and compare extracting features from the encoder vs. the decoder.", 
        "23": "We experiment with several languages with varying degrees of morphological richness: French, German, Czech, Arabic, and Hebrew.", 
        "24": "Our analysis reveals interesting insights such as:\n• Character-based representations are much better for learning morphology, especially for low-frequency words.", 
        "25": "This improvement is correlated with better BLEU scores.", 
        "26": "On the other hand, word-based models are sufficient for learning the structure of common words.", 
        "27": "• Lower layers of the encoder are better at capturing word structure, while deeper networks improve translation quality, suggesting that higher layers focus more on word meaning.", 
        "28": "• The target language impacts the kind of information learned by the MT system.", 
        "29": "Translating into morphologically-poorer languages leads to better source-side word representations.", 
        "30": "This is partly, but not completely, correlated with BLEU scores.", 
        "31": "• The neural decoder learns very little about word structure.", 
        "32": "The attention mechanism removes much of the burden of learning word representations from the decoder.", 
        "33": "2 Methodology  Given a source sentence s = {w1, w2, ..., wN} and a target sentence t = {u1, u2, ..., uM}, we first generate a vector representation for the source sentence using an encoder (Eqn.", 
        "34": "1) and then map this vector to the target sentence using a decoder (Eqn.", 
        "35": "2) (Sutskever et al., 2014):\nENC : s = {w1, w2, ..., wN} 7!", 
        "36": "s 2 Rk (1) DEC : s 2 Rk 7!", 
        "37": "t = {u1, u2, ..., uM} (2)\nIn this work, we use long short-term memory (LSTM) (Hochreiter and Schmidhuber, 1997) encoder-decoders with attention (Bahdanau et al., 2014), which we train on parallel data.", 
        "38": "After training the NMT system, we freeze the parameters of the encoder and use ENC as a feature extractor to generate vectors representing words in the sentence.", 
        "39": "Let ENCi(s) denote the encoded representation of word wi.", 
        "40": "For example, this may be the output of the LSTM after word wi.", 
        "41": "We feed ENCi(s) to a neural classifier that is trained to predict POS or morphological tags and evaluate the quality of the representation based on our ability to train a good classifier.", 
        "42": "By comparing the performance of classifiers trained with features from different instantiations of ENC, we can evaluate what MT encoders learn about word structure.", 
        "43": "Figure 1 illustrates this process.", 
        "44": "We follow a similar procedure for analyzing representation learning in DEC.", 
        "45": "The classifier itself can be modeled in different ways.", 
        "46": "For example, it may be an LSTM over outputs of the encoder.", 
        "47": "However, as we are interested in assessing the quality of the representations learned by the MT system, we choose to model the classifier as a simple feed-forward neural network with one hidden layer and a ReLU non-linearity.", 
        "48": "Arguably, if the learned representations are good, then a non-linear classifier should be able to extract useful information from them.2 We empha-\n2We also experimented with a linear classifier and observed similar trends to the non-linear case, but overall lower results; Qian et al.", 
        "49": "(2016b) reported similar findings.", 
        "50": "size that our goal is not to beat the state-of-the-art on a given task, but rather to analyze what NMT models learn about morphology.", 
        "51": "The classifier is trained with a cross-entropy loss; more details about its architecture are given in the supplementary material (appendix A.1).", 
        "52": "3 Data  Language pairs We experiment with several language pairs, including morphologically-rich languages, that have received relatively significant attention in the MT community.", 
        "53": "These include Arabic-, German-, French-, and Czech-English pairs.", 
        "54": "To broaden our analysis and study the effect of having morphologically-rich languages on both source and target sides, we also include ArabicHebrew, two languages with rich and similar morphological systems, and Arabic-German, two languages with rich but different morphologies.", 
        "55": "MT data Our translation models are trained on the WIT3 corpus of TED talks (Cettolo et al., 2012; Cettolo, 2016) made available for IWSLT 2016.", 
        "56": "This allows for comparable and crosslinguistic analysis.", 
        "57": "Statistics about each language pair are given in Table 1 (under Pred).", 
        "58": "We use official dev and test sets for tuning and testing.", 
        "59": "Reported figures are the averages over test sets.", 
        "60": "Annotated data We use two kinds of datasets to train POS and morphological classifiers: goldstandard and predicted tags.", 
        "61": "For predicted tags, we simply used freely available taggers to annotate the MT data.", 
        "62": "For gold tags, we use goldannotated datasets.", 
        "63": "Table 1 provides statistics for datasets with gold and predicted tags; see the supplementary material (appendix A.2) for more details about taggers and gold data.", 
        "64": "We train and test our classifiers on predicted annotations, and similarly on gold annotations, when we have them.", 
        "65": "We report both results wherever available.", 
        "66": "4 Encoder Analysis  Recall that after training the NMT system we freeze its parameters and use it only to generate features for the POS/morphology classifier.", 
        "67": "Given a trained encoder ENC and a sentence s with POS/morphology annotation, we generate word features ENCi(s) for every word in the sentence.", 
        "68": "We then train a classifier that uses the features ENCi(s) to predict POS or morphological tags.", 
        "69": "4.1 Effect of word representation  In this section, we compare different word representations extracted with different encoders.", 
        "70": "Our word-based model uses a word embedding matrix which is initialized randomly and learned with other NMT parameters.", 
        "71": "For a character-based model we adopt a convolutional neural network (CNN) over character embeddings that is also learned during training (Kim et al., 2015); see appendix A.1 for specific settings.", 
        "72": "In both cases we run the encoder over these representations and use its output ENCi(s) as features for the classifier.", 
        "73": "Table 2 shows POS tagging accuracy using features from different NMT encoders.", 
        "74": "Charbased models always generate better representations for POS tagging, especially in the case of morphologically-richer languages like Arabic and Czech.", 
        "75": "We observed a similar pattern in the full morphological tagging task.", 
        "76": "For example, we obtain morphological tagging accuracy of 65.2/79.66 and 67.66/81.66 using word/charbased representations from the Arabic-Hebrew and Arabic-English encoders, respectively.3 The superior morphological power of the char-based model also manifests in better translation quality (measured by BLEU), as shown in Table 2.", 
        "77": "3The results are not far below dedicated taggers (e.g.", 
        "78": "95.1/84.1 on Arabic POS/morphology (Pasha et al., 2014)), indicating that NMT models learn quite good representations.", 
        "79": "Impact of word frequency Let us look more closely at an example case: Arabic POS and morphological tagging.", 
        "80": "Figure 3 shows the effect of using word-based vs. char-based feature representations, obtained from the encoder of the ArabicHebrew system (other language pairs exhibit similar trends).", 
        "81": "Clearly, the char-based model is superior to the word-based one.", 
        "82": "This is true for the overall accuracy (+14.3% in POS, +14.5% in morphology), but more so in OOV words (+37.6% in POS, +32.7% in morphology).", 
        "83": "Figure 2 shows that the gap between word-based and char-based representations increases as the frequency of the word in the training data decreases.", 
        "84": "In other words, the more frequent the word, the less need there is for character information.", 
        "85": "These findings make intuitive sense: the char-based model is able to learn character n-gram patterns that are important for identifying word structure, but as the word becomes more frequent the word-based model has seen enough examples to make a decision.", 
        "86": "Analyzing specific tags In Figure 5 we plot confusion matrices for POS tagging using wordbased and char-based representations (from Arabic encoders).", 
        "87": "While the char-based representations are overall better, the two models still share similar misclassified tags.", 
        "88": "Much of the confusion comes from wrongly predicting nouns (NN, NNP).", 
        "89": "In the word-based case, relatively many tags with determiner (DT+NNP, DT+NNPS, DT+NNS, DT+VBG) are wrongly predicted as non-determined nouns (NN, NNP).", 
        "90": "In the charbased case, this hardly happens.", 
        "91": "This suggests that the char-based representations are predictive of the presence of a determiner, which in Arabic is expressed as the prefix “Al-” (the definite article), a pattern easily captured by a char-based model.", 
        "92": "In Figure 4 we plot the difference in POS accuracy when moving from word-based to char-based representations, per POS tag frequency in the training data.", 
        "93": "Tags closer to the upper-right corner occur more frequently in the training set and are\nbetter predicted by char-based compared to wordbased representations.", 
        "94": "There are a few fairly frequent tags (in the middle-bottom part of the figure) whose accuracy does not improve much when moving from word- to char-based representations: mostly conjunctions, determiners, and certain particles (CC, DT, WP).", 
        "95": "But there are several very frequent tags (NN, DT+NN, DT+JJ, VBP, and even PUNC) whose accuracy improves quite a lot.", 
        "96": "Then there are plural nouns (NNS, DT+NNS) where the char-based model really shines, which makes sense linguistically as plurality in Arabic is usually expressed by certain suffixes (“-wn/yn” for masc.", 
        "97": "plural, “-At” for fem.", 
        "98": "plural).", 
        "99": "The charbased model is thus especially good with frequent tags and infrequent words, which is understandable given that infrequent words typically belong to frequent open categories like nouns and verbs.", 
        "100": "4.2 Effect of encoder depth  Modern NMT systems use very deep architectures with up to 8 or 16 layers (Wu et al., 2016; Zhou et al., 2016).", 
        "101": "We would like to understand what kind of information different layers capture.", 
        "102": "Given a trained NMT model with multiple layers, we extract feature representations from the different layers in the encoder.", 
        "103": "Let ENCli(s) denote the encoded representation of word wi after the l-th layer.", 
        "104": "We can vary l and train different classifiers to predict POS or morphological tags.", 
        "105": "Here we focus on the case of a 2-layer encoder-decoder model for simplicity (l 2 {1, 2}).", 
        "106": "Figure 6 shows POS tagging results using representations from different encoding layers across five language pairs.", 
        "107": "The general trend is that passing word vectors through the NMT encoder improves POS tagging, which can be explained by the contextual information contained in the representations after one layer.", 
        "108": "However, it turns out that representations from the 1st layer are better than those from the 2nd layer, at least for the purpose of capturing word structure.", 
        "109": "Figure 7 demonstrates that the same pattern holds for both word-based and char-based representations, on Arabic POS and morphological tagging.", 
        "110": "In all cases, layer 1 representations are better than layer 2 representations.4 In contrast, BLEU scores ac-\n4We found this result to be also true in French, German, and Czech experiments; see appendix A.3.", 
        "111": "tually increase when training 2-layer vs. 1-layer models (+1.11/+0.56 BLEU for Arabic-Hebrew word/char-based models).", 
        "112": "Thus translation quality improves when adding layers but morphology quality degrades.", 
        "113": "Intuitively, it seems that lower layers of the network learn to represent word structure while higher layers are more focused on word meaning.", 
        "114": "A similar pattern was recently observed in a joint language-vision deep recurrent network (Gelderloos and Chrupała, 2016).", 
        "115": "4.3 Effect of target language  While translating from morphologically-rich languages is challenging, translating into such languages is even harder.", 
        "116": "For instance, our basic system obtains BLEU scores of 24.69/23.2 on Arabic/Czech to English, but only 13.37/13.9 on English to Arabic/Czech.", 
        "117": "How does the target language affect the learned source language representations?", 
        "118": "Does translating into a morphologically-rich language require more knowledge about source language morphology?", 
        "119": "In order to investigate these questions, we fix the source language and train NMT models using different target languages.", 
        "120": "For example, given an Arabic source side, we train Arabic-toEnglish/Hebrew/German systems.", 
        "121": "These target languages represent a morphologically-poor language (English), a morphologically-rich language with similar morphology to the source language (Hebrew), and a morphologically-rich language with different morphology (German).", 
        "122": "To make a fair comparison, we train the models on the intersection of the training data based on the source language.", 
        "123": "In this way the experimental setup is\ncompletely identical: the models are trained on the same Arabic sentences with different translations.", 
        "124": "Figure 8 shows POS and morphological tagging accuracy of word-based representations from the NMT encoders, as well as corresponding BLEU scores.", 
        "125": "As expected, translating into English is easier than translating into the morphologicallyricher Hebrew and German, resulting in higher BLEU scores.", 
        "126": "Despite their similar morphological systems, translating Arabic to Hebrew is worse than Arabic to German, which can be attributed to the richer Hebrew morphology compared to German.", 
        "127": "POS and morphology accuracies share an intriguing pattern: the representations that are learned when translating into English are better for predicting POS or morphology than those learned when translating into German, which are in turn better than those learned when translating into Hebrew.", 
        "128": "This is remarkable given that English is a morphologically-poor language that does not display many of the morphological properties that are found in the Arabic source.", 
        "129": "In contrast, German and Hebrew have richer morphologies, so one could expect that translating into them would make the model learn more about morphology.", 
        "130": "A possible explanation for this phenomenon is that the Arabic-English model is simply better than the Arabic-Hebrew and Arabic-German models, as hinted by the BLEU scores in Table 2.", 
        "131": "The inherent difficulty in translating Arabic to Hebrew/German may affect the ability to learn good representations of word structure.", 
        "132": "To probe this more, we trained an Arabic-Arabic autoencoder on the same training data.", 
        "133": "We found that it learns to recreate the test sentences extremely well, with very high BLEU scores (Figure 8).", 
        "134": "However, its\nword representations are actually inferior for the purpose of POS/morphological tagging.", 
        "135": "This implies that higher BLEU does not necessarily entail better morphological representations.", 
        "136": "In other words, a better translation model learns more informative representations, but only when it is actually learning to translate rather than merely memorizing the data as in the autoencoder case.", 
        "137": "We found this to be consistently true also for charbased experiments, and in other language pairs.", 
        "138": "5 Decoder Analysis  So far we only looked at the encoder.", 
        "139": "However, the decoder DEC is a crucial part in an MT system with access to both source and target sentences.", 
        "140": "In order to examine what the decoder learns about morphology, we first train an NMT system on the parallel corpus.", 
        "141": "Then, we use the trained model to encode a source sentence and extract features for words in the target sentence.", 
        "142": "These features are used to train a classifier on POS or morphological tagging on the target side.5 Note that in this case the decoder is given the correct target words oneby-one, similar to the usual NMT training regime.", 
        "143": "Table 3 (1st row) shows the results of using representations extracted with ENC and DEC from the Arabic-English and English-Arabic models, respectively.", 
        "144": "There is clearly a huge drop in representation quality with the decoder.6 At first, this drop seems correlated with lower BLEU scores in English to Arabic vs. Arabic to English.", 
        "145": "However, we observed similar low POS tagging accuracy using decoder representations from high-quality NMT models.", 
        "146": "For instance, the French-to-English system obtains 37.8 BLEU, but its decoder representations give a mere 54.26% accuracy on English POS tagging.", 
        "147": "As an alternative explanation for the poor quality of the decoder representations, consider the fundamental tasks of the two NMT modules: encoder and decoder.", 
        "148": "The encoder’s task is to create a generic, close to language-independent representation of the source sentence, as shown by recent evidence from multilingual NMT (Johnson et al., 2016).", 
        "149": "The decoder’s task is to use this representation to generate the target sentence in a specific\n5In this section we only experiment with predicted tags as there are no parallel data with gold POS/morphological tags that we are aware of.", 
        "150": "6Note that the decoder results are above a majority baseline of 20%, so the decoder is still learning something about the target language.", 
        "151": "language.", 
        "152": "Presumably, it is sufficient for the decoder to learn a strong language model in order to produce morphologically-correct output, without learning much about morphology, while the encoder needs to learn quite a lot about source language morphology in order to create a good generic representation.", 
        "153": "In the following section we show that the attention mechanism also plays an important role in the division of labor between encoder and decoder.", 
        "154": "5.1 Effect of attention  Consider the role of the attention mechanism in learning useful representations: during decoding, the attention weights are combined with the decoder’s hidden states to generate the current translation.", 
        "155": "These two sources of information need to jointly point to the most relevant source word(s) and predict the next most likely word.", 
        "156": "Thus, the decoder puts significant emphasis on mapping back to the source sentence, which may come at the expense of obtaining a meaningful representation of the current word.", 
        "157": "We hypothesize that the attention mechanism hurts the quality of the target word representations learned by the decoder.", 
        "158": "To test this hypothesis, we train NMT models with and without attention and compare the quality of their learned representations.", 
        "159": "As Table 3 shows (compare 1st and 2nd rows), removing the attention mechanism decreases the quality of the encoder representations, but improves the quality of the decoder representations.", 
        "160": "Without the attention mechanism, the decoder is forced to learn more informative representations of the target language.", 
        "161": "5.2 Effect of word representation  We also conducted experiments to verify our findings regarding word-based versus character-based representations on the decoder side.", 
        "162": "By character representation we mean a character CNN on the input words.", 
        "163": "The decoder predictions are still done at the word-level, which enables us to use its hidden states as word representations.", 
        "164": "Table 4 shows POS accuracy of word-based vs. char-based representations in the encoder and decoder.", 
        "165": "While char-based representations improve the encoder, they do not help the decoder.", 
        "166": "BLEU scores behave similarly: the char-based model leads to better translations in Arabic-to-English, but not in English-to-Arabic.", 
        "167": "A possible explanation for this phenomenon is that the decoder’s predictions are still done at word level even with the char-based model (which encodes the target input but not the output).", 
        "168": "In practice, this can lead to generating unknown words.", 
        "169": "Indeed, in Arabicto-English the char-based model reduces the number of generated unknown words in the MT test set by 25%, while in English-to-Arabic the number of unknown words remains roughly the same between word-based and char-based models.", 
        "170": "6 Related Work  Analysis of neural models The opacity of neural networks has motivated researchers to analyze such models in different ways.", 
        "171": "One line of work visualizes hidden unit activations in recurrent neural networks that are trained for a given task (Elman, 1991; Karpathy et al., 2015; Kádár et al., 2016; Qian et al., 2016a).", 
        "172": "While such visualizations illuminate the inner workings of the network, they are often qualitative in nature and somewhat anecdotal.", 
        "173": "A different approach tries to provide a quantitative analysis by correlating parts of the neural network with linguistic properties, for example by training a classifier to predict features of interest.", 
        "174": "Different units have been used, from word embeddings (Köhn, 2015; Qian et al., 2016b), through LSTM gates or states (Qian et al., 2016a), to sentence embeddings (Adi et al., 2016).", 
        "175": "Our work is most similar to Shi et al.", 
        "176": "(2016), who use hidden vectors from a neural MT encoder to predict syntactic properties on the English source side.", 
        "177": "In contrast, we focus on representations in morphologically-rich languages and evaluate both source and target sides across several criteria.", 
        "178": "Vylomova et al.", 
        "179": "(2016) also analyze different representations for morphologically-rich languages in MT, but do not directly measure the quality of the learned representations.", 
        "180": "Word representations in MT Machine translation systems that deal with morphologically-rich languages resort to various techniques for representing morphological knowledge, such as word segmentation (Nieflen and Ney, 2000; Koehn and\nKnight, 2003; Badr et al., 2008) and factored translation and reordering models (Koehn and Hoang, 2007; Durrani et al., 2014).", 
        "181": "Characters and other sub-word units have become increasingly popular in neural MT, although they had also been used in phrase-based MT for handling morphologically-rich (Luong et al., 2010) or closely related language pairs (Durrani et al., 2010; Nakov and Tiedemann, 2012).", 
        "182": "In neural MT, such units are obtained in a pre-processing step—e.g.", 
        "183": "by byte-pair encoding (Sennrich et al., 2016) or the word-piece model (Wu et al., 2016)— or learned during training using a character-based convolutional/recurrent sub-network (Costa-jussà and Fonollosa, 2016; Luong and Manning, 2016; Vylomova et al., 2016).", 
        "184": "The latter approach has the advantage of keeping the original word boundaries without requiring pre- and post-processing.", 
        "185": "Here we focus on a character CNN which has been used in language modeling and machine translation (Kim et al., 2015; Belinkov and Glass, 2016; Costa-jussà and Fonollosa, 2016; Jozefowicz et al., 2016; Sajjad et al., 2017).", 
        "186": "We evaluate the quality of different representations learned by an MT system augmented with a character CNN in terms of POS and morphological tagging, and contrast them with a purely word-based system.", 
        "187": "7 Conclusion  Neural networks have become ubiquitous in machine translation due to their elegant architecture and good performance.", 
        "188": "The representations they use for linguistic units are crucial for obtaining high-quality translation.", 
        "189": "In this work, we investigated how neural MT models learn word structure.", 
        "190": "We evaluated their representation quality on POS and morphological tagging in a number of languages.", 
        "191": "Our results lead to the following conclusions:\n• Character-based representations are better than word-based ones for learning morphology, especially in rare and unseen words.", 
        "192": "• Lower layers of the neural network are better at capturing morphology, while deeper networks improve translation performance.", 
        "193": "We hypothesize that lower layers are more focused on word structure, while higher ones are focused on word meaning.", 
        "194": "• Translating into morphologically-poorer languages leads to better source-side representations.", 
        "195": "This is partly, but not completely, correlated with BLEU scores.", 
        "196": "• The attentional decoder learns impoverished representations that do not carry much information about morphology.", 
        "197": "These insights can guide further development of neural MT systems.", 
        "198": "For instance, jointly learning translation and morphology can possibly lead to better representations and improved translation.", 
        "199": "Our analysis indicates that this kind of approach should take into account factors such as the encoding layer and the type of word representation.", 
        "200": "Another area for future work is to extend the analysis to other word representations (e.g.", 
        "201": "byte-pair encoding), deeper networks, and more semantically-oriented tasks such as semantic rolelabeling or semantic parsing.", 
        "202": "Acknowledgments  We would like to thank Helmut Schmid for providing the Tiger corpus, members of the MIT Spoken Language Systems group for helpful comments, and the three anonymous reviewers for their useful suggestions.", 
        "203": "This research was carried out in collaboration between the HBKU Qatar Computing Research Institute (QCRI) and the MIT Computer Science and Artificial Intelligence Laboratory (CSAIL).", 
        "204": "A Supplementary Material  A.1 Training Details POS/Morphological classifier The classifier used for all prediction tasks is a feed-forward network with one hidden layer, dropout (⇢ = 0.5), a ReLU non-linearity, and an output layer mapping to the tag set (followed by a Softmax).", 
        "205": "The size of the hidden layer is set to be identical to the size of the encoder’s hidden state (typically 500 dimensions).", 
        "206": "We use Adam (Kingma and Ba, 2014) with default parameters to minimize the cross-entropy objective.", 
        "207": "Training is run with mini-batches of size 16 and stopped once the loss on the dev set stops improving; we allow a patience of 5 epochs.", 
        "208": "Neural MT system We train a 2-layer LSTM encoder-decoder with attention.", 
        "209": "We use the seq2seq-attn implementation (Kim, 2016) with the following default settings: word vectors and LSTM states have 500 dimensions, SGD with initial learning rate of 1.0 and rate decay of 0.5, and dropout rate of 0.3.", 
        "210": "The characterbased model is a CNN with a highway network over characters (Kim et al., 2015) with 1000 feature maps and a kernel width of 6 characters.", 
        "211": "This model was found to be useful for translating morphologically-rich languages (Costa-jussà and Fonollosa, 2016).", 
        "212": "The MT system is trained for 20 epochs, and the model with the best dev loss is used for extracting features for the classifier.", 
        "213": "A.2 Data and Taggers Datasets All of the translation models are trained on the Ted talks corpus included in WIT3 (Cettolo et al., 2012; Cettolo, 2016).", 
        "214": "Statistics about each language pair are available on the WIT3 website: https://wit3.fbk.eu.", 
        "215": "For experiments using gold tags, we used the Arabic Treebank for Arabic (with the versions and splits described in the MADAMIRA manual (Pasha et al., 2014)) and the Tiger corpus for German.7\nPOS and morphological taggers We used the following tools to annotate the MT corpora: MADAMIRA (Pasha et al., 2014) for Arabic POS and morphological tags, Tree-Tagger (Schmid, 1994) for Czech and French POS tags, LoPar (Schmid, 2000) for German POS and morphological tags, and MXPOST (Ratnaparkhi, 1998) for English POS tags.", 
        "216": "These tools are recommended\n7http://www.ims.uni-stuttgart.de/ forschung/ressourcen/korpora/tiger.html\non the Moses website.8 As mentioned before, our goal is not to achieve state-of-the-art results, but rather to study what different components of the NMT architecture learn about word morphology.", 
        "217": "Please refer to Mueller et al.", 
        "218": "(2013) for representative POS and morphological tagging accuracies.", 
        "219": "A.3 Supplementary Results We report here results that were omitted from the paper due to the space limit.", 
        "220": "Table 5 shows encoder results using different layers, languages, and representations (word/char-based).", 
        "221": "As noted in the paper, all the results consistently show that i) layer 1 performs better than layers 0 and 2; and ii) charbased representations are better than word-based for learning morphology.", 
        "222": "Table 6 shows that translating into a morphologically-poor language (English) leads to better source representations, and Table 7 provides additional decoder results.", 
        "223": "8http://www.statmt.org/moses/?n=Moses.", 
        "224": "ExternalTools"
    }, 
    "document_id": "P17-1080.pdf.json"
}
