{
    "abstract_sentences": {
        "1": "We present a joint modeling approach to identify salient discussion points in spoken meetings as well as to label the discourse relations between speaker turns.", 
        "2": "A variation of our model is also discussed when discourse relations are treated as latent variables.", 
        "3": "Experimental results on two popular meeting corpora show that our joint model can outperform state-of-the-art approaches for both phrasebased content selection and discourse relation prediction tasks.", 
        "4": "We also evaluate our model on predicting the consistency among team members’ understanding of their group decisions.", 
        "5": "Classifiers trained with features constructed from our model achieve significant better predictive performance than the state-of-the-art."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 974–984 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1090  1 Introduction  Goal-oriented dialogues, such as meetings, negotiations, or customer service transcripts, play an important role in our daily life.", 
        "2": "Automatically extracting the critical points and important outcomes from dialogues would facilitate generating summaries for complicated conversations, understanding the decision-making process of meetings, or analyzing the effectiveness of collaborations.", 
        "3": "We are interested in a specific type of dialogues — spoken meetings, which is a common way for collaboration and idea sharing.", 
        "4": "Previous work (Kirschner et al., 2012) has shown that discourse structure can be used to capture the main discussion points and arguments put forward during problem-solving and decision-making processes in meetings.", 
        "5": "Indeed, content of different speaker turns do not occur in isolation, and should be interpreted within the context of discourse.", 
        "6": "Meanwhile, content can also reflect the purpose of speaker turns, thus facilitate with discourse relation understanding.", 
        "7": "Take the meeting snippet from\nAMI corpus (Carletta et al., 2006) in Figure 1 as an example.", 
        "8": "This discussion is annotated with discourse structure based on the Twente Argumentation Schema (TAS) by Rienks et al.", 
        "9": "(2005), which focuses on argumentative discourse information.", 
        "10": "As can be seen, meeting participants evaluate different options by showing doubt (UNCERTAIN), bringing up alternative solution (OPTION), or giving feedback.", 
        "11": "The discourse information helps with the identification of the key discussion point, i.e., “which type of battery to use”, by revealing the discussion flow.", 
        "12": "To date, most efforts to leverage discourse information to detect salient content from dialogues have focused on encoding gold-standard discourse relations as features for use in classifier training (Murray et al., 2006; Galley, 2006; McKeown et al., 2007; Bui et al., 2009).", 
        "13": "However, automatic discourse parsing in dialogues is still a challenging problem (Perret et al., 2016).", 
        "14": "Moreover, acquiring human annotation on discourse relations is a timeconsuming and expensive process, and does not\n974\nscale for large datasets.", 
        "15": "In this paper, we propose a joint modeling approach to select salient phrases reflecting key discussion points as well as label the discourse relations between speaker turns in spoken meetings.", 
        "16": "We hypothesize that leveraging the interaction between content and discourse has the potential to yield better prediction performance on both phrase-based content selection and discourse relation prediction.", 
        "17": "Specifically, we utilize argumentative discourse relations as defined in Twente Argument Schema (TAS) (Rienks et al., 2005), where discussions are organized into tree structures with discourse relations labeled between nodes (as shown in Figure 1).", 
        "18": "Algorithms for joint learning and joint inference are proposed for our model.", 
        "19": "We also present a variation of our model to treat discourse relations as latent variables when true labels are not available for learning.", 
        "20": "We envision that the extracted salient phrases by our model can be used as input to abstractive meeting summarization systems (Wang and Cardie, 2013; Mehdad et al., 2014).", 
        "21": "Combined with the predicted discourse structure, a visualization tool can be exploited to display conversation flow to support intelligent meeting assistant systems.", 
        "22": "To the best of our knowledge, our work is the first to jointly model content and discourse relations in meetings.", 
        "23": "We test our model with two meeting corpora — the AMI corpus (Carletta et al., 2006) and the ICSI corpus (Janin et al., 2003).", 
        "24": "Experimental results show that our model yields an accuracy of 63.2 on phrase selection, which is significantly better than a classifier based on Support Vector Machines (SVM).", 
        "25": "Our discourse prediction component also obtains better accuracy than a state-of-the-art neural networkbased approach (59.2 vs. 54.2).", 
        "26": "Moreover, our model trained with latent discourse outperforms SVMs on both AMI and ICSI corpora for phrase selection.", 
        "27": "We further evaluate the usage of selected phrases as extractive meeting summaries.", 
        "28": "Results evaluated by ROUGE (Lin and Hovy, 2003) demonstrate that our system summaries obtain a ROUGE-SU4 F1 score of 21.3 on AMI corpus, which outperforms non-trivial extractive summarization baselines and a keyword selection algorithm proposed in Liu et al.", 
        "29": "(2009).", 
        "30": "Moreover, since both content and discourse structure are critical for building shared understanding among participants (Mulder et al., 2002;\nMercer, 2004), we further investigate whether our learned model can be utilized to predict the consistency among team members’ understanding of their group decisions.", 
        "31": "This task is first defined as consistency of understanding (COU) prediction by Kim and Shah (2016), who have labeled a portion of AMI discussions with consistency or inconsistency labels.", 
        "32": "We construct features from our model predictions to capture different discourse patterns and word entrainment scores for discussion with different COU level.", 
        "33": "Results on AMI discussions show that SVM classifiers trained with our features significantly outperform the state-ofthe-art results (Kim and Shah, 2016) (F1: 63.1 vs. 50.5) and non-trivial baselines.", 
        "34": "The rest of the paper is structured as follows: we first summarize related work in Section 2.", 
        "35": "The joint model is presented in Section 3.", 
        "36": "Datasets and experimental setup are described in Section 4, which is followed by experimental results (Section 5).", 
        "37": "We then study the usage of our model for predicting consistency of understanding in groups in Section 6.", 
        "38": "We finally conclude in Section 7.", 
        "39": "2 Related Work  Our model is inspired by research work that leverages discourse structure for identifying salient content in conversations, which is still largely reliant on features derived from gold-standard discourse labels (McKeown et al., 2007; Murray et al., 2010; Bokaei et al., 2016).", 
        "40": "For instance, adjacency pairs, which are paired utterances with question-answer or offer-accept relations, are found to frequently appear in meeting summaries together and thus are utilized to extract summary-worthy utterances by Galley (2006).", 
        "41": "There is much less work that jointly predicts the importance of content along with the discourse structure in dialogus.", 
        "42": "Oya and Carenini (2014) employs Dynamic Conditional Random Field to recognize sentences in email threads for use in summary as well as their dialogue acts.", 
        "43": "Only local discourse structures from adjacent utterances are considered.", 
        "44": "Our model is built on tree structures, which captures more global information.", 
        "45": "Our work is also in line with keyphrase identification or phrase-based summarization for conversations.", 
        "46": "Due to the noisy nature of dialogues, recent work focuses on identifying summary-worthy phrases from meetings (Fernández et al., 2008; Riedhammer et al., 2010) or email threads (Loza\net al., 2014).", 
        "47": "For instance, Wang and Cardie (2012) treat the problem as an information extraction task, where summary-worthy content represented as indicator and argument pairs is identified by an unsupervised latent variable model.", 
        "48": "Our work also targets at detecting salient phrases from meetings, but focuses on the joint modeling of critical discussion points and discourse relations held between them.", 
        "49": "For the area of discourse analysis in dialogues, a significant amount of work has been done in predicting local discourse structures, such as recognizing dialogue acts or social acts of adjacent utterances from phone conversations (Stolcke et al., 2000; Kalchbrenner and Blunsom, 2013; Ji et al., 2016), spoken meetings (Dielmann and Renals, 2008), or emails (Cohen et al., 2004).", 
        "50": "Although discourse information from non-adjacent turns has been studied in the context of online discussion forums (Ghosh et al., 2014) and meetings (HakkaniTur, 2009), none of them models the effect of discourse structure on content selection, which is a gap that this work fills in.", 
        "51": "3 The Joint Model of Content and Discourse Relations  In this section, we first present our joint model in Section 3.1.", 
        "52": "The algorithms for learning and inference are described in Sections 3.2 and 3.3, followed by feature description (Section 3.4).", 
        "53": "3.1 Model Description  Our proposed model learns to jointly perform phrase-based content selection and discourse relation prediction by making use of the interaction between the two sources of information.", 
        "54": "Assume that a meeting discussion is denoted as x, where x consists of a sequence of discourse units x = {x1, x2, · · · , xn}.", 
        "55": "Each discourse unit can be a complete speaker turn or a part of it.", 
        "56": "As demonstrated in Figure 1, a tree-structured discourse diagram is constructed for each discussion with each discourse unit xi as a node of the tree.", 
        "57": "In this work, we consider the argumentative discourse structure by Twente Argument Schema (TAS) (Rienks et al., 2005).", 
        "58": "For each node xi, it is attached to another node xi′ (i′ < i) in the discussion, and a discourse relation di is hold on the link 〈xi, xi′〉 (di is empty if xi is the root).", 
        "59": "Let t denote the set of links 〈xi, xi′〉 in x.", 
        "60": "Following previous work on discourse analysis in meetings (Rienks et al., 2005;\nHakkani-Tur, 2009), we assume that the attachment structure between discourse units are given during both training and testing.", 
        "61": "A set of candidate phrases are extracted from each discourse unit xi, from which salient phrases that contain gist information will be identified.", 
        "62": "We obtain constituent and dependency parses for utterances using Stanford parser (Klein and Manning, 2003).", 
        "63": "We restrict eligible candidate to be a noun phrase (NP), verb phrase (VP), prepositional phrase (PP), or adjective phrase (ADJP) with at most 5 words, and its head word cannot be a stop word.1 If a candidate is a parent of another candidate in the constituent parse tree, we will only keep the parent.", 
        "64": "We further merge a verb and a candidate noun phrase into one candidate if the later is the direct object or subject of the verb.", 
        "65": "For example, from utterance “let’s use a rubber case as well as rubber buttons”, we can identify candidates “use a rubber case” and “rubber buttons”.", 
        "66": "For xi, the set of candidate phrases are denoted as ci = {ci,1, ci,2, · · · , ci,mi}, where mi is the number of candidates.", 
        "67": "ci,j takes a value of 1 if the corresponding candidate is selected as salient phrase; otherwise, ci,j is equal to 0.", 
        "68": "All candidate phrases in discussion x are represented as c.\nWe then define a log-linear model with feature parameters w for the candidate phrases c and discourse relations d in x as:\np(c,d|x,w) ∝ exp[w · Φ(c,d,x)]\n∝ exp[w · n∑\ni=1,<xi,xi′>∈t φ(ci, di, di′ ,x)]\n∝ exp[ n∑\ni=1,<xi,xi′>∈t (wc ·\nmi∑\nj=1\nφc(ci,j ,x)\n+ wd · φd(di, di′ ,x) + wcd · mi∑\nj=1\nφcd(ci,j , di,x))]\n(1)\nHere Φ(·) and φ(·) denote feature vectors.", 
        "69": "We utilize three types of feature functions: (1) content-only features φc(·), which capture the importance of phrases, (2) discourse-only features φd(·), which characterize the (potentially higherorder) discourse relations, and (3) joint features of content and discourse φcd(·), which model the interaction between the two.", 
        "70": "wc, wd, and wcd are\n1Other methods for mining candidate phrases, such as frequency-based method (Liu et al., 2015), will be studied for future work.", 
        "71": "corresponding feature parameters.", 
        "72": "Detailed feature descriptions can be found in Section 3.4.", 
        "73": "Discourse Relations as Latent Variables.", 
        "74": "As we mentioned in the introduction, acquiring labeled training data for discourse relations is a timeconsuming process since it would require human annotators to inspect the full discussions.", 
        "75": "Therefore, we further propose a variation of our model where it treats the discourse relations as latent variables, so that p(c|x,w) = ∑d p(c,d|x,w).", 
        "76": "Its learning algorithm is slightly different as described in the next section.", 
        "77": "3.2 Joint Learning for Parameter Estimation  For learning the model parameters w, we employ an algorithm based on SampleRank (Rohanimanesh et al., 2011), which is a stochastic structure learning method.", 
        "78": "In general, the learning algorithm constructs a sequence of configurations for sample labels as a Markov chain Monte Carlo (MCMC) chain based on a task-specific loss function, where stochastic gradients are distributed across the chain.", 
        "79": "The full learning procedure is described in Algorithm 1.", 
        "80": "To start with, the feature weights w is initialized with each value randomly drawn from [−1, 1].", 
        "81": "Multiple epochs are run through all samples.", 
        "82": "For each sample, we randomly initialize the assignment of candidate phrases labels c and discourse relations d. Then an MCMC chain is constructed with a series of configurations σ = (c, d): at each step, it first samples a discourse structure d based on the proposal distribution q(d′|d,x), and then samples phrase labels conditional on the new discourse relations and previous phrase labels based on q(c′|c,d′,x).", 
        "83": "Local search is used for both proposal distributions.2 The new configuration is accepted if it improves on the score by ω(σ′).", 
        "84": "The parameters w are updated accordingly.", 
        "85": "For the scorer ω, we use a weighted combination of F1 scores of phrase selection (F1c) and discourse relation prediction (F1d): ω(σ) = α · F1c + (1− α) · F1d.", 
        "86": "We fix α to 0.1.", 
        "87": "When discourse relations are treated as latent, we initialize discourse relations for each sample with a label in {1, 2, .", 
        "88": ".", 
        "89": ".", 
        "90": ",K} if there are K relations indicated, and we only use F1c as the scorer.", 
        "91": "2For future work, we can explore other proposal distributions that utilize the conditional distribution of salient phrases given sampled discourse relations.", 
        "92": "Input : X = {x}: discussions in the training set, η: learning rate, : number of epochs, δ: number of sampling rounds, ω(·): scoring function, Φ(·): feature functions Output: feature weights 1|W| ∑ w∈W w Initialize w; W ← {w}; for e = 1 to do\nfor x in X do // Initialize configuration for\nx Initialize c and d; σ = (c,d); for s = 1 to δ do\n// New configuration via local search d′ ∼ qd(·|x,d); c′ ∼ qd(·|x, c,d′); σ′ = (c′,d′); σ+ = arg maxσ̃∈{σ,σ′} ω(σ̃); σ− = arg minσ̃∈{σ,σ′} ω(σ̃); ∇̂ = Φ(σ+)− Φ(σ−); ∆ω = ω(σ+)− ω(σ−); // Update parameters if w · ∇̂ < ∆ω & ∆ω 6= 0 then\nw← w + η · ∇̂; Add w inW;\nend // Accept or reject new\nconfiguration if σ+ == σ′ then\nσ = σ′ end\nend end\nend Algorithm 1: SampleRank-based joint learning.", 
        "93": "3.3 Joint Inference for Prediction  Given a new sample x and learned parameters w, we predict phrase labels and discourse relations as arg maxc,d p(c,d|x,w).", 
        "94": "Dynamic programming can be employed to carry out joint inference, however, it would be time-consuming since our objective function has a large search space for both content and discourse labels.", 
        "95": "Hence we propose an alternating optimizing algorithm to search for c and d iteratively.", 
        "96": "Concretely, for each iteration, we first optimize on d by maximizing\n∑n i=1,<xi,x′i>∈t(wd · φd(di, di′ ,x) + wcd ·∑mi\nj=1 φcd(ci,j , di,x)).", 
        "97": "Message-passing (Smith and Eisner, 2008) is used to find the best d.\nIn the second step, we search for c that maximizes ∑n i=1,<xi,x′i>∈t(wc · ∑mi j=1 φc(ci,j ,x) +\nwcd · ∑mi\nj=1 φcd(ci,j , di,x)).", 
        "98": "We believe that candidate phrases based on the same concepts should have the same predicted label.", 
        "99": "Therefore, candidates of the same phrase type and sharing the same head word are grouped into one cluster.", 
        "100": "We then cast our task as an integer linear programming\nproblem.3 We optimize our objective function under constraints: (1) ci,j = ci′,j′ if ci,j and ci′,j′ are in the same cluster, and (2) ci,j ∈ {0, 1}, ∀i, j.", 
        "101": "The inference process is the same for models trained with latent discourse relations.", 
        "102": "3.4 Features  We use features that characterize content, discourse relations, and the combination of both.", 
        "103": "Content Features.", 
        "104": "For modeling the salience of content, we calculate the minimum, maximum, and average of TF-IDF scores of words and number of content words in each phrase based on the intuition that important phrases tend to have more content words with high TF-IDF scores (Fernández et al., 2008).", 
        "105": "We also consider whether the head word of the phrase has been mentioned in preceding turn, which implies the focus of a discussion.", 
        "106": "The size of the cluster each phrase belongs to is also included.", 
        "107": "Number of POS tags and phrase types are counted to characterize the syntactic structure.", 
        "108": "Previous work (Wang and Cardie, 2012) has found that a discussion usually ends with decision-relevant information.", 
        "109": "We thus identify the absolute and relative positions of the turn containing the candidate phrase in the discussion.", 
        "110": "Finally, we record whether the candidate phrase is uttered by the main speaker, who speakers the most words in the discussion.", 
        "111": "Discourse Features.", 
        "112": "For each discourse unit, we collect the dialogue act types of the current unit and its parent node in discourse tree, whether there is any adjacency pair held between the two nodes (Hakkani-Tur, 2009), and the Jaccard similarity between them.", 
        "113": "We record whether two turns are uttered by the same speaker, for example, ELABORATION is commonly observed between the turns from the same participant.", 
        "114": "We also calculate the number of candidate phrases based on the observation that OPTION and SPECIALIZATION tend to contain more informative words than POSITIVE feedback.", 
        "115": "Length of the discourse unit is also relevant.", 
        "116": "Therefore, we compute the time span and number of words.", 
        "117": "To incorporate global structure features, we encode the depth of the node in the discourse tree and the\n3We use lpsolve: http://lpsolve.", 
        "118": "sourceforge.net/5.5/.", 
        "119": "number of its siblings.", 
        "120": "Finally, we include an order-2 discourse relation feature that encodes the relation between current discourse unit and its parent, and the relation between the parent and its grandparent if it exists.", 
        "121": "Joint Features.", 
        "122": "For modeling the interaction between content and discourse, the discourse relation is added to each content feature to compose a joint feature.", 
        "123": "For example, if candidate c in discussion x has a content feature φ[avg−TFIDF ](c,x) with a value of 0.5, and its discourse relation d is POSITIVE, then the joint feature takes the form of φ[avg−TFIDF,Positive](c, d,x) = 0.5.", 
        "124": "4 Datasets and Experimental Setup  Meeting Corpora.", 
        "125": "We evaluate our joint model on two meeting corpora with rich annotations: the AMI meeting corpus (Carletta et al., 2006) and the ICSI meeting corpus (Janin et al., 2003).", 
        "126": "AMI corpus consists of 139 scenario-driven meetings, and ICSI corpus contains 75 naturally occurring meetings.", 
        "127": "Both of the corpora are annotated with dialogue acts, adjacency pairs, and topic segmentation.", 
        "128": "We treat each topic segment as one discussion, and remove discussions with less than 10 turns or labeled as “opening” and “chitchat”.", 
        "129": "694 discussions from AMI and 1139 discussions from ICSI are extracted, and these two datasets are henceforth referred as AMI-FULL and ICSIFULL.", 
        "130": "Acquiring Gold-Standard Labels.", 
        "131": "Both corpora contain human constructed abstractive summaries and extractive summaries on meeting level.", 
        "132": "Short abstracts, usually in one sentence, are constructed by meeting participants — participant summaries, and external annotators — abstractive summaries.", 
        "133": "Dialogue acts that contribute to important output of the meeting, e.g.", 
        "134": "decisions, are identified and used as extractive summaries, and some of them are also linked to the corresponding abstracts.", 
        "135": "Since the corpora do not contain phrase-level importance annotation, we induce gold-standard labels for candidate phrases based on the following rule.", 
        "136": "A candidate phrase is considered as a positive sample if its head word is contained in any abstractive summary or participant summary.", 
        "137": "On average, 71.9 candidate phrases are identified per discussion for AMI-FULL with 31.3% labeled as positive, and 73.4 for ICSI-FULL with 24.0% of them as positive samples.", 
        "138": "Furthermore, a subset of discussions in AMI-\nFULL are annotated with discourse structure and relations based on Twente Argumentation Schema (TAS) by Rienks et al.", 
        "139": "(2005)4.", 
        "140": "A tree-structured argument diagram (as shown in Figure 1) is created for each discussion or a part of the discussion.", 
        "141": "The nodes of the tree contain partial or complete speaker turns, and discourse relation types are labeled on the links between the nodes.", 
        "142": "In total, we have 129 discussions annotated with discourse labels.", 
        "143": "This dataset is called AMI-SUB hereafter.", 
        "144": "Experimental Setup.", 
        "145": "5-fold cross validation is used for all experiments.", 
        "146": "All real-valued features are uniformly normalized to [0,1].", 
        "147": "For the joint learning algorithm, we use 10 epochs and carry out 50 sampling for MCMC for each training sample.", 
        "148": "The learning rate is set to 0.01.", 
        "149": "We run the learning algorithm for 20 times, and use the average of the learned weights as the final parameter values.", 
        "150": "For models trained with latent discourse relations, we fix the number of relations to 9.", 
        "151": "Baselines and Comparisons.", 
        "152": "For both phrasebased content selection and discourse relation prediction tasks, we consider a baseline that always predicts the majority label (Majority).", 
        "153": "Previous work has shown that Support Vector Machines (SVMs)-based classifiers achieve state-of-the-art performance for keyphrase selection in meetings (Fernández et al., 2008; Wang and Cardie, 2013) and discourse parsing for formal text (Hernault et al., 2010).", 
        "154": "Therefore, we compare with linear SVM-based classifiers, trained with the same feature set of content features or discourse features.", 
        "155": "We fix the trade-off parameter to 1.0 for all SVM-based experiments.", 
        "156": "For discourse relation prediction, we use one-vs-rest strategy to build multiple binary classifiers.5 We also compare with a state-of-the-art discourse parser (Ji et al., 2016), which employs neural language model to predict discourse relations.", 
        "157": "5 Experimental Results    5.1 Phrase Selection and Discourse Labeling  Here we present the experimental results on phrase-based content selection and discourse relation prediction.", 
        "158": "We experiment with two variations of our joint model: one is trained on goldstandard discourse relations, the other is trained by\n4There are 9 types of relations in TAS: POSITIVE, NEGATIVE, UNCERTAIN, REQUEST, SPECIALIZATION, ELABORATION, OPTION, OPTION EXCLUSION, and SUBJECT-TO.", 
        "159": "5Multi-class classifier was also experimented with, but gave inferior performance.", 
        "160": "treating discourse relations as latent models as described in Section 3.1.", 
        "161": "Remember that we have gold-standard argument diagrams on the AMISUB dataset, we can thus conduct experiments by assuming the True Attachment Structure is given for latent versions.", 
        "162": "When argument diagrams are not available, we build a tree among the turns in each discussion as follows.", 
        "163": "Two turns are attached if there is any adjacency pair between them.", 
        "164": "If one turn is attached to more than one previous turns, the closest one is considered.", 
        "165": "For the rest of the turns, they are attached to the preceding turn.", 
        "166": "This construction is applied on AMI-FULL and ICSIFULL.", 
        "167": "We also investigate whether joint learning and joint inference can produce better prediction per-\nformance.", 
        "168": "We consider joint learning with separate inference, where only content features or discourse features are used for prediction (SeparateInference).", 
        "169": "We further study learning separate classifiers for content selection and discourse relations without joint features (Separate-Learn).", 
        "170": "We first show the phrase selection and discourse relation prediction results on AMI-SUB in Tables 1 and 2.", 
        "171": "As shown in Table 1, our models, trained with gold-standard discourse relations or latent ones with true attachment structure, yield significant better accuracy and F1 scores than SVM-based classifiers trained with the same feature sets for phrase selection (paired t-test, p < 0.05).", 
        "172": "Our joint learning model with separate inference also outperforms neural network-based discourse parsing model (Ji et al., 2016) in Table 2.", 
        "173": "Moreover, Tables 1 and 2 demonstrate that joint learning usually produces superior performance for both tasks than separate learning.", 
        "174": "Combined with joint inference, our model obtains the best accuracy and F1 on phrase selection.", 
        "175": "This indicates that leveraging the interplay between content and discourse boost the prediction performance.", 
        "176": "Similar results are achieved on AMI-FULL and ICSIFULL in Table 3, where latent discourse relations without true attachment structure are employed for training.", 
        "177": "5.2 Phrase-Based Extractive Summarization  We further evaluate whether the prediction of the content selection component can be used for summarizing the key points on discussion level.", 
        "178": "For each discussion, salient phrases identified by our model are concatenated in sequence for use as the summary.", 
        "179": "We consider two types of gold-standard summaries.", 
        "180": "One is utterance-level extractive summary, which consists of human labeled summaryworthy utterances.", 
        "181": "The other is abstractive sum-\nmary, where we collect human abstract with at least one link from summary-worthy utterances.", 
        "182": "We calculate scores based on ROUGE (Lin and Hovy, 2003), which is a popular tool for evaluating text summarization (Gillick et al., 2009; Liu and Liu, 2010).", 
        "183": "ROUGE-1 (unigrams) and ROUGE-SU4 (skip-bigrams with at most 4 words in between) are used.", 
        "184": "Following previous work on meeting summarization (Riedhammer et al., 2010; Wang and Cardie, 2013), we consider two dialogue act-level summarization baselines: (1) LONGEST DA in each discussion is selected as the summary, and (2) CENTROID DA, the one with the highest TF-IDF similarity with all DAs in the discussion.", 
        "185": "We also compare with an unsupervised keyword extraction approach by Liu et al.", 
        "186": "(2009), where word importance is estimated by its TF-IDF score, POS tag, and the salience of its corresponding sentence.", 
        "187": "With the same candidate phrases as in our model, we extend Liu et al.", 
        "188": "(2009) by scoring each phrase based on its average score of the words.", 
        "189": "Top phrases, with the same number of phrases output by our model, are included into the summaries.", 
        "190": "Finally, we compare with summaries consisting of salient phrases predicted by an SVM classifier trained with our content features.", 
        "191": "From the results in Table 4, we can see that phrase-based extractive summarization methods can yield better ROUGE scores for recall and F1 than baselines that extract the whole sentences.", 
        "192": "Meanwhile, our system significantly out-\nperforms the SVM-based classifiers when evaluated on ROUGE recall and F1, while achieving comparable precision.", 
        "193": "Compared to Liu et al.", 
        "194": "(2009), our system also yields better results on all metrics.", 
        "195": "Sample summaries by our model along with two baselines are displayed in Figure 2.", 
        "196": "Utterancelevel extract-based baselines unavoidably contain disfluency and unnecessary details.", 
        "197": "Our phrasebased extractive summary is able to capture the key points from both the argumentation process and important outcomes of the conversation.", 
        "198": "This implies that our model output can be used as input for an abstractive summarization system.", 
        "199": "It can also facilitate the visualization of decision-making processes.", 
        "200": "5.3 Further Analysis and Discussions  Features Analysis.", 
        "201": "We first discuss salient features with top weights learned by our joint model.", 
        "202": "For content features, main speaker tends to utter more salient content.", 
        "203": "Higher TF-IDF scores also\nindicate important phrases.", 
        "204": "If a phrase is mentioned in previous turn and repeated in the current turn, it is likely to be a key point.", 
        "205": "For discourse features, structure features matter the most.", 
        "206": "For instance, jointly modeling the discourse relation of the parent node along with the current node can lead to better inference.", 
        "207": "An example is that giving more details on the proposal (ELABORATION) tends to lead to POSITIVE feedback.", 
        "208": "Moreover, REQUEST usually appears close to the root of the argument diagram tree, while POSITIVE feedback is usually observed on leaves.", 
        "209": "Adjacency pairs also play an important role for discourse prediction.", 
        "210": "For joint features, features that composite “phrase mentioned in previous turn” and relation POSITIVE feedback or REQUEST yield higher weight, which are indicators for both key phrases and discourse relations.", 
        "211": "We also find that main speaker information composite with ELABORATION and UNCERTAIN are associated with high weights.", 
        "212": "Error Analysis and Potential Directions.", 
        "213": "Taking a closer look at our prediction results, one major source of incorrect prediction for phrase selection is based on the fact that similar concepts might be expressed in different ways, and our model predicts inconsistently for different variations.", 
        "214": "For example, participants use both “thick” and “two centimeters” to talk about the desired shape of a remote control.", 
        "215": "However, our model does not group them into the same cluster and later makes different predictions.", 
        "216": "For future work, semantic similarity with context information can be leveraged to produce better clustering results.", 
        "217": "Furthermore, identifying discourse relations in dialogues is still a challenging task.", 
        "218": "For instance, “I wouldn’t choose a plastic case” should be labeled as OPTION EXCLUSION, if the previous turns talk about different options.", 
        "219": "Otherwise, it can be labeled as NEGATIVE.", 
        "220": "Therefore, models that better handle semantics and context need to be considered.", 
        "221": "6 Predicting Consistency of Understanding  As discussed in previous work (Mulder et al., 2002; Mercer, 2004), both content and discourse structure are critical for building shared understanding among discussants.", 
        "222": "In this section, we test whether our joint model can be utilized to predict the consistency among team members’ under-\nstanding of their group decisions, which is defined as consistency of understanding (COU) in Kim and Shah (2016).", 
        "223": "Kim and Shah (2016) establish gold-standard COU labels on a portion of AMI discussions, by comparing participant summaries to determine whether participants report the same decisions.", 
        "224": "If all decision points are consistent, the associated topic discussion is labeled as consistent; otherwise, the discussion is identified as inconsistent.", 
        "225": "Their annotation covers the AMI-SUB dataset.", 
        "226": "Therefore, we run the prediction experiments on AMI-SUB by using the same annotation.", 
        "227": "Out of total 129 discussions in AMI-SUB, 86 discussions are labeled as consistent and 43 are inconsistent.", 
        "228": "We construct three types of features by using our model’s predicted labels.", 
        "229": "Firstly, we learn two versions of our model based on the “consistent” discussions and the “inconsistent” ones in the training set, with learned parameters wcon and wincon.", 
        "230": "For a discussion in the test set, these two models output two probabilities pcon = maxc,d P (c,d|x,wcon) and pincon = maxc,d P (c,d|x,wincon).", 
        "231": "We use pcon − pincon as a feature.", 
        "232": "Furthermore, we consider discourse relations of length one and two from the discourse structure tree.", 
        "233": "Intuitively, some discourse relations, e.g., ELABORATION followed by multiple POSITIVE feedback, imply consistent understanding.", 
        "234": "The third feature is based on word entrainment, which has been shown to correlate with task success for groups (Nenkova et al., 2008).", 
        "235": "Using the formula in Nenkova et al.", 
        "236": "(2008), we compute the average word entrainment between the main speaker who utters the most words and all the other participants.", 
        "237": "The content words in the salient phrases predicted by our model is considered for entrainment computation.", 
        "238": "Results.", 
        "239": "Leave-one-out is used for experiments.", 
        "240": "For training, our features are constructed from gold-standard phrase and discourse labels.", 
        "241": "Predicted labels by our model is used for constructing features during testing.", 
        "242": "SVM-based classifier is used for experimenting with different sets of features output by our model.", 
        "243": "A majority class baseline is constructed as well.", 
        "244": "We also consider an SVM classifier trained with ngram features (unigrams and bigrams).", 
        "245": "Finally, we compare with the state-of-the-art method in Kim and Shah (2016), where discourse-relevant features and head ges-\nture features are utilized in Hidden Markov Models to predict the consistency label.", 
        "246": "The results are displayed in Table 5.", 
        "247": "All SVMs trained with our features surpass the ngrams-based baseline.", 
        "248": "Especially, the discourse features, word entrainment feature, and the combination of the three, all significantly outperform the state-of-theart system by Kim and Shah (2016).6  7 Conclusion  We presented a joint model for performing phraselevel content selection and discourse relation prediction in spoken meetings.", 
        "249": "Experimental results on AMI and ICSI meeting corpora showed that our model can outperform state-of-the-art methods for both tasks.", 
        "250": "Further evaluation on the task of predicting consistency-of-understanding in meetings demonstrated that classifiers trained with features constructed from our model output produced superior performance compared to the state-of-the-art model.", 
        "251": "This provides an evidence of our model being successfully applied in other prediction tasks in spoken meetings.", 
        "252": "Acknowledgments  This work was supported in part by National Science Foundation Grant IIS-1566382 and a GPU gift from Nvidia.", 
        "253": "We thank three anonymous reviewers for their valuable suggestions on various aspects of this work.", 
        "254": "6We also experiment with other popular classifiers, e.g.", 
        "255": "logistic regression or decision tree, and similar trend is respected."
    }, 
    "document_id": "P17-1090.pdf.json"
}
