{
    "abstract_sentences": {
        "1": "Knowledge bases are important resources for a variety of natural language processing tasks but suffer from incompleteness.", 
        "2": "We propose a novel embedding model, ITransF, to perform knowledge base completion.", 
        "3": "Equipped with a sparse attention mechanism, ITransF discovers hidden concepts of relations and transfer statistical strength through the sharing of concepts.", 
        "4": "Moreover, the learned associations between relations and concepts, which are represented by sparse attention vectors, can be interpreted easily.", 
        "5": "We evaluate ITransF on two benchmark datasets— WN18 and FB15k for knowledge base completion and obtains improvements on both the mean rank and Hits@10 metrics, over all baselines that do not use additional information."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 950–962 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1088  1 Introduction  Knowledge bases (KB), such as WordNet (Fellbaum, 1998), Freebase (Bollacker et al., 2008), YAGO (Suchanek et al., 2007) and DBpedia (Lehmann et al., 2015), are useful resources for many applications such as question answering (Berant et al., 2013; Yih et al., 2015; Dai et al., 2016) and information extraction (Mintz et al., 2009).", 
        "2": "However, knowledge bases suffer from incompleteness despite their formidable sizes (Socher et al., 2013; West et al., 2014), leading to a number of studies on automatic knowledge base completion (KBC) (Nickel et al., 2015) or link prediction.", 
        "3": "The fundamental motivation behind these studies is that there exist some statistical regularities under the intertwined facts stored in the multirelational knowledge base.", 
        "4": "By discovering gener-\nalizable regularities in known facts, missing ones may be recovered in a faithful way.", 
        "5": "Due to its excellent generalization capability, distributed representations, a.k.a.", 
        "6": "embeddings, have been popularized to address the KBC task (Nickel et al., 2011; Bordes et al., 2011, 2014, 2013; Socher et al., 2013; Wang et al., 2014; Guu et al., 2015; Nguyen et al., 2016b).", 
        "7": "As a seminal work, Bordes et al.", 
        "8": "(2013) proposes the TransE, which models the statistical regularities with linear translations between entity embeddings operated by a relation embedding.", 
        "9": "Implicitly, TransE assumes both entity embeddings and relation embeddings dwell in the same vector space, posing an unnecessarily strong prior.", 
        "10": "To relax this requirement, a variety of models first project the entity embeddings to a relationdependent space (Bordes et al., 2014; Ji et al., 2015; Lin et al., 2015b; Nguyen et al., 2016b), and then model the translation property in the projected space.", 
        "11": "Typically, these relation-dependent spaces are characterized by the projection matrices unique to each relation.", 
        "12": "As a benefit, different aspects of the same entity can be temporarily emphasized or depressed as an effect of the projection.", 
        "13": "For instance, STransE (Nguyen et al., 2016b) utilizes two projection matrices per relation, one for the head entity and the other for the tail entity.", 
        "14": "Despite the superior performance of STransE compared to TransE, it is more prone to the data sparsity problem.", 
        "15": "Concretely, since the projection spaces are unique to each relation, projection matrices associated with rare relations can only be exposed to very few facts during training, resulting in poor generalization.", 
        "16": "For common relations, a similar issue exists.", 
        "17": "Without any restrictions on the number of projection matrices, logically related or conceptually similar relations may have distinct projection spaces, hindering the discovery, sharing, and generalization of statistical regularities.", 
        "18": "950\nPreviously, a line of research makes use of external information such as textual relations from web-scale corpus or node features (Toutanova et al., 2015; Toutanova and Chen, 2015; Nguyen et al., 2016a), alleviating the sparsity problem.", 
        "19": "In parallel, recent work has proposed to model regularities beyond local facts by considering multirelation paths (Garcı́a-Durán et al., 2015; Lin et al., 2015a; Shen et al., 2016).", 
        "20": "Since the number of paths grows exponentially with its length, as a side effect, path-based models enjoy much more training cases, suffering less from the problem.", 
        "21": "In this paper, we propose an interpretable knowledge transfer model (ITransF), which encourages the sharing of statistic regularities between the projection matrices of relations and alleviates the data sparsity problem.", 
        "22": "At the core of ITransF is a sparse attention mechanism, which learns to compose shared concept matrices into relation-specific projection matrices, leading to a better generalization property.", 
        "23": "Without any external resources, ITransF improves mean rank and Hits@10 on two benchmark datasets, over all previous approaches of the same kind.", 
        "24": "In addition, the parameter sharing is clearly indicated by the learned sparse attention vectors, enabling us to interpret how knowledge transfer is carried out.", 
        "25": "To induce the desired sparsity during optimization, we further introduce a block iterative optimization algorithm.", 
        "26": "In summary, the contributions of this work are: (i) proposing a novel knowledge embedding model which enables knowledge transfer by learning to discover shared regularities; (ii) introducing a learning algorithm to directly optimize a sparse representation from which the knowledge transferring procedure is interpretable; (iii) showing the effectiveness of our model by outperforming baselines on two benchmark datasets for knowledge base completion task.", 
        "27": "2 Notation and Previous Models  Let E denote the set of entities and R denote the set of relations.", 
        "28": "In knowledge base completion, given a training set P of triples (h, r, t) where h, t ∈ E are the head and tail entities having a relation r ∈ R, e.g., (Steve Jobs, FounderOf, Apple), we want to predict missing facts such as (Steve Jobs, Profession, Businessperson).", 
        "29": "Most of the embedding models for knowledge base completion define an energy function fr(h, t)\naccording to the fact’s plausibility (Bordes et al., 2011, 2014, 2013; Socher et al., 2013; Wang et al., 2014; Yang et al., 2015; Guu et al., 2015; Nguyen et al., 2016b).", 
        "30": "The models are learned to minimize energy fr(h, t) of a plausible triple (h, r, t) and to maximize energy fr(h′, t′) of an implausible triple (h′, r, t′).", 
        "31": "Motivated by the linear translation phenomenon observed in well trained word embeddings (Mikolov et al., 2013), TransE (Bordes et al., 2013) represents the head entity h, the relation r and the tail entity t with vectors h, r and t ∈ Rn respectively, which were trained so that h+r ≈ t. They define the energy function as\nfr(h, t) = ‖h+ r− t‖` where ` = 1 or 2, which means either the `1 or the `2 norm of the vector h + r − t will be used depending on the performance on the validation set.", 
        "32": "To better model relation-specific aspects of the same entity, TransR (Lin et al., 2015b) uses projection matrices and projects the head entity and the tail entity to a relation-dependent space.", 
        "33": "STransE (Nguyen et al., 2016b) extends TransR by employing different matrices for mapping the head and the tail entity.", 
        "34": "The energy function is\nfr(h, t) = ‖Wr,1h+ r−Wr,2t‖` However, not all relations have abundant data to estimate the relation specific matrices as most of the training samples are associated with only a few relations, leading to the data sparsity problem for rare relations.", 
        "35": "3 Interpretable Knowledge Transfer    3.1 Model  As discussed above, a fundamental weakness in TransR and STransE is that they equip each relation with a set of unique projection matrices, which not only introduces more parameters but also hinders knowledge sharing.", 
        "36": "Intuitively, many relations share some concepts with each other, although they are stored as independent symbols in KB.", 
        "37": "For example, the relation “(somebody) won award for (some work)” and “(somebody) was nominated for (some work)” both describe a person’s high-quality work which wins an award or a nomination respectively.", 
        "38": "This phenomenon suggests that one relation actually represents a collection of real-world concepts, and one concept\ncan be shared by several relations.", 
        "39": "Inspired by the existence of such lower-level concepts, instead of defining a unique set of projection matrices for every relation, we can alternatively define a small set of concept projection matrices and then compose them into customized projection matrices.", 
        "40": "Effectively, the relation-dependent translation space is then reduced to the smaller concept spaces.", 
        "41": "However, in general, we do not have prior knowledge about what concepts exist out there and how they are composed to form relations.", 
        "42": "Therefore, in ITransF, we propose to learn this information simultaneously from data, together with all knowledge embeddings.", 
        "43": "Following this idea, we first present the model details, then discuss the optimization techniques for training.", 
        "44": "Energy function Specifically, we stack all the concept projection matrices to a 3-dimensional tensor D ∈ Rm×n×n, wherem is the pre-specified number of concept projection matrices and n is the dimensionality of entity embeddings and relation embeddings.", 
        "45": "We let each relation select the most useful projection matrices from the tensor, where the selection is represented by an attention vector.", 
        "46": "The energy function of ITransF is defined as:\nfr(h, t) = ‖αHr ·D · h+ r−αTr ·D · t‖` (1)\nwhere αHr ,α T r ∈ [0, 1]m, satisfying ∑ iα\nH r,i =∑\niα T r,i = 1, are normalized attention vectors used to compose all concept projection matrices in D by a convex combination.", 
        "47": "It is obvious that STransE can be expressed as a special case of our model when we use m = 2|R| concept matrices and set attention vectors to disjoint one-hot vectors.", 
        "48": "Hence our model space is a generalization of STransE.", 
        "49": "Note that we can safely use fewer concept matrices in ITransF and obtain better performance (see section 4.3), though STransE always requires 2|R| projection matrices.", 
        "50": "We follow previous work to minimize the following hinge loss function:\nL = ∑\n(h,r,t)∼P, (h′,r,t′)∼N\n[ γ + fr(h, t)− fr(h′, t′) ] + (2)\nwhere P is the training set consisting of correct triples, N is the distribution of corrupted triples defined in section 3.3, and [·]+ = max(·, 0).", 
        "51": "Note that we have omitted the dependence of N on (h, r, t) to avoid clutter.", 
        "52": "We normalize the entity vectors h, t, and the projected entity vectors\nαHr ·D · h and αTr ·D · t to have unit length after each update, which is an effective regularization method that benefits all models.", 
        "53": "Sparse attention vectors In Eq.", 
        "54": "(1), we have defined αHr ,α T r to be some normalized vectors used for composition.", 
        "55": "With a dense attention vector, it is computationally expensive to perform the convex combination of m matrices in each iteration.", 
        "56": "Moreover, a relation usually does not consist of all existing concepts in practice.", 
        "57": "Furthermore, when the attention vectors are sparse, it is often easier to interpret their behaviors and understand how concepts are shared by different relations.", 
        "58": "Motivated by these potential benefits, we further hope to learn sparse attention vectors in ITransF.", 
        "59": "However, directly posing `1 regularization (Tibshirani, 1996) on the attention vectors fails to produce sparse representations in our preliminary experiment, which motivates us to enforce `0 constraints on αTr ,α H r .", 
        "60": "In order to satisfy both the normalization condition and the `0 constraints, we reparameterize the attention vectors in the following way:\nαHr = SparseSoftmax(v H r , I H r ) αTr = SparseSoftmax(v T r , I T r )\nwhere vHr ,v T r ∈ Rm are the pre-softmax scores, IHr , I T r ∈ {0, 1}m are the sparse assignment vectors, indicating the non-zero entries of attention vectors, and the SparseSoftmax is defined as\nSparseSoftmax(v, I)i = exp(vi/τ)Ii∑ j exp(vj/τ)Ij\nwith τ being the temperature of Softmax.", 
        "61": "With this reparameterization, vHr ,v T r and IHr , I T r replace α T r ,α H r to become the real parameters of the model.", 
        "62": "Also, note that it is equivalent to pose the `0 constraints on IHr , I T r instead of αTr ,α H r .", 
        "63": "Putting these modifications together, we can rewrite the optimization problem as\nminimize L subject to ‖IHr ‖0 ≤ k, ‖ITr ‖0 ≤ k\n(3)\nwhere L is the loss function defined in Eq.", 
        "64": "(2).", 
        "65": "3.2 Block Iterative Optimization  Though sparseness is favorable in practice, it is generally NP-hard to find the optimal solution under `0 constraints.", 
        "66": "Thus, we resort to an approximated algorithm in this work.", 
        "67": "For convenience, we refer to the parameters with and without the sparse constraints as the sparse partition and the dense partition, respectively.", 
        "68": "Based on this notion, the high-level idea of the approximated algorithm is to iteratively optimize one of the two partitions while holding the other one fixed.", 
        "69": "Since all parameters in the dense partition, including the embeddings, the projection matrices, and the pre-softmax scores, are fully differentiable with the sparse partition fixed, we can simply utilize SGD to optimize the dense partition.", 
        "70": "Then, the core difficulty lies in the step of optimizing the sparse partition (i.e.", 
        "71": "the sparse assignment vectors), during which we want the following two properties to hold\n1. the sparsity required by the `0 constaint is maintained, and\n2. the cost define by Eq.", 
        "72": "(2) is decreased.", 
        "73": "Satisfying the two criterion seems to highly resemble the original problem defined in Eq.", 
        "74": "(3).", 
        "75": "However, the dramatic difference here is that with parameters in the dense partition regarded as constant, the cost function is decoupled w.r.t.", 
        "76": "each relation r. In other words, the optimal choice of IHr , I T r is independent of I H r′ , I T r′ for any r\n′ 6= r. Therefore, we only need to consider the optimization for a single relation r, which is essentially an assignment problem.", 
        "77": "Note that, however, IHr and ITr are still coupled, without which we basically reach the situation in a backpack problem.", 
        "78": "In principle, one can explore combinatorial optimization techniques to optimize IHr′ , I T r′ jointly, which usually involve some iterative procedure.", 
        "79": "To avoid adding another inner loop to our algorithm, we turn to a simple but fast approximation method based on the following single-matrix cost.", 
        "80": "Specifically, for each relation r, we consider the induced cost LHr,i where only a single projection matrix i is used for the head entity:\nLHr,i = ∑\n(h,r,t)∼Pr, (h′,r,t′)∼Nr\n[ γ + fHr,i(h, t)− fHr,i(h′, t′) ] +\nwhere fHr,i(h, t) = ‖Di · h + r − αTr · D · t‖ is the corresponding energy function, and the subscript in Pr and Nr denotes the subsets with relation r. Intuitively, LHr,i measures, given the current tail attention vector αTr , if only one project matrix could be chosen for the head entity, how implausible Di would be.", 
        "81": "Hence, i∗ = argmini LHr,i gives\nus the best single projection matrix on the head side given αTr .", 
        "82": "Now, in order to choose the best k matrices, we basically ignore the interaction among projection matrices, and update IHr in the following way:\nIHr,i ← { 1, i ∈ argpartitioni(LHr,i, k) 0, otherwise\nwhere the function argpartitioni(xi, k) produces the index set of the lowest-k values of xi.", 
        "83": "Analogously, we can define the single-matrix cost LTr,i and the energy function fTr,i(h, t) on the tail side in a symmetric way.", 
        "84": "Then, the update rule for IHr follows the same derivation.", 
        "85": "Admittedly, the approximation described here is relatively crude.", 
        "86": "But as we will show in section 4, the proposed algorithm yields good performance empirically.", 
        "87": "We leave the further improvement of the optimization method as future work.", 
        "88": "3.3 Corrupted Sample Generating Method  Recall that we need to sample a negative triple (h′, r, t′) to compute hinge loss shown in Eq.", 
        "89": "2, given a positive triple (h, r, t) ∈ P .", 
        "90": "The distribution of negative triple is denoted by N(h, r, t).", 
        "91": "Previous work (Bordes et al., 2013; Lin et al., 2015b; Yang et al., 2015; Nguyen et al., 2016b) generally constructs a set of corrupted triples by replacing the head entity or tail entity with a random entity uniformly sampled from the KB.", 
        "92": "However, uniformly sampling corrupted entities may not be optimal.", 
        "93": "Often, the head and tail entities associated a relation can only belong to a specific domain.", 
        "94": "When the corrupted entity comes from other domains, it is very easy for the model to induce a large energy gap between true triple and corrupted one.", 
        "95": "As the energy gap exceeds γ, there will be no training signal from this corrupted triple.", 
        "96": "In comparison, if the corrupted entity comes from the same domain, the task becomes harder for the model, leading to more consistent training signal.", 
        "97": "Motivated by this observation, we propose to sample corrupted head or tail from entities in the same domain with a probability pr and from the whole entity set with probability 1 − pr.", 
        "98": "The choice of relation-dependent probability pr is specified in Appendix A.1.", 
        "99": "In the rest of the paper, we refer to the new proposed sampling method as ”domain sampling”.", 
        "100": "4 Experiments    4.1 Setup  To evaluate link prediction, we conduct experiments on the WN18 (WordNet) and FB15k (Freebase) introduced by Bordes et al.", 
        "101": "(2013) and use the same training/validation/test split as in (Bordes et al., 2013).", 
        "102": "The information of the two datasets is given in Table 1.", 
        "103": "In knowledge base completion task, we evaluate model’s performance of predicting the head entity or the tail entity given the relation and the other entity.", 
        "104": "For example, to predict head given relation r and tail t in triple (h, r, t), we compute the energy function fr(h′, t) for each entity h′ in the knowledge base and rank all the entities according to the energy.", 
        "105": "We follow Bordes et al.", 
        "106": "(2013) to report the filter results, i.e., removing all other correct candidates h′ in ranking.", 
        "107": "The rank of the correct entity is then obtained and we report the mean rank (mean of the predicted ranks) and Hits@10 (top 10 accuracy).", 
        "108": "Lower mean rank or higher Hits@10 mean better performance.", 
        "109": "4.2 Implementation Details  We initialize the projection matrices with identity matrices added with a small noise sampled from normal distribution N (0, 0.0052).", 
        "110": "The entity and relation vectors of ITransF are initialized by TransE (Bordes et al., 2013), following Lin et al.", 
        "111": "(2015b); Ji et al.", 
        "112": "(2015); Garcı́a-Durán et al.", 
        "113": "(2016, 2015); Lin et al.", 
        "114": "(2015a).", 
        "115": "We ran minibatch SGD until convergence.", 
        "116": "We employ the “Bernoulli” sampling method to generate incorrect triples as used in Wang et al.", 
        "117": "(2014), Lin et al.", 
        "118": "(2015b), He et al.", 
        "119": "(2015), Ji et al.", 
        "120": "(2015) and Lin et al.", 
        "121": "(2015a).", 
        "122": "STransE (Nguyen et al., 2016b) is the most similar knowledge embedding model to ours except that they use distinct projection matrices for each relation.", 
        "123": "We use the same hyperparameters as used in STransE and no significant improvement is ob-\nserved when we alter hyperparameters.", 
        "124": "We set the margin γ to 5 and dimension of embedding n to 50 for WN18, and γ = 1, n = 100 for FB15k.", 
        "125": "We set the batch size to 20 for WN18 and 1000 for FB15k.", 
        "126": "The learning rate is 0.01 on WN18 and 0.1 on FB15k.", 
        "127": "We use 30 matrices on WN18 and 300 matrices on FB15k.", 
        "128": "All the models are implemented with Theano (Bergstra et al., 2010).", 
        "129": "The Softmax temperature is set to 1/4.", 
        "130": "4.3 Results & Analysis  The overall link prediction results1 are reported in Table 2.", 
        "131": "Our model consistently outperforms previous models without external information on both the metrics of WN18 and FB15k.", 
        "132": "On WN18, we even achieve a much better mean rank with comparable Hits@10 than current state-of-the-art model IRN employing external information.", 
        "133": "We can see that path information is very helpful on FB15k and models taking advantage of path information outperform intrinsic models by a significant margin.", 
        "134": "Indeed, a lot of facts are easier to recover with the help of multi-step inference.", 
        "135": "For example, if we know Barack Obama is born in Honolulu, a city in the United States, then we easily know the nationality of Obama is the United States.", 
        "136": "An straightforward way of extending our proposed model to k-step path P = {ri}ki=1 is to define a path energy function ‖αHP · D · h +∑\nri∈P ri − αTP · D · t‖`, αHP is a concept association related to the path.", 
        "137": "We plan to extend our model to multi-step path in the future.", 
        "138": "To provide a detailed understanding why the proposed model achieves better performance, we present some further analysis in the sequel.", 
        "139": "Performance on Rare Relations In the proposed ITransF, we design an attention mechanism to encourage knowledge sharing across different relations.", 
        "140": "Naturally, facts associated with rare relations should benefit most from such sharing, boosting the overall performance.", 
        "141": "To verify this hypothesis, we investigate our model’s performance on relations with different frequency.", 
        "142": "The overall distribution of relation frequencies resembles that of word frequencies, subject to the zipf’s law.", 
        "143": "Since the frequencies of relations approximately follow a power distribution, their log\n1Note that although IRN (Shen et al., 2016) does not explicitly exploit path information, it performs multi-step inference through the multiple usages of external memory.", 
        "144": "When IRN is allowed to access memory once for each prediction, its Hits@10 is 80.7, similar to models without path information.", 
        "145": "frequencies are linear.", 
        "146": "The statistics of relations on FB15k and WN18 are shown in Figure 1.", 
        "147": "We can clearly see that the distributions exhibit long tails, just like the Zipf’s law for word frequency.", 
        "148": "In order to study the performance of relations with different frequencies, we sort all relations by their frequency in the training set, and split them into 3 buckets evenly so that each bucket has a similar interval length of log frequency.", 
        "149": "Within each bucket, we compare our model with STransE, as shown in Figure 2.2 As we can see, on WN18, ITransF outperforms STransE by a significant margin on rare relations.", 
        "150": "In particular, in the last bin (rarest relations), the average Hits@10 increases from 55.2 to 93.8, showing the great benefits of transferring statistical strength from common relations to rare ones.", 
        "151": "The comparison on each relation is shown in Appendix A.2.", 
        "152": "On FB15k, we can also observe a similar pattern, although the degree of improvement is less significant.", 
        "153": "We conjecture the difference roots in the fact that many rare relations on FB15k have disjoint domains, knowledge transfer through common concepts is harder.", 
        "154": "Interpretability In addition to the quantitative evidence supporting the effectiveness of knowledge sharing, we provide some intuitive examples to show how knowledge is shared in our model.", 
        "155": "As\n2Domain sampling is not employed.", 
        "156": "we mentioned earlier, the sparse attention vectors fully capture the association between relations and concepts and hence the knowledge transfer among relations.", 
        "157": "Thus, we visualize the attention vectors for several relations on both WN18 and FB15K in Figure 3.", 
        "158": "For WN18, the words “hyponym” and “hypernym” refer to words with more specific or general meaning respectively.", 
        "159": "For example, PhD is a hyponym of student and student is a hypernym of PhD.", 
        "160": "As we can see, concepts associated with the head entities in one relation are also associated with the tail entities in its reverse relation.", 
        "161": "Further, “instance hypernym” is a special hypernym with the head entity being an instance, and the tail entity being an abstract notion.", 
        "162": "A typical example is (New York,instance hypernym, city).", 
        "163": "This connection has also been discovered by our model, indicated by the fact that “instance hypernym(T)” and “hypernym(T)” share a common concept matrix.", 
        "164": "Finally, for symmetric relations like “similar to”, we see the head attention is identical to the tail attention, which well matches our intuition.", 
        "165": "On FB15k, we also see the sharing between reverse relations, as in “(somebody) won award for (some work)” and “(some work) award winning work (somebody)”.", 
        "166": "What’s more, although relation “won award for” and “was nominated for” share the same concepts,\ntheir attention distributions are different, suggesting distinct emphasis.", 
        "167": "Finally, symmetric relations like spouse behave similarly as mentioned before.", 
        "168": "Model Compression A byproduct of parameter sharing mechanism employed by ITransF is a much more compact model with equal performance.", 
        "169": "Figure 5 plots the average performance of ITransF against the number of projection matrices m, together with two baseline models.", 
        "170": "On FB15k, when we reduce the number of matrices from 2200 to 30 (∼ 90× compression), our model performance decreases by only 0.09% on Hits@10, still outperforming STransE.", 
        "171": "Similarly, on WN18, ITransF continues to achieve the best performance when we reduce the number of concept project matrices to 18.", 
        "172": "5 Analysis on Sparseness  Sparseness is desirable since it contribute to interpretability and computational efficiency of our model.", 
        "173": "We investigate whether enforcing sparseness would deteriorate the model performance and compare our method with another sparse encoding methods in this section.", 
        "174": "Dense Attention w/o `1 regularization Although `0 constrained model usually enjoys many practical advantages, it may deteriorate the model performance when applied improperly.", 
        "175": "Here, we show that our model employing sparse attention can achieve similar results with dense attention with a significantly less computational burden.", 
        "176": "We also compare dense attention with `1 regularization.", 
        "177": "We set the `1 coefficient to 0.001 in our experiments and does not apply Softmax since the `1 of a vector after Softmax is always 1.", 
        "178": "We compare models in a setting where the computation time of\ndense attention model is acceptable3.", 
        "179": "We use 22 weight matrices on WN18 and 15 weight matrices on FB15k and train both the models for 2000 epochs.", 
        "180": "The results are reported in Table 3.", 
        "181": "Generally, ITransF with sparse attention has slightly better or comparable performance comparing to dense attention.", 
        "182": "Further, we show the attention vectors of\n3With 300 projection matrices, it takes 1h1m to run one epoch for a model with dense attention.", 
        "183": "model with `1 regularized dense attention in Figure 4.", 
        "184": "We see that `1 regularization does not produce a sparse attention, especially on FB15k.", 
        "185": "Nonnegative Sparse Encoding In the proposed model, we induce the sparsity by a carefully designed iterative optimization procedure.", 
        "186": "Apart from this approach, one may utilize sparse encoding techniques to obtain sparseness based on the pretrained projection matrices from STransE.", 
        "187": "Concretely, stacking |2R| pretrained projection\nmatrices into a 3-dimensional tensor X ∈ R2|R|×n×n, similar sparsity can be induced by solving an `1-regularized tensor completion problem minA,D ||X − DA||22 + λ‖A‖`1 .", 
        "188": "Basically, A plays the same role as the attention vectors in our model.", 
        "189": "For more details, we refer readers to (Faruqui et al., 2015).", 
        "190": "For completeness, we compare our model with the aforementioned approach4.", 
        "191": "The comparison is summarized in table 4.", 
        "192": "On both benchmarks, ITransF achieves significant improvement against sparse encoding on pretrained model.", 
        "193": "This performance gap should be expected since the objective function of sparse encoding methods is to minimize the reconstruction loss rather than optimize the criterion for link prediction.", 
        "194": "6 Related Work  In KBC, CTransR (Lin et al., 2015b) enables relation embedding sharing across similar relations, but they cluster relations before training rather than learning it in a principled way.", 
        "195": "Further, they do not solve the data sparsity problem because there is no sharing of projection matrices which have a lot more parameters.", 
        "196": "Learning the association between semantic relations has been used in related problems such as relational similarity measurement (Turney, 2012) and relation adaptation (Bollegala et al., 2015).", 
        "197": "Data sparsity is a common problem in many fields.", 
        "198": "Transfer learning (Pan and Yang, 2010) has been shown to be promising to transfer knowl-\n4We use the toolkit provided by (Faruqui et al., 2015).", 
        "199": "edge and statistical strengths across similar models or languages.", 
        "200": "For example, Bharadwaj et al.", 
        "201": "(2016) transfers models on resource-rich languages to low resource languages by parameter sharing through common phonological features in name entity recognition.", 
        "202": "Zoph et al.", 
        "203": "(2016) initialize from models trained by resource-rich languages to translate low-resource languages.", 
        "204": "Several works on obtaining a sparse attention (Martins and Astudillo, 2016; Makhzani and Frey, 2014; Shazeer et al., 2017) share a similar idea of sorting the values before softmax and only keeping theK largest values.", 
        "205": "However, the sorting operation in these works is not GPU-friendly.", 
        "206": "The block iterative optimization algorithm in our work is inspired by LightRNN (Li et al., 2016).", 
        "207": "They allocate every word in the vocabulary in a table.", 
        "208": "A word is represented by a row vector and a column vector depending on its position in the table.", 
        "209": "They iteratively optimize embeddings and allocation of words in tables.", 
        "210": "7 Conclusion and Future Work  In summary, we propose a knowledge embedding model which can discover shared hidden concepts, and design a learning algorithm to induce the interpretable sparse representation.", 
        "211": "Empirically, we show our model can improve the performance on two benchmark datasets without external resources, over all previous models of the same kind.", 
        "212": "In the future, we plan to enable ITransF to perform multi-step inference, and extend the sharing mechanism to entity and relation embeddings, further enhancing the statistical binding across parameters.", 
        "213": "In addition, our framework can also be applied to multi-task learning, promoting a finer sharing among different tasks.", 
        "214": "Acknowledgments  We thank anonymous reviewers and Graham Neubig for valuable comments.", 
        "215": "We thank Yulun Du, Paul Mitchell, Abhilasha Ravichander, Pengcheng Yin and Chunting Zhou for suggestions on the draft.", 
        "216": "We are also appreciative for the great working environment provided by staff in LTI.", 
        "217": "This research was supported in part by DARPA grant FA8750-12-2-0342 funded under the DEFT program.", 
        "218": "A Appendix  A.1 Domain Sampling Probability In this section, we define the probability pr to generate a negative sample from the same domain mentioned in Section 3.3.", 
        "219": "The probability cannot be too high to avoid generating negative samples that are actually correct, since there are generally a lot of facts missing in KBs.", 
        "220": "Specifically, let MHr = {h | ∃t(h, r, t) ∈ P} and MTr = {t | ∃h(h, r, t) ∈ P} denote the head or tail domain of relation r. Suppose Nr = {(h, r, t) ∈ P} is the induced set of edges with relation r. We define the probability pr as\npr = min( λ|MTr ||MHr | |Nr| , 0.5) (4)\nOur motivation of such a formulation is as follows: Suppose Or is the set that contains all truthful fact triples on relation r, i.e., all triples in training set and all other missing correct triples.", 
        "221": "If we assume all fact triples within the domain has uniform probability of being true, the probability of a random triple being correct is Pr((h, r, t) ∈ Or | h ∈ MHr , t ∈ MTr ) = |Or||MHr ||MTr |\nAssume that all facts are missing with a probability λ, then |Nr| = λ|Or| and the above probability can be approximated by |Nr|\nλ|MHr ||MTr | .", 
        "222": "We\nwant the probability of generating a negative sample from the domain to be inversely proportional to the probability of the sample being true, so we define the probability as Eq.", 
        "223": "4.", 
        "224": "The results in section 4 are obtained with λ set to 0.001.", 
        "225": "We compare how different value of λ would influence our model’s performance in Table.", 
        "226": "5.", 
        "227": "With large λ and higher domain sampling probability, our model’s Hits@10 increases while mean rank also increases.", 
        "228": "The rise of mean rank is due to higher probability of generating a valid triple as a negative sample causing the energy of a valid triple to increase, which leads to a higher overall rank of a correct entity.", 
        "229": "However, the reasoning capability is boosted with higher Hits@10 as shown in the table.", 
        "230": "A.2 Performance on individual relations of WN18\nWe plot the performance of ITransF and STransE on each relation.", 
        "231": "We see that the improvement is greater on rare relations."
    }, 
    "document_id": "P17-1088.pdf.json"
}
