{
    "abstract_sentences": {
        "1": "Accurate detection of emotion from natural language has applications ranging from building emotional chatbots to better understanding individuals and their lives.", 
        "2": "However, progress on emotion detection has been hampered by the absence of large labeled datasets.", 
        "3": "In this work, we build a very large dataset for fine-grained emotions and develop deep learning models on it.", 
        "4": "We achieve a new state-of-the-art on 24 fine-grained types of emotions (with an average accuracy of 87.58%).", 
        "5": "We also extend the task beyond emotion types to model Robert Plutchik’s 8 primary emotion dimensions, acquiring a superior accuracy of 95.68%."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 718–728 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1067\nAccurate detection of emotion from natural language has applications ranging from building emotional chatbots to better understanding individuals and their lives.", 
        "2": "However, progress on emotion detection has been hampered by the absence of large labeled datasets.", 
        "3": "In this work, we build a very large dataset for fine-grained emotions and develop deep learning models on it.", 
        "4": "We achieve a new state-of-the-art on 24 fine-grained types of emotions (with an average accuracy of 87.58%).", 
        "5": "We also extend the task beyond emotion types to model Robert Plutchik’s 8 primary emotion dimensions, acquiring a superior accuracy of 95.68%.", 
        "6": "1 Introduction  According to the Oxford English Dictionary, emotion is defined as “[a] strong feeling deriving from one’s circumstances, mood, or relationships with others.” 1 This “standard” definition identifies emotions as constructs involving something innate that is often invoked in social interactions and that aids in communicating with others(Hwang and Matsumoto, 2016).", 
        "7": "It is no exaggeration that humans are emotional beings: Emotions are an integral part of human life, and affect our decision making as well as our mental and physical health.", 
        "8": "As such, developing emotion detection models is important; they have a wide array of applications, ranging from building nuanced virtual assistants that cater for the emotions of their users to detecting the emotions of social media users in order to understand their mental and/or physical health.", 
        "9": "1https://en.oxforddictionaries.com/ definition/emotion.", 
        "10": "However, emotion detection has remained a challenging task, partly due to the limited availability of labeled data and partly due the controversial nature of what emotions themselves are (Aaron C. Weidman and Tracy, 2017).", 
        "11": "Recent advances in machine learning for natural language processing (NLP) suggest that, given enough labeled data, there should be an opportunity to build better emotion detection models.", 
        "12": "Manual labeling of data, however, is costly and so it is desirable to develop labeled emotion data without annotators.", 
        "13": "While the proliferation of social media has made it possible for us to acquire large datasets with implicit labels in the form of hashtags (Mohammad and Kiritchenko, 2015), such labels are noisy and reliable.", 
        "14": "In this work, we seek to enable deep learning by creating a large dataset of fine-grained emotions using Twitter data.", 
        "15": "More specifically, we harness cues in Twitter data in the form of emotion hashtags as a way to build a labeled emotion dataset that we then exploit using distant supervision (Mintz et al., 2009) (the use of hashtags as a surrogate for annotator-generated emotion labels) to build emotion models grounded in psychology.", 
        "16": "We construct such a dataset and exploit it using powerful deep learning methods to build accurate, high coverage models for emotion prediction.", 
        "17": "Overall, we make the following contributions: 1) Grounded in psychological theory of emotions, we build a large-scale, high quality dataset of tweets labeled with emotions.", 
        "18": "Key to this are methods to ensure data quality, 2) we validate the data collection method using human annotations, 3) we develop powerful deep learning models using a gated recurrent network to exploit the data, yielding new state-of-the-art on 24 fine-grained types of emotions, and 4) we extend the task beyond these emotion types to model Plutick’s 8 primary emotion dimensions.", 
        "19": "718\nOur emotion modeling relies on distant supervision (Read, 2005; Mintz et al., 2009), the approach of using cues in data (e.g., hashtags or emoticons) as a proxy for “ground truth” labels as we explained above.", 
        "20": "Distant supervision has been investigated by a number of researchers for emotion detection (Tanaka et al., 2005; Mohammad, 2012; Purver and Battersby, 2012; Wang et al., 2012; Pak and Paroubek, 2010; Yang et al., 2007) and for other semantic tasks such as sentiment analysis (Read, 2005; Go et al., 2009) and sarcasm detection (González-Ibánez et al., 2011).", 
        "21": "In these works, authors successfully use emoticons and/or hashtags as marks to label data after performing varying degrees of data quality assurance.", 
        "22": "We take a similar approach, using a larger collection of tweets, richer emotion definitions, and stronger filtering for tweet quality.", 
        "23": "The remainder of the paper is organized as follows: We first overview related literature in Section 2, describe our data collection in Section 3.1, and the annotation study we performed to validate our distant supervision method in Section 4.", 
        "24": "We then describe our methods in Section 5, provide results in Section 6, and conclude in Section 8.", 
        "25": "2 Related Work    2.1 Computational Treatment of Emotion  The SemEval-2007 Affective Text task (Strapparava and Mihalcea, 2007) [SEM07] focused on classification of emotion and valence (i.e., positive and negative texts) in news headlines.", 
        "26": "A total of 1,250 headlines were manually labeled with the 6 basic emotions of Ekman (Ekman, 1972) and made available to participants.", 
        "27": "Similarly, (Aman and Szpakowicz, 2007) describe an emotion annotation task of identifying emotion category, emotion intensity and the words/phrases that indicate emotion in blog post data of 4,090 sentences and a system exploiting the data.", 
        "28": "Our work differs from both that of SEM07 (Strapparava and Mihalcea, 2007) and (Aman and Szpakowicz, 2007) in that we focus on a different genre (i.e., Twitter) and investigate distant supervision as a way to acquire a significantly larger labeled dataset.", 
        "29": "Our work is similar to (Mohammad, 2012; Mohammad and Kiritchenko, 2015), (Wang et al., 2012), and (Volkova and Bachrach, 2016) who use distant supervision to acquire Twitter data with emotion hashtags and report analyses and experiments to validate the utility of this approach.", 
        "30": "For\nexample, (Mohammad, 2012) shows that by using a simple domain adaptation method to train a classifier on their data they are able to improve both precision and recall on the SemEval-2007 (Strapparava and Mihalcea, 2007) dataset.", 
        "31": "As the author points out, this is another premise that the selflabeled hashtags acquired from Twitter are consistent, to some degree, with the emotion labels given by the trained human judges who labeled the SemEval-2007 data.", 
        "32": "As pointed out earlier, (Wang et al., 2012) randomly sample a set of 400 tweets from their data and human-label as relevant/irrelevant, as a way to verify the distant supervision approach with the quality assurance heuristics they employ.", 
        "33": "The authors found that the precision on a test set is 93.16%, thus confirming the utility of the heuristics.", 
        "34": "(Wang et al., 2012) provide a number of important observations, as conclusions based on their work.", 
        "35": "These include that since they are provided by the tweets’ writers, the emotion hashtags are more natural and reliable than the emotion labels traditionally assigned by annotators to data by a few annotators.", 
        "36": "This is the case since in the lab-condition method annotators need to infer the writers emotions from text, which may not be accurate.", 
        "37": "Additionally, (Volkova and Bachrach, 2016) follow the same distant supervision approach and find correlations of users’ emotional tone and the perceived demographics of these users’ social networks exploiting the emotion hashtag-labeled data.", 
        "38": "Our dataset is more than an order of magnitude larger than (Mohammad, 2012) and (Volkova and Bachrach, 2016) and the range of emotions we target is much more fine grained than (Mohammad, 2012; Wang et al., 2012; Volkova and Bachrach, 2016) since we model 24 emotion types, rather than focus on ≤ 7 basic emotions.", 
        "39": "(Yan et al., 2016; Yan and Turtle, 2016a,b) develop a dataset of 15,553 tweets labeled with 28 emotion types and so target a fine-grained range as we do.", 
        "40": "The authors instruct human annotators under lab conditions to assign any emotion they feel is expressed in the data, allowing them to assign more than one emotion to a given tweet.", 
        "41": "A set of 28 chosen emotions was then decided upon and further annotations were performed using Amazon Mechanical Turk (AMT).", 
        "42": "The authors cite an agreement of 0.50 Krippendorff’s alpha (α) between the lab/expert annotators, and an (α) of 0.28 between experts and AMT workers.", 
        "43": "EmoTweet-\n28 is a useful resource.", 
        "44": "However, the agreement between annotators is not high and the set of assigned labels do not adhere to a specific theory of emotion.", 
        "45": "We use a much larger dataset and report an accuracy of the hashtag approach at 90% based on human judgement as reported in Section 4.", 
        "46": "2.2 Mood  A number of studies have also been performed to analyze and/or model mood in social media data.", 
        "47": "(De Choudhury et al., 2012) identify more than 200 moods frequent on Twitter as extracted from psychological literature and filtered by AMT workers.", 
        "48": "They then collect tweets which have one of the moods in their mood lexicon in the form of a hashtag.", 
        "49": "To verify the quality of the mood data, the authors run AMT studies where they ask workers whether a tweet displayed the respective mood hashtag or not and find that in 83% of the cases hashtagged moods at the end of posts did capture users’ moods, whereas for posts with mood hashtags anywhere in the tweet, only 58% of the cases capture the mood of users.", 
        "50": "Although they did not build models for mood detection, the annotation studies (De Choudhury et al., 2012) perform further support our specific use of hashtags to label emotions.", 
        "51": "(Mishne and De Rijke, 2006) collect user-labeled mood from blog post text on LiveJournal and exploit them for predicting the intensity of moods over a time span rather than at the post level.", 
        "52": "Similarly, (Nguyen, 2010) builds models to infer patterns of moods in a large collection of LiveJournal posts.", 
        "53": "Some of the moods in these LiveJournal studies (e.g., hungry, cold), as (De Choudhury et al., 2012) explain, would not fit any psychological theory.", 
        "54": "Our work is different in that it is situated in psychological theory of emotion.", 
        "55": "2.3 Deep Learning for NLP  In spite of the effectiveness of feature engineering for NLP, it is a labor intensive task that also needs domain expertise.", 
        "56": "More importantly, feature engineering falls short of extracting and organizing all the discriminative information from data (LeCun et al., 2015; Goodfellow et al., 2016).", 
        "57": "Neural networks (Goodfellow et al., 2016) have emerged as a successful class of methods that has the power of automatically discovering the representations needed for detection or classification and has been successfully applied to multiple NLP tasks.", 
        "58": "A line of studies in the literature (e.g., (Labutov and Lip-\nson, 2013; Maas et al., 2011; Tang et al., 2014b,a) aim to learn sentiment-specific word embeddings (Bengio et al., 2003; Mikolov et al., 2013) from neighboring text.", 
        "59": "Another thread of research focuses on learning semantic composition (Mitchell and Lapata, 2010), including extensions to phrases and sentences with recursive neural networks (a class of syntax-tree models) (Socher et al., 2013; Irsoy and Cardie, 2014; Li et al., 2015) and to documents with distributed representations of sentences and paragraphs (Le and Mikolov, 2014; Tang et al., 2015) for modeling sentiment.", 
        "60": "Long-short term memory (LSTM) (Hochreiter and Schmidhuber, 1997) and Gated Recurrent Neural Nets (GRNNs) (Cho et al., 2014; Chung et al., 2015), variations of recurrent neural networks (RNNs), a type of networks suitable for handling time-series data like speech (Graves et al., 2013) or handwriting recognition (Graves, 2012; Graves and Schmidhuber, 2009), have also been used successfully for sentiment analysis (Ren et al., 2016; Liu et al., 2015; Tai et al., 2015; Tang et al., 2015; Zhang et al., 2016).", 
        "61": "Convolutional neural networks (CNNs) have also been quite successful in NLP, and have been applied to a range of sentence classification tasks, including sentiment analysis (Blunsom et al., 2014; Kim, 2014; Zhang et al., 2015).", 
        "62": "Other architectures have also been recently proposed (e.g., (Bradbury et al., 2016)).", 
        "63": "A review of neural network methods for NLP can be found in (Goldberg, 2016).", 
        "64": "3 Data    3.1 Collection of a Large-Scale Dataset  To be able to use deep learning for modeling emotion, we needed a large dataset of labeled tweets.", 
        "65": "Since there is no such human-labeled dataset publicly available, we follow (Mohammad, 2012; Mintz et al., 2009; Purver and Battersby, 2012; González-Ibánez et al., 2011; Wang et al., 2012) in adopting distant supervision: We collect tweets with emotion-carrying hashtags as a surrogate for emotion labels.", 
        "66": "To be able to collect enough tweets to serve our need, we developed a list of hashtags representing each of the 24 emotions proposed by Robert Plutchick (Plutchik, 1980, 1985, 1994).", 
        "67": "Plutchik (Plutchik, 2001) organizes emotions in a three-dimensional circumplex model analogous to the colors on a color wheel.", 
        "68": "The cone’s vertical dimension represents intensity, and the 3 circle represent degrees of similarity\namong the various emotion types.", 
        "69": "The eight sectors are meant to capture that there are eight primary emotion dimensions arranged as four pairs of opposites.", 
        "70": "Emotions in the blank spaces are the primary emotion dyads (i.e., emotions that are mixtures of two of the primary emotions).", 
        "71": "For this work, we exclude the dyads in the exploded model from our treatment.", 
        "72": "For simplicity, we refer to the circles as plutchik-1: with the emotions {admiration, amazement, ecstasy, grief, loathing, rage, terror, vigilance}, plutchik-2: with the emotions {joy, trust, fear, surprise, sadness, disgust, anger, anticipation}, and plutchik-3: with the emotions {acceptance, annoyance, apprehension, boredom, distraction, interest, pensiveness, serenity}.", 
        "73": "The wheel is shown in Figure 1.", 
        "74": "For each emotion type, we prepared a seed set of hashtags representing the emotion.", 
        "75": "We used Google synonyms and other online dictionaries and thesauri (e.g., www.thesaurus.", 
        "76": "com) to expand the initial seed set of each emotion.", 
        "77": "We acquire a total of 665 emotion hashtags across the 24 emotion types.", 
        "78": "For example, for the joy emotion, a subset of the seeds in our expanded set is {“happy”, “happiness”, “joy”, “joyful”, “joyfully”, “delighted”, “feelingsunny”, “blithe”, “beatific”, “exhilarated”, “blissful”, “walkingonair”, “jubilant”}.", 
        "79": "We then used the expanded set to extract tweets with hashtags from the set from a number of massive-scale in-house Twitter datasets.", 
        "80": "We also used Twitter API to crawl Twitter with hashtags from the expanded set.", 
        "81": "Using this method, we were able to acquire a dataset of about 1/4 billion tweets covering an extended time span from July 2009 till January 2017.", 
        "82": "3.2 Preprocessing and Quality Assurance  Twitter data are very noisy, not only because of use of non-standard typography (which is less of a problem here) but due to the many duplicate tweets and the fact that tweets often have multiple emotion hashtags.", 
        "83": "Since these reduce our ability to build accurate models, we need to clean the data and remove duplicates.", 
        "84": "Starting with > 1/4 billion tweets, we employ a rigorous and strict pipeline.", 
        "85": "This results in a vastly smaller set of about 1.6 million dependable labeled tweets.", 
        "86": "Since our goal is to create non-overlapping categories at the level of a tweet, we first removed all tweets with hashtags belonging to more than one emotion of the 24 emotion categories.", 
        "87": "Since it was observed (e.g., (Mohammad, 2012; Wang et al., 2012)) and also confirmed by our annotation study as described in Section 4, that hashtags in tweets with URLs are less likely to correlate with a true emotion label, we remove all tweets with URLs from our data.", 
        "88": "We filter out duplicates using a two-step procedure: 1) we remove all retweets (based on existence of the token “RT” regardless of case) and 2) we use the Python library pandas http://pandas.", 
        "89": "pydata.org/ “drop duplicates” method to compare the tweet texts of all the tweets after normalizing character repetitions [all consecutive characters of > 2 to 2] and user mentions (as detected by a string starting with an “@” sign).", 
        "90": "We then performed a manual inspection of a random sample of 1,000 tweets from the data and found no evidence of any remaining tweet duplicates.", 
        "91": "Next, even though the emotion hashtags themselves are exclusively in English, we observe the data do have tweets in languages other than English.", 
        "92": "This is due to code-switching, but also to the fact that our data dates back to 2009 and Twitter did not allow use of hashtags for several non-English languages until 2012.", 
        "93": "To filter out non-English, we use the langid (Lui and Baldwin, 2012) (https://github.com/ saffsd/langid.py) library to assign language tags to the tweets.", 
        "94": "Since the common wisdom in the literature (e.g., (Mohammad, 2012; Wang et al., 2012)) is to restrict data to hashtags occurring in final position of a tweet, we investigate correlations between a tweet’s relevance and emotion hashtag location in Section 4 and test models exclusively on data with hashtags occurring in final position.", 
        "95": "We also only use tweets con-\ntaining at least 5 words.", 
        "96": "Table 2 shows statistics of the data after applying our cleaning, filtering, language identification, and deduplication pipeline.", 
        "97": "Since our focus is on English, we only show statistics for tweets tagged with an “en” (for “English”) label by langid.", 
        "98": "Table 2 provides three types of relevant statistics: 1) counts of all tweets, 2) counts of tweets with at least 5 words and the emotion hashtags occurring in the last quarter of the tweet text (based on character count), and 3) counts of tweets with at least 5 words and the emotion hashtags occurring as the final word in the tweet text.", 
        "99": "As the last column in Table 2 shows, employing our most strict criterion where an emotion hashtag must occur finally in a tweet of a minimal length 5 words, we acquire a total of 1,608,233 tweets: 205,125 tweets for plutchik-1, 790,059 for plutchik-2, and 613,049 for plutchik-3.", 
        "100": "2  4 Annotation Study  In their work, (Wang et al., 2012) manually label a random sample of 400 tweets extracted with hash-\n2The data can be acquired by emailing the first author.", 
        "101": "The distribution is in the form of tweet ids and labels, to adhere to Twitter conditions.", 
        "102": "tags in a similar way as we acquire our data and find that human annotators agree 93% of the time with the hashtag emotion type if the hashtag occurs as the last word in the tweet.", 
        "103": "We wanted to validate our use of hashtags in a similar fashion and on a bigger random sample.", 
        "104": "We had human annotators label a random sample of 5,600 tweets that satisfy our preprocessing pipeline.", 
        "105": "Manual inspection during annotation resulted in further removing a negligible 16 tweets that were found to have problems.", 
        "106": "For each of the remaining 5,584 tweets, the annotators assign a binary tag from the set {relevant, irrelevant} to indicate whether a tweet carries an emotion category as assigned using our distant supervision method or not.", 
        "107": "Annotators assigned 61.37% (n = 3, 427) “relevant” tags and 38.63% (n = 2, 157) “irrelevant” tags.", 
        "108": "Our analysis of this manually labeled dataset also supports the findings of (Wang et al., 2012): When we limit position of the emotion hashtag to the end of a tweet, we acquire 90.57% relevant data.", 
        "109": "We also find that if we relax the constraint on the hashtag position such that we allow the hashtag to occur in the last quarter of a tweet (based on a total tweet character count), we acquire 85.43% relevant tweets.", 
        "110": "We also find that only 23.20% (n = 795 out of 3, 427) of the emotion carrying tweets have the emotion hashtags occurring in final position, whereas 31.75% (n = 1, 088 out of 3, 427) of the tweets have the emotion hashtags in the last quarter of the tweet string.", 
        "111": "This shows how enforcing a final hashtag location results in loss of a considerable number of emotion tweets.", 
        "112": "As shown in Table 2, only 1, 608, 233 tweets out of a total of 6, 851, 955 tweets (% = 23, 47) in our bigger dataset have emotion hashtags occurring in final position.", 
        "113": "Overall, we agree with (Mohammad, 2012; Wang et al., 2012) that the accuracy acquired by enforcing a strict pipeline and limiting to emotion hashtags to final position is a reasonable measure for warranting good-quality data for training supervised systems, an assumption we have also validated with our empirical findings here.", 
        "114": "One advantage of using distant supervision under these conditions for labeling emotion data, as (Wang et al., 2012) also notes, is that the label is assigned by the writer of the tweet himself/herself rather than an annotator who could wrongly decide what category a tweet is.", 
        "115": "After all, emotion is a fuzzy concept and > 90% agreement as we\nreport here is higher than the human agreement usually acquired on many NLP tasks.", 
        "116": "Another advantage of this method is obviously that it enables us to acquire a sufficiently large training set to use deep learning.", 
        "117": "We now turn to describing our deep learning methods.", 
        "118": "5 Methods  For our core modeling, we use Gated Recurrent Neural Networks (GRNNs), a modern variation of recurrent neural networks (RNNs), which we now turn to introduce.", 
        "119": "For notation, we denote scalars with italic lowercase (e.g., x), vectors with bold lowercase (e.g.,x), and matrices with bold uppercase (e.g.,W).", 
        "120": "Recurrent Neural Network A recurrent neural network (RNN) is one type of neural network architecture that is particularly suited for modeling sequential information.", 
        "121": "At each time step t, an RNN takes an input vector xt IRn and a hidden state vector h t−1 IRm and produces the next hidden state h t by applying the recursive operation:\nht = f (Wxt + Uht−1 + b) (1)\nWhere the input to hidden matrix W IRmxn, the hidden to hidden matrix U IRmxm, and the bias vector b IRm are parameters of an affine transformation and f is an element-wise nonlinearity.", 
        "122": "While an RNN can in theory summarize all historical information up to time step ht, in practice it runs into the problem of vanishing/exploding gradients (Bengio et al., 1994; Pascanu et al., 2013) while attempting to learn longrange dependencies.", 
        "123": "LSTM Long short-term memory (LSTM) networks (Hochreiter and Schmidhuber, 1997) addresses this exact problem of learning long-term dependencies by augmenting an RNN with a memory cell ct IRn at each time step.", 
        "124": "As such, in addition to the input vector xt, the hiddent vector ht−1, an LSTM takes a cell state vector ct−1 and produces ht and ct via the following calculations:\nit = σ ( Wixt + Uiht−1 + bi ) ft = σ ( Wfxt + Ufht−1 + bf )\not = σ (Woxt + Uoht−1 + bo) gt = tanh (W\ngxt + Ught−1 + bg) ct = ft ct−1 + it gt ht = ot tanh(ct)\n(2)\nWhere σ(·) and tanh(·) are the element-wise sigmoid and hyperbolic tangent functions, the element-wise multiplication operator, and it, ft, ot are the input, forget, and output gates.", 
        "125": "The gt is a new memory cell vector with candidates that could be added to the state.", 
        "126": "The LSTM parameters Wj , Uj , and bj are for j {i, f, o, g}.", 
        "127": "GRNNs (Cho et al., 2014; Chung et al., 2015) propose a variation of LSTM with a reset gate rt, an update state zt, and a new simpler hidden unit ht, as follows:\nrt = σ (Wrxt + Urht−1 + br) zt = σ (Wzxt + Uzht−1 + bz) h̃t = tanh ( Wxt + rt ∗ Uh̃ht−1 + bh̃ )\nht = zt ∗ ht−1 + (1− zt) ∗ h̃t\n(3)\nThe GRNN parameters Wj , Uj , and bj are for j {r, z, h̃}.", 
        "128": "In this set up, the hidden state is forced to ignore a previous hidden state when the reset gate is close to 0, thus enabling the network to forget or drop irrelevant information.", 
        "129": "Additionally, the update gate controls how much information carries over from a previous hidden state to the current hidden state (similar to an LSTM memory cell).", 
        "130": "We use GRNNs as they are simpler and faster than LSTM.", 
        "131": "For GRNNs, we use Theano (Theano Development Team, 2016).", 
        "132": "Online Classifiers We compare the performance of the GRNNs to four online classifiers that are capable of handling the data size: Stochastic Gradient Descent (SGD), Multinomial Naive Bayes (MNB), Perceptron, and the Passive Agressive Classifier (PAC).", 
        "133": "These classifiers learn online from mini-batches of data.", 
        "134": "We use minibatches of 10,000 instances with all the four classifiers.", 
        "135": "We use the scikit-learn implementation of these classifiers (http://scikit-learn.", 
        "136": "org).", 
        "137": "Settings We aim to model Plutchik’s 24 finegrained emotions as well as his 8 primary emotion dimensions where each 3 related types of emotion (perceived as varying in intensity) are combined in one dimension.", 
        "138": "We now turn to describing our experiments experiments.", 
        "139": "6 Experiments    6.1 Predicting Fine-Grained Emotions  As explained earlier, Plutchik organizes the 24 emotion types in the 3 main circles that we will refer to as plutchik-1, plutchik-2, and plutchik-3.", 
        "140": "We model the set of emotions belonging to each of the 3 circles independently, thus casting each as an 8-way classification task.", 
        "141": "Inspired by observations from the literature and our own annotation study, we limit our data to tweets of at least 5 words with an emotional hashtag occurring at the end.", 
        "142": "We then split the data representing each of the 3 circles into 80% training (TRAIN), 10% development (DEV), and 10% testing (TEST).", 
        "143": "As mentioned above, we run experiments with a range of online, out-of-core classifiers as well as the\nGRNNs.", 
        "144": "To train the GRNNs, we optimize the hyper-parameters of the network on a development set as we describe below, choosing a vocabulary size of 80K words (a vocabulary size we also use for the out-of-core classifiers), a word embedding vector of size 300 dimensions learnt directly from the training data, an input maximum length of 30 words, 7 epochs, and the Adam (Kingma and Ba, 2014) optimizer with a learning rate of 0.001.", 
        "145": "We use 3 dense layers each with 1, 000 units.", 
        "146": "We use dropout (Hinton et al., 2012) for regularization, with a dropout rate of 0.5.", 
        "147": "For our loss function, we use categorical cross-entropy.", 
        "148": "We use a minibatch (Cotter et al., 2011) size of 128.", 
        "149": "We found this architecture to work best with almost all the settings and so we fix it across the board for all experiments with GRNNs.", 
        "150": "Results with Traditional Classifiers Results with the online classifiers are presented in terms of F-score in Table 3.", 
        "151": "As the table shows, among this group of classifiers, the Passive Agressive classifier (PAC) acquires the best performance.", 
        "152": "PAC achieves an overall F-score of 64.86% on plutchik-1, 53.30% on plutchik-2, and 68.14% on plutchik-3, two of which are higher than an arbitrary baseline3 of 60%.", 
        "153": "Results with GRNNs Table 4 presents results with GRNNs, compared with the best results using the traditional classifiers as acquired with PAC.", 
        "154": "As the table shows, the GRNN models are very successful across all the 3 classification tasks.", 
        "155": "With GRNNs, we acquire an overall F-scores of: 91.21% on plutchik-1, 82.32% on plutchik-2, and 87.47% on plutchik-3.", 
        "156": "These results are 26.35%, 29.02%, and 25.37% higher than PAC, respectively.", 
        "157": "Negative Results We experiment with aug3The arbitrary baseline is higher than the majority class in\nthe training data in any of the 3 cases.", 
        "158": "menting training data reported here in two ways: 1) For each emotion type, we concatenate the training data with training data of tweets that are more (or less) intense from the same sector/dimension in the wheel, and 2) for each emotion type, we add tweets where emotion hashtags occur in the last quarter of a tweet (which were originally filtered out from TRAIN).", 
        "159": "However, we gain no improvements based on either of these methods, thus reflecting the importance of using high-quality training data and the utility of our strict pipeline.", 
        "160": "6.2 Predicting 8 Primary Dimensions  We now investigate the task of predicting each of the 8 primary emotion dimensions represented by the sectors of the wheel (where the three degrees of intensity of a given emotion are reduced to a single emotion dimension [e.g., {ecstasy, joy, serenity} are reduced to the joy dimension]).", 
        "161": "We concatenate the 80% training data (TRAIN) from each of the 3 circles’ data into a single training set\n(TRAIN-ALL), the 10% DEV to form DEV-ALL, and the 10% TEST to form TEST-ALL.", 
        "162": "We test a number of hyper-parameters on DEV and find the ones we have identified on the fine-grained prediction to work best and so we adopt them as is with the exception of limiting to only 2 epochs.", 
        "163": "We believe that with a wider exploration of hyperparameters, improvements could be possible.", 
        "164": "As Table 5 shows, we are able to model the 8 dimensions with an overall superior accuracy of 95.68%.", 
        "165": "As far as we know, this is the first work on modeling these dimensions.", 
        "166": "7 Comparisons to Other Systems  We compare our results on the 8 basic emotions to the published literature.", 
        "167": "As Table 6 shows, on this subset of emotions, our system is 4.53% (acc) higher than the best published results (Volkova and Bachrach, 2016), facilitated by the fact that we have an order of magnitude more training data.", 
        "168": "As shown in Table 7, we also apply (Volkova and Bachrach, 2016)’s pre-trained model on our test set of the 6 emotions they predict (which belong to plutchik-2), and acquire an overall accuracy of 26.95%, which is significantly lower than our accuracy.", 
        "169": "8 Conclusion  In this paper, we built a large, automatically curated dataset for emotion detection using distant supervision and then used GRNNs to model finegrained emotion, achieving a new state-of-the-art performance.", 
        "170": "We also extended the classification to 8 primary emotion dimensions situated in psychological theory of emotion."
    }, 
    "document_id": "P17-1067.pdf.json"
}
