{
    "abstract_sentences": {
        "1": "Parsing sentences to linguisticallyexpressive semantic representations is a key goal of Natural Language Processing.", 
        "2": "Yet statistical parsing has focussed almost exclusively on bilexical dependencies or domain-specific logical forms.", 
        "3": "We propose a neural encoder-decoder transition-based parser which is the first full-coverage semantic graph parser for Minimal Recursion Semantics (MRS).", 
        "4": "The model architecture uses stack-based embedding features, predicting graphs jointly with unlexicalized predicates and their token alignments.", 
        "5": "Our parser is more accurate than attention-based baselines on MRS, and on an additional Abstract Meaning Representation (AMR) benchmark, and GPU batch processing makes it an order of magnitude faster than a high-precision grammar-based parser.", 
        "6": "Further, the 86.69% Smatch score of our MRS parser is higher than the upper-bound on AMR parsing, making MRS an attractive choice as a semantic representation."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1215–1226 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1112\nRobust Incremental Neural Semantic Graph Parsing\nJan Buys1 and Phil Blunsom1,2 1Department of Computer Science, University of Oxford 2DeepMind\n{jan.buys,phil.blunsom}@cs.ox.ac.uk\nAbstract\nParsing sentences to linguisticallyexpressive semantic representations is a key goal of Natural Language Processing.", 
        "2": "Yet statistical parsing has focussed almost exclusively on bilexical dependencies or domain-specific logical forms.", 
        "3": "We propose a neural encoder-decoder transition-based parser which is the first full-coverage semantic graph parser for Minimal Recursion Semantics (MRS).", 
        "4": "The model architecture uses stack-based embedding features, predicting graphs jointly with unlexicalized predicates and their token alignments.", 
        "5": "Our parser is more accurate than attention-based baselines on MRS, and on an additional Abstract Meaning Representation (AMR) benchmark, and GPU batch processing makes it an order of magnitude faster than a high-precision grammar-based parser.", 
        "6": "Further, the 86.69% Smatch score of our MRS parser is higher than the upper-bound on AMR parsing, making MRS an attractive choice as a semantic representation.", 
        "7": "1 Introduction  An important goal of Natural Language Understanding (NLU) is to parse sentences to structured, interpretable meaning representations that can be used for query execution, inference and reasoning.", 
        "8": "Recently end-to-end models have outperformed traditional pipeline approaches, predicting syntactic or semantic structure as intermediate steps, on NLU tasks such as sentiment analysis and semantic relatedness (Le and Mikolov, 2014; Kiros et al., 2015), question answering (Hermann et al., 2015) and textual entailment (Rocktäschel et al., 2015).", 
        "9": "However the linguistic structure used in applications has predominantly been shallow, restricted to bilexical dependencies or trees.", 
        "10": "In this paper we focus on robust parsing into linguistically deep representations.", 
        "11": "The main representation that we use is Minimal Recursion Semantics (MRS) (Copestake et al., 1995, 2005), which serves as the semantic representation of the English Resource Grammar (ERG) (Flickinger, 2000).", 
        "12": "Existing parsers for full MRS (as opposed to bilexical semantic graphs derived from, but simplifying MRS) are grammar-based, performing disambiguation with a maximum entropy model (Toutanova et al., 2005; Zhang et al., 2007); this approach has high precision but incomplete coverage.", 
        "13": "Our main contribution is to develop a fast and robust parser for full MRS-based semantic graphs.", 
        "14": "We exploit the power of global conditioning enabled by deep learning to predict linguistically deep graphs incrementally.", 
        "15": "The model does not have access to the underlying ERG or syntactic structures from which the MRS analyses were originally derived.", 
        "16": "We develop parsers for two graph-based conversions of MRS, Elementary Dependency Structure (EDS) (Oepen and Lønning, 2006) and Dependency MRS (DMRS) (Copestake, 2009), of which the latter is inter-convertible with MRS.\nAbstract Meaning Representation (AMR) (Banarescu et al., 2013) is a graph-based semantic representation that shares the goals of MRS. Aside from differences in the choice of which linguistic phenomena are annotated, MRS is a compositional representation explicitly coupled with the syntactic structure of the sentence, while AMR does not assume compositionality or alignment with the sentence structure.", 
        "17": "Recently a number of AMR parsers have been developed (Flanigan et al., 2014; Wang et al., 2015b; Artzi et al., 2015;\n1215\nDamonte et al., 2017), but corpora are still under active development and low inter-annotator agreement places on upper bound of 83% F1 on expected parser performance (Banarescu et al., 2013).", 
        "18": "We apply our model to AMR parsing by introducing structure that is present explicitly in MRS but not in AMR (Buys and Blunsom, 2017).", 
        "19": "Parsers based on RNNs have achieved state-ofthe-art performance for dependency parsing (Dyer et al., 2015; Kiperwasser and Goldberg, 2016) and constituency parsing (Vinyals et al., 2015b; Dyer et al., 2016; Cross and Huang, 2016b).", 
        "20": "One of the main reasons for the prevalence of bilexical dependencies and tree-based representations is that they can be parsed with efficient and wellunderstood algorithms.", 
        "21": "However, one of the key advantages of deep learning is the ability to make predictions conditioned on unbounded contexts encoded with RNNs; this enables us to predict more complex structures without increasing algorithmic complexity.", 
        "22": "In this paper we show how to perform linguistically deep parsing with RNNs.", 
        "23": "Our parser is based on a transition system for semantic graphs.", 
        "24": "However, instead of generating arcs over an ordered, fixed set of nodes (the words in the sentence), we generate the nodes and their alignments jointly with the transition actions.", 
        "25": "We use a graph-based variant of the arc-eager transition-system.", 
        "26": "The sentence is encoded with a bidirectional RNN.", 
        "27": "The transition sequence, seen as a graph linearization, can be predicted with any encoder-decoder model, but we show that using hard attention, predicting the alignments with a pointer network and conditioning explicitly on stack-based features improves performance.", 
        "28": "In order to deal with data sparsity candidate lemmas are predicted as a pre-processing step, so that the RNN decoder predicts unlexicalized node labels.", 
        "29": "We evaluate our parser on DMRS, EDS and AMR graphs.", 
        "30": "We show that our model architecture improves performance from 79.68% to 84.16% F1 over an attention-based encoderdecoder baseline.", 
        "31": "Although our parser is less accurate that a high-precision grammar-based parser on a test set of sentences parsable by that grammar, incremental prediction and GPU batch processing enables it to parse 529 tokens per second, against 7 tokens per second for the grammarbased parser.", 
        "32": "On AMR parsing our model obtains 60.11% Smatch, an improvement of 8% over an existing neural AMR parser.", 
        "33": "2 Meaning Representations  We define a common framework for semantic graphs in which we can place both MRSbased graph representations (DMRS and EDS) and AMR.", 
        "34": "Sentence meaning is represented with rooted, labelled, connected, directed graphs (Kuhlmann and Oepen, 2016).", 
        "35": "An example graph is visualized in Figure 1. representations.", 
        "36": "Node labels are referred to as predicates (concepts in AMR) and edge labels as arguments (AMR relations).", 
        "37": "In addition constants, a special type of node modifiers, are used to denote the string values of named entities and numbers (including date and time expressions).", 
        "38": "Every node is aligned to a token or a continuous span of tokens in the sentence the graph corresponds to.", 
        "39": "Minimal Recursion Semantics (MRS) is a framework for computational semantics that can be used for parsing or generation (Copestake et al., 2005).", 
        "40": "Instances and eventualities are represented with logical variables.", 
        "41": "Predicates take arguments with labels from a small, fixed set of roles.", 
        "42": "Arguments are either logical variables or handles, designated formalism-internal variables.", 
        "43": "Handle equality constraints support scope underspecification; multiple scope-resolved logical representations can be derived from one MRS structure.", 
        "44": "A predicate corresponds to its intrinsic argument\nand is aligned to a character span of the (untokenized) input sentence.", 
        "45": "Predicates representing named entities or numbers are parameterized by strings.", 
        "46": "Quantification is expressed through predicates that bound instance variables, rather than through logical operators such as ∃ or ∀.", 
        "47": "MRS was designed to be integrated with feature-based grammars such as Head-driven Phrase Structure Grammar (HPSG) (Pollard and Sag, 1994) or Lexical Functional Grammar (LFG) (Kaplan and Bresnan, 1982).", 
        "48": "MRS has been implement the English Resource Grammar (ERG) (Flickinger, 2000), a broad-coverage high-precision HPSG grammar.", 
        "49": "Oepen and Lønning (2006) proposed Elementary Dependency Structure (EDS), a conversion of MRS to variable-free dependency graphs which drops scope underspecification.", 
        "50": "Copestake (2009) extended this conversion to avoid information loss, primarily through richer edge labels.", 
        "51": "The resulting representation, Dependency MRS (DMRS), can be converted back to the original MRS, or used directly in MRS-based applications (Copestake et al., 2016).", 
        "52": "We are interested in the empirical performance of parsers for both of these representations: while EDS is more interpretable as an independent semantic graph representation, DMRS can be related back to underspecified logical forms.", 
        "53": "A bilexical simplification of EDS has previously been used for semantic dependency parsing (Oepen et al., 2014, 2015).", 
        "54": "Figure 1 illustrates an EDS graph.", 
        "55": "MRS makes an explicit distinction between surface and abstract predicates (by convention surface predicates are prefixed by an underscore).", 
        "56": "Surface predicates consist of a lemma followed by a coarse part-of-speech tag and an optional sense label.", 
        "57": "Predicates absent from the ERG lexicon are represented by their surface forms and POS tags.", 
        "58": "We convert the character-level predicate spans given by MRS to token-level spans for parsing purposes, but the representation does not require gold tokenization.", 
        "59": "Surface predicates usually align with the span of the token(s) they represent, while abstract predicates can span longer segments.", 
        "60": "In full MRS every predicate is annotated with a set of morphosyntactic features, encoding for example tense, aspect and number information; we do not currently model these features.", 
        "61": "AMR (Banarescu et al., 2013) graphs can be represented in the same framework, despite a number of linguistic differences with MRS.", 
        "62": "Some in-\n:root( <2> _v_1 :ARG1( <1> person :BV-of( <1> every_q ) )\nformation annotated explicitly in MRS is latent in AMR, including alignments and the distinction between surface (lexical) and abstract concepts.", 
        "63": "AMR predicates are based on PropBank (Palmer et al., 2005), annotated as lemmas plus sense labels, but they form only a subset of concepts.", 
        "64": "Other concepts are either English words or special keywords, corresponding to overt lexemes in some cases but not others.", 
        "65": "3 Incremental Graph Parsing  We parse sentences to their meaning representations by incrementally predicting semantic graphs together with their alignments.", 
        "66": "Let e = e1, e2, .", 
        "67": ".", 
        "68": ".", 
        "69": ", eI be a tokenized English sentence, t = t1, t2, .", 
        "70": ".", 
        "71": ".", 
        "72": ", tJ a sequential representation of its graph derivation and a = a1, a2, .", 
        "73": ".", 
        "74": ".", 
        "75": ", aJ an alignment sequence consisting of integers in the range 1, .", 
        "76": ".", 
        "77": ".", 
        "78": ", I .", 
        "79": "We model the conditional distribution p(t,a|e) which decomposes as\nJ∏\nj=1\np(aj |(a, t)1:j−1, e)p(tj |a1:j , t1:j−1, e).", 
        "80": "We also predict the end-of-span alignments as a seperate sequence a(e).", 
        "81": "3.1 Top-down linearization  We now consider how to linearize the semantic graphs, before defining the neural models to parameterize the parser in section 4.", 
        "82": "The first approach is to linearize a graph as the pre-order traversal of its spanning tree, starting at a designated root node (see Figure 2).", 
        "83": "Variants of this approach have been proposed for neural constituency parsing (Vinyals et al., 2015b), logical form prediction (Dong and Lapata, 2016; Jia and Liang, 2016) and AMR parsing (Barzdins and Gosko, 2016; Peng et al., 2017).", 
        "84": "In the linearization, labels of edges whose direction are reversed in the spanning tree are marked\nby adding -of.", 
        "85": "Edges not included in the spanning tree, referred to as reentrancies, are represented with special edges whose dependents are dummy nodes pointing back to the original nodes.", 
        "86": "Our potentially lossy representation represents these edges by repeating the dependent node labels and alignments, which are recovered heuristically.", 
        "87": "The alignment does not influence the linearized node ordering.", 
        "88": "3.2 Transition-based parsing  Figure 1 shows that the semantic graphs we work with can also be interpreted as dependency graphs, as nodes are aligned to sentence tokens.", 
        "89": "Transition-based parsing (Nivre, 2008) has been used extensively to predict dependency graphs incrementally.", 
        "90": "We apply a variant of the arc-eager transition system that has been proposed for graph (as opposed to tree) parsing (Sagae and Tsujii, 2008; Titov et al., 2009; Gómez-Rodrı́guez and Nivre, 2010) to derive a transition-based parser for deep semantic graphs.", 
        "91": "In dependency parsing the sentence tokens also act as nodes in the graph, but here we need to generate the nodes incrementally as the transition-system proceeds, conditioning the generation on the given sentence.", 
        "92": "Damonte et al.", 
        "93": "(2017) proposed an arc-eager AMR parser, but their transition system is more narrowly restricted to AMR graphs.", 
        "94": "The transition system consists of a stack of graph nodes being processed and a buffer, holding a single node at a time.", 
        "95": "The main transition actions are shift, reduce, left-arc, right-arc.", 
        "96": "Figure 3 shows an example transition sequence together with the stack and buffer after each step.", 
        "97": "The shift transition moves the element on the buffer to the top of the stack, and generates a predicate and its alignment as the next node on the buffer.", 
        "98": "Left-arc and right-arc actions add labeled arcs between the buffer and stack top (for DMRS a transition for undirected arcs is included), but do not change the state of the stack or buffer.", 
        "99": "Finally, reduce pops the top element from the stack, and predicts its end-ofspan alignment (if included in the representation).", 
        "100": "To predict non-planar arcs, we add another transition, which we call cross-arc, which first predicts the stack index of a node which is not on top of the stack, adding an arc between the head of the buffer and that node.", 
        "101": "Another special transition designates the buffer node as the root.", 
        "102": "To derive an oracle for this transition system,\nit is necessary to determine the order in which the nodes are generated.", 
        "103": "We consider two approaches.", 
        "104": "The first ordering is obtained by performing an in-order traversal of the spanning tree, where the node order is determined by the alignment.", 
        "105": "In the resulting linearization the only non-planar arcs are reentrancies.", 
        "106": "The second approach lets the ordering be monotone (non-decreasing) with respect to the alignments, while respecting the in-order ordering for nodes with the same alignment.", 
        "107": "In an arc-eager oracle arcs are added greedily, while a reduce action can either be performed as soon as the stack top node has been connected to all its dependents, or delayed until it has to reduce to allow the correct parse tree to be formed.", 
        "108": "In our model the oracle delays reduce, where possible, until the end alignment of the stack top node spans the node on the buffer.", 
        "109": "As the span end alignments often cover phrases that they head (e.g.", 
        "110": "for quantifiers) this gives a natural interpretation to predicting the span end together with the reduce action.", 
        "111": "3.3 Delexicalization and lemma prediction  Each token in MRS annotations is aligned to at most one surface predicate.", 
        "112": "We decompose surface predicate prediction by predicting candidate lemmas for input tokens, and delexicalized predicates consisting only of sense labels.", 
        "113": "The full surface predicates are then recovered through the predicted alignments.", 
        "114": "We extract a dictionary mapping words to lemmas from the ERG lexicon.", 
        "115": "Candidate lemmas are predicted using this dictionary, and where no dictionary entry is available with a lemmatizer.", 
        "116": "The same approach is applied to predict constants, along with additional normalizations such as mapping numbers to digit strings.", 
        "117": "We use the Stanford CoreNLP toolkit (Manning et al., 2014) to tokenize and lemmatize sentences, and tag tokens with the Stanford Named Entity Recognizer (Finkel et al., 2005).", 
        "118": "The tokenization is customized to correspond closely to the ERG tokenization; hyphens are removed pre-processing step.", 
        "119": "For AMR we use automatic alignments and the graph topology to classify concepts as surface or abstract (Buys and Blunsom, 2017).", 
        "120": "The lexicon is restricted to Propbank (Palmer et al., 2005) predicates; for other concepts we extract a lexicon from the training data.", 
        "121": "4 Encoder-Decoder Models    4.1 Sentence encoder  The sentence e is encoded with a bidirectional RNN.", 
        "122": "We use a standard LSTM architecture without peephole connections (Jozefowicz et al., 2015).", 
        "123": "For every token e we embed its word, POS tag and named entity (NE) tag as vectors xw, xt and xn, respectively.", 
        "124": "The embeddings are concatenated and passed through a linear transformation\ng(e) =W (x)[xw;xt;xn] + b x,\nsuch that g(e) has the same dimension as the LSTM.", 
        "125": "Each input position i is represented by a hidden state hi, which is the concatenation of its forward and backward LSTM state vectors.", 
        "126": "4.2 Hard attention decoder  We model the alignment of graph nodes to sentence tokens, a, as a random variable.", 
        "127": "For the arceager model, aj corresponds to the alignment of the node of the buffer after action tj is executed.", 
        "128": "The distribution of tj is over all transitions and predicates (corresponding to shift transitions), predicted with a single softmax.", 
        "129": "The parser output is predicted by an RNN decoder.", 
        "130": "Let sj be the decoder hidden state at output position j.", 
        "131": "We initialize s0 with the final state of the backward encoder.", 
        "132": "The alignment is predicted with a pointer network (Vinyals et al., 2015a).", 
        "133": "The logits are computed with an MLP scoring the decoder hidden state against each of the encoder hidden states (for i = 1, .", 
        "134": ".", 
        "135": ".", 
        "136": ", I),\nuij = w T tanh(W (1)hi +W (2)sj).", 
        "137": "The alignment distribution is then estimated by\np(aj = i|a1:j−1, t1:j−1, e) = softmax(uij).", 
        "138": "To predict the next transition ti, the output vector is conditioned on the encoder state vector haj , corresponding to the alignment:\noj =W (3)sj +W (4)haj vj = R (d)oj + b (d),\nwhere R(d) and b(d) are the output representation matrix and bias vector, respectively.", 
        "139": "The transition distribution is then given by\np(tj |a1:j , t1:j−1, e) = softmax(vj).", 
        "140": "Let e(t) be the embedding of decoder symbol t. The RNN state at the next time-step is computed as\ndj+1 =W (5)e(tj) +W (6)haj\nsj+1 = RNN(dj+1, sj).", 
        "141": "The end-of-span alignment a(e)j for MRS-based graphs is predicted with another pointer network.", 
        "142": "The end alignment of a token is predicted only when a node is reduced from the stack, therefore this alignment is not observed at each time-step; it is also not fed back into the model.", 
        "143": "The hard attention approach, based on supervised alignments, can be contrasted to soft attention, which learns to attend over the input without supervision.", 
        "144": "The attention is computed as with hard attention, as αij = softmax(u i j).", 
        "145": "However instead of making a hard selection, a weighted average over the encoder vectors is computed as qj = ∑i=I i=1 α i jhi.", 
        "146": "This vector is used instead of haj for prediction and feeding to the next timestep.", 
        "147": "4.3 Stack-based model  We extend the hard attention model to include features based on the transition system stack.", 
        "148": "These features are embeddings from the bidirectional RNN encoder, corresponding to the alignments of the nodes on the buffer and on top of the stack.", 
        "149": "This approach is similar to the features proposed by Kiperwasser and Goldberg (2016) and Cross and Huang (2016a) for dependency parsing, although they do not use RNN decoders.", 
        "150": "To implement these features the layer that computes the output vector is extended to\noj =W (3)sj +W (4)haj +W (7)hst0 ,\nwhere st0 is the sentence alignment index of the element on top of the stack.", 
        "151": "The input layer to the next RNN time-step is similarly extended to\ndj+1 =W (5)e(tj) +W (6)hbuf +W (8)hst0 ,\nwhere buf is the buffer alignment after tj is executed.", 
        "152": "Our implementation of the stack-based model enables batch processing in static computation graphs, similar to Bowman et al.", 
        "153": "(2016).", 
        "154": "We maintain a stack of alignment indexes for each element in the batch, which is updated inside the computation graph after each parsing action.", 
        "155": "This enables minibatch SGD during training as well as efficient batch decoding.", 
        "156": "We perform greedy decoding.", 
        "157": "For the stackbased model we ensure that if the stack is empty, the next transition predicted has to be shift.", 
        "158": "For the other models we ensure that the output is wellformed during post-processing by robustly skipping over out-of-place symbols or inserting missing ones.", 
        "159": "5 Related Work  Prior work for MRS parsing predominantly predicts structures in the context of grammar-based parsing, where sentences are parsed to HPSG derivations consistent with the grammar, in this case the ERG (Flickinger, 2000).", 
        "160": "The nodes in the derivation trees are feature structures, from which MRS is extracted through unification.", 
        "161": "This approach fails to parse sentences for which no valid derivation is found.", 
        "162": "Maximum entropy models are used to score the derivations in order to find the most likely parse (Toutanova et al., 2005).", 
        "163": "This\napproach is implemented in the PET (Callmeier, 2000) and ACE1 parsers.", 
        "164": "There have also been some efforts to develop robust MRS parsers.", 
        "165": "One proposed approach learns a PCFG grammar to approximate the HPSG derivations (Zhang and Krieger, 2011; Zhang et al., 2014).", 
        "166": "MRS is then extracted with robust unification to compose potentially incompatible feature structures, although that still fails for a small proportion of sentences.", 
        "167": "The model is trained on a large corpus of Wikipedia text parsed with the grammar-based parser.", 
        "168": "Ytrestøl (2012) proposed a transition-based approach to HPSG parsing that produces derivations from which both syntactic and semantic (MRS) parses can be extracted.", 
        "169": "The parser has an option not to be restricted by the ERG.", 
        "170": "However, neither of these approaches have results available that can be compared directly to our setup, or generally available implementations.", 
        "171": "Although AMR parsers produce graphs that are similar in structure to MRS-based graphs, most of them make assumptions that are invalid for MRS, and rely on extensive external AMR-specific resources.", 
        "172": "Flanigan et al.", 
        "173": "(2014) proposed a twostage parser that first predicts concepts or subgraphs corresponding to sentence segments, and then parses these concepts into a graph structure.", 
        "174": "However MRS has a large proportion of abstract nodes that cannot be predicted from short segments, and interact closely with the graph structure.", 
        "175": "Wang et al.", 
        "176": "(2015b,a) proposed a custom transition-system for AMR parsing that converts dependency trees to AMR graphs, relying on assumptions on the relationship between these.", 
        "177": "Pust et al.", 
        "178": "(2015) proposed a parser based on syntaxbased machine translation (MT), while AMR has also been integrated into CCG Semantic Parsing (Artzi et al., 2015; Misra and Artzi, 2016).", 
        "179": "Recently Damonte et al.", 
        "180": "(2017) and Peng et al.", 
        "181": "(2017) proposed AMR parsers based on neural networks.", 
        "182": "6 Experiments    6.1 Data  DeepBank (Flickinger et al., 2012) is an HPSG and MRS annotation of the Penn Treebank Wall Street Journal (WSJ) corpus.", 
        "183": "It was developed following an approach known as dynamic treebanking (Oepen et al., 2004) that couples treebank annotation with grammar development, in this case\n1http://sweaglesw.org/linguistics/ace/\nof the ERG.", 
        "184": "This approach has been shown to lead to high inter-annotator agreement: 0.94 against 0.71 for AMR (Bender et al., 2015).", 
        "185": "Parses are only provided for sentences for which the ERG has an analysis acceptable to the annotator – this means that we cannot evaluate parsing accuracy for sentences which the ERG cannot parse (approximately 15% of the original corpus).", 
        "186": "We use Deepbank version 1.1, corresponding to ERG 12142, following the suggested split of sections 0 to 19 as training data data, 20 for development and 21 for testing.", 
        "187": "The gold-annotated training data consists of 35,315 sentences.", 
        "188": "We use the LOGON environment3 and the pyDelphin library4 to extract DMRS and EDS graphs.", 
        "189": "For AMR parsing we use LDC2015E86, the dataset released for the SemEval 2016 AMR parsing Shared Task (May, 2016).", 
        "190": "This data includes newswire, weblog and discussion forum text.", 
        "191": "The training set has 16,144 sentences.", 
        "192": "We obtain alignments using the rule-based JAMR aligner (Flanigan et al., 2014).", 
        "193": "6.2 Evaluation  Dridan and Oepen (2011) proposed an evaluation metric called Elementary Dependency Matching (EDM) for MRS-based graphs.", 
        "194": "EDM computes the F1-score of tuples of predicates and arguments.", 
        "195": "A predicate tuple consists of the label and character span of a predicate, while an argument tuple consists of the character spans of the head and dependent nodes of the relation, together with the argument label.", 
        "196": "In order to tolerate subtle tokenization differences with respect to punctuation, we allow span pairs whose ends differ by one character to be matched.", 
        "197": "The Smatch metric (Cai and Knight, 2013), proposed for evaluating AMR graphs, also measures graph overlap, but does not rely on sentence alignments to determine the correspondences between graph nodes.", 
        "198": "Smatch is instead computed by performing inference over graph alignments to estimate the maximum F1-score obtainable from a one-to-one matching between the predicted and gold graph nodes.", 
        "199": "2http://svn.delph-in.net/erg/tags/ 1214/\n3http://moin.delph-in.net/LogonTop 4https://github.com/delph-in/pydelphin  6.3 Model setup  Our parser5 is implemented in TensorFlow (Abadi et al., 2015).", 
        "200": "For training we use Adam (Kingma and Ba, 2015) with learning rate 0.01 and batchsize 64.", 
        "201": "Gradients norms are clipped to 5.0 (Pascanu et al., 2013).", 
        "202": "We use single-layer LSTMs with dropout of 0.3 (tuned on the development set) on input and output connections.", 
        "203": "We use encoder and decoder embeddings of size 256, and POS and NE tag embeddings of size 32, For DMRS and EDS graphs the hidden units size is set to 256, for AMR it is 128.", 
        "204": "This configuration, found using grid search and heuristic search within the range of models that fit into a single GPU, gave the best performance on the development set under multiple graph linearizations.", 
        "205": "Encoder word embeddings are initialized (in the first 100 dimensions) with pre-trained order-sensitive embeddings (Ling et al., 2015).", 
        "206": "Singletons in the encoder input are replaced with an unknown word symbol with probability 0.5 for each iteration.", 
        "207": "6.4 MRS parsing results  We compare different linearizations and model architectures for parsing DMRS on the development data, showing that our approach is more accurate than baseline neural approaches.", 
        "208": "We report EDM scores, including scores for predicate (EDMP ) and argument (EDMA) prediction.", 
        "209": "First we report results using standard attentionbased encoder-decoders, with the alignments encoded as token strings in the linearization.", 
        "210": "(Table 1).", 
        "211": "We compare the top-down (TD) and arceager (AE) linearizations, as well as the effect of delexicalizing the predicates (factorizing lemmas out of the linearization and predicting them sepa-\n5Code and data preparation scripts are available at https://github.com/janmbuys/ DeepDeepParser.", 
        "212": "rately.)", 
        "213": "In both cases constants are predicted with a dictionary lookup based on the predicted spans.", 
        "214": "A special label is predicted for predicates not in the ERG lexicon – the words and POS tags that make up those predicates are recovered through the alignments during post-processing.", 
        "215": "The arc-eager unlexicalized representation gives the best performance, even though the model has to learn to model the transition system stack through the recurrent hidden states without any supervision of the transition semantics.", 
        "216": "The unlexicalized models are more accurate, mostly due to their ability to generalize to sparse or unseen predicates occurring in the lexicon.", 
        "217": "For the arc-eager representation, the oracle EDM is 99% for the lexicalized representation and 98.06% for the delexicalized representation.", 
        "218": "The remaining errors are mostly due to discrepancies between the tokenization used by our system and the ERG tokenization.", 
        "219": "The unlexicalized models are also faster to train, as the decoder’s output vocabulary is much smaller, reducing the expense of computing softmaxes over large vocabularies.", 
        "220": "Next we consider models with delexicalized linearizations that predict the alignments with pointer networks, contrasting soft and hard attention models (Table 2).", 
        "221": "The results show that the arc-eager models performs better than those based on topdown representation.", 
        "222": "For the arc-eager model we use hard attention, due to the natural interpretation of the alignment prediction corresponding to the transition system.", 
        "223": "The stack-based architecture gives further improvements.", 
        "224": "When comparing the effect of different predicate orderings for the arc-eager model, we find that the monotone ordering performs 0.44 EDM better than the in-order ordering, despite having to parse more non-planar dependencies.", 
        "225": "We also trained models that only predict predicates (in monotone order) together with their\nstart spans.", 
        "226": "The hard attention model obtains 91.36% F1 on predicates together with their start spans with the unlexicalized model, compared to 88.22% for lexicalized predicates and 91.65% for the full parsing model.", 
        "227": "Table 3 reports test set results for various evaluation metrics.", 
        "228": "Start EDM is calculated by requiring only the start of the alignment spans to match, not the ends.", 
        "229": "We compare the performance of our baseline and stack-based models against ACE, the ERG-based parser.", 
        "230": "Despite the promising performance of the model a gap remains between the accuracy of our parser and ACE.", 
        "231": "One reason for this is that the test set sentences will arguably be easier for ACE to parse as their choice was restricted by the same grammar that ACE uses.", 
        "232": "EDM metrics excluding end-span prediction (Start EDM) show that our parser has relatively more difficulty in parsing end-span predictions than the grammar-based parser.", 
        "233": "We also evaluate the speed of our model compared with ACE.", 
        "234": "For the unbatched version of our model, the stack-based parser parses 41.63 tokens per second, while the batched implementation parses 529.42 tokens per second using a batch size of 128.", 
        "235": "In comparison, the setting of ACE for which we report accuracies parses 7.47 tokens per second.", 
        "236": "By restricting the memory usage of ACE, which restricts its coverage, we see that ACE can parse 11.07 tokens per second at 87.7% coverage, and 15.11 tokens per second at 77.8% coverage.", 
        "237": "Finally we report results for parsing EDS (Table 4).", 
        "238": "The EDS parsing task is slightly simpler than DMRS, due to the absence of rich argument labels and additional graph edges that allow the recovery of full MRS. We see that for ACE the accuracies are very similar, while for our model EDS\nparsing is more accurate on the EDM metrics.", 
        "239": "We hypothesize that most of the extra information in DMRS can be obtained through the ERG, to which ACE has access but our model doesn’t.", 
        "240": "An EDS corpus which consists of about 95% of the DeepBank data has also been released6, with the goal of enabling comparison with other semantic graph parsing formalisms, including CCG dependencies and Prague Semantic Dependencies, on the same data set (Kuhlmann and Oepen, 2016).", 
        "241": "On this corpus our model obtains 85.87 EDM and 85.49 Smatch.", 
        "242": "6.5 AMR parsing  We apply the same approach to AMR parsing.", 
        "243": "Results on the development set are given in Table 5.", 
        "244": "The arc-eager-based models again give better performance, mainly due to improved concept prediction accuracy.", 
        "245": "However, concept prediction remains the most important weakness of the model; Damonte et al.", 
        "246": "(2017) reports that state-of-the-art AMR parsers score 83% on concept prediction.", 
        "247": "We report test set results in Table 6.", 
        "248": "Our best neural model outperforms the baseline JAMR parser (Flanigan et al., 2014), but still lags behind the performance of state-of-the-art AMR parsers such as CAMR (Wang et al., 2016) and AMR Eager (Damonte et al., 2017).", 
        "249": "These models make extensive use of external resources, including syntactic parsers and semantic role labellers.", 
        "250": "Our attention-based encoder-decoder model already outperforms previous sequence-to-sequence\n6http://sdp.delph-in.net/osdp-12.tgz\nAMR parsers (Barzdins and Gosko, 2016; Peng et al., 2017), and the arc-eager model boosts accuracy further.", 
        "251": "Our model also outperforms a Synchronous Hyperedge Replacement Grammar model (Peng and Gildea, 2016) which is comparable as it does not make extensive use of external resources.", 
        "252": "7 Conclusion  In this paper we advance the state of parsing by employing deep learning techniques to parse sentence to linguistically expressive semantic representations that have not previously been parsed in an end-to-end fashion.", 
        "253": "We presented a robust, wide-coverage parser for MRS that is faster than existing parsers and amenable to batch processing.", 
        "254": "We believe that there are many future avenues to explore to further increase the accuracy of such parsers, including different training objectives, more structured architectures and semisupervised learning.", 
        "255": "Acknowledgments  The first author thanks the financial support of the Clarendon Fund and the Skye Foundation.", 
        "256": "We thank Stephan Oepen for feedback and help with data preperation, and members of the Oxford NLP group for valuable discussions."
    }, 
    "document_id": "P17-1112.pdf.json"
}
