{
    "abstract_sentences": {
        "1": "Grammatical error correction (GEC) systems strive to correct both global errors in word order and usage, and local errors in spelling and inflection.", 
        "2": "Further developing upon recent work on neural machine translation, we propose a new hybrid neural model with nested attention layers for GEC.", 
        "3": "Experiments show that the new model can effectively correct errors of both types by incorporating word and character-level information, and that the model significantly outperforms previous neural models for GEC as measured on the standard CoNLL14 benchmark dataset.", 
        "4": "Further analysis also shows that the superiority of the proposed model can be largely attributed to the use of the nested attention mechanism, which has proven particularly effective in correcting local errors that involve small edits in orthography."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 753–762 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1070  1 Introduction  One of the most successful approaches to grammatical error correction (GEC) is to cast the problem as (monolingual) machine translation (MT), where we translate from possibly ungrammatical English sentences to corrected ones (Brockett et al., 2006; Gao et al., 2010; Junczys-Dowmunt and Grundkiewicz, 2016).", 
        "2": "Such systems, which are based on phrasebased MT models that are typically trained on large sets of sentence-correction pairs, can correct global errors such as word order and usage and local errors in spelling and inflection.", 
        "3": "The approach has proven superior to systems based on local classifiers that can only fix focused errors in prepositions, determiners, or inflected forms (Rozovskaya and Roth, 2016).", 
        "4": "∗This work was conducted while the third author worked at Microsoft Research.", 
        "5": "Recently, neural machine translation (NMT) systems have achieved substantial improvements in translation quality over phrase-based MT systems (Sutskever et al., 2014; Bahdanau et al., 2015).", 
        "6": "Thus, there is growing interest in applying neural systems to GEC (Yuan and Briscoe, 2016; Xie et al., 2016).", 
        "7": "In this paper, we significantly extend previous work, and explore new neural models to meet the unique challenges of GEC.", 
        "8": "The core component of most NMT systems is a sequence-to-sequence (S2S) model which encodes a sequence of source words into a vector and then generates a sequence of target words from the vector.", 
        "9": "Unlike the phrase-based MT models, the S2S model can capture long-distance, or even global, word dependencies, which are crucial to correcting global grammatical errors and helping users achieve native speaker fluency (Sakaguchi et al., 2016).", 
        "10": "Thus, the S2S model is expected to perform better on GEC than phrase-based models.", 
        "11": "However, as we will show in this paper, to achieve the best performance on GEC, we still need to extend the standard S2S model to address several task-specific challenges, which we will describe below.", 
        "12": "First, a GEC model needs to deal with an extremely large vocabulary that consists of a large number of words and their (mis)spelling variations.", 
        "13": "Second, the GEC model needs to capture structure at different levels of granularity in order to correct errors of different types.", 
        "14": "For example, while correcting spelling and local grammar errors requires only word-level or sub-word level information, e.g., violets→ violates (spelling) or violate→ violates (verb form), correcting errors in word order or usage requires global semantic relationships among phrases and words.", 
        "15": "Standard approaches in neural machine translation, also applied to grammatical error correction by Yuan and Briscoe (2016), address the large vocabulary problem by restricting the vocabulary to a limited number of high-frequency words and re-\n753\nsorting to standard word translation dictionaries to provide translations for the words that are out of the vocabulary (OOV).", 
        "16": "However, this approach often fails to take into account the OOVs in context for making correction decisions, and does not generalize well to correcting words that are unseen in the parallel training data.", 
        "17": "An alternative approach, proposed by Xie et al.", 
        "18": "(2016), applies a character-level sequence to sequence neural model.", 
        "19": "Although the model eliminates the OOV issue, it cannot effectively leverage word-level information for GEC, even if it is used together with a separate word-based language model.", 
        "20": "Our solution to the challenges mentioned above is a novel, hybrid neural model with nested attention layers that infuse both word-level and character-level information.", 
        "21": "The architecture of the model is illustrated in Figure 1.", 
        "22": "The word-level information is used for correcting global grammar and fluency errors while the character-level information is used for correcting local errors in spelling or inflected forms.", 
        "23": "Contextual information is crucial for GEC.", 
        "24": "Using the proposed model, by combining embedding vectors and attention at both word and character levels, we model all contextual words, including OOVs, in a unified context vector representation.", 
        "25": "In particular, as we will discuss in Section 5, the character-level attention layer captures most useful information for correcting local errors that involve small edits in orthography.", 
        "26": "Our model differs substantially from the wordlevel S2S model of Yuan and Briscoe (2016) and the character-level S2S model of Xie et al.", 
        "27": "(2016) in the way we infuse information at both the word level and the character level.", 
        "28": "We extend the wordcharacter hybrid model of Luong and Manning (2016), which was originally developed for machine translation, by introducing a character attention layer.", 
        "29": "This allows the model to learn substitution patterns at both the character level and the word level in an end-to-end fashion, using sentencecorrection pairs.", 
        "30": "We validate the effectiveness of our model on the CoNLL-14 benchmark dataset (Ng et al., 2014).", 
        "31": "Results show that the proposed model outperforms all previous neural models for GEC, including the hybrid model of Luong and Manning (2016), which we apply to GEC for the first time.", 
        "32": "When integrated with a large word-based n-gram language model, our GEC system achieves an F0.5 of 45.15 on CoNLL-14, substantially exceeding the previ-\nously reported top performance of 40.56 achieved by using a neural model and an external language model (Xie et al., 2016).", 
        "33": "2 Related Work  A variety of classifier-based and MT-based techniques have been applied to grammatical error correction.", 
        "34": "The CoNLL-14 shared task overview paper of Ng et al.", 
        "35": "(2014) provides a comparative evaluation of approaches.", 
        "36": "Two notable advances after the shared task have been in the areas of combining classifiers and phrase-based MT (Rozovskaya and Roth, 2016) and adapting phrase-based MT to the GEC task (Junczys-Dowmunt and Grundkiewicz, 2016).", 
        "37": "The latter work has reported the highest performance to date on the task of 49.5 in F0.5 score on the CoNLL-14 test set.", 
        "38": "This method integrates discriminative training toward the task-specific evaluation function, a rich set of features, and multiple large language models.", 
        "39": "Neural approaches to the task are less explored.", 
        "40": "We believe that the advances from Junczys-Dowmunt and Grundkiewicz (2016) are complementary to the ones we propose for neural MT, and could be integrated with neural models to achieve even higher performance.", 
        "41": "Two prior works explored sequence to sequence neural models for GEC (Xie et al., 2016; Yuan and Briscoe, 2016), while Chollampatt et al.", 
        "42": "(2016) integrated neural features in a phrase-based system for the task.", 
        "43": "Neural models were also applied to the related sub-task of grammatical error identification (Schmaltz et al., 2016).", 
        "44": "Yuan and Briscoe (2016) demonstrated the promise of neural MT for GEC but did not adapt the basic sequence-to-sequence with attention to its unique challenges, falling back to traditional word-alignment models to address vocabulary coverage with a post-processing heuristic.", 
        "45": "Xie et al.", 
        "46": "(2016) built a character-level sequence\nto sequence model, which achieves open vocabulary and character-level modeling, but has difficulty with global word-level decisions.", 
        "47": "The primary focus of our work is integration of character and word-level reasoning in neural models for GEC, to capture global fluency errors and local errors in spelling and closely related morphological variants, while obtaining open vocabulary coverage.", 
        "48": "This is achieved with the help of character and word-level encoders and decoders with two nested levels of attention.", 
        "49": "Our model is inspired by advances in sub-word level modeling in neural machine translation.", 
        "50": "We build mostly on the hybrid model of Luong and Manning (2016) to expand its capability to correct rare words by fine-grained character-level attention.", 
        "51": "We directly compare our model to the one of Luong and Manning (2016) on the grammar correction task.", 
        "52": "Alternative methods for MT include modeling of word pieces to achieve open vocabulary (Sennrich et al., 2016), and more recently, fully character-level modeling (Lee et al., 2017).", 
        "53": "None of these models integrate two nested levels of attention although an empirical evaluation of these approaches for GEC would also be interesting.", 
        "54": "3 Nested Attention Hybrid Model  Our model is hybrid, and uses both word-level and character-level representations.", 
        "55": "It consists of a word-based sequence-to-sequence model as a backbone, and additional character-level encoder, decoder, and attention components, which focus on words that are outside the word-level model’s vocabulary.", 
        "56": "3.1 Word-based sequence-to-sequence model as backbone  The word-based backbone closely follows the basic neural sequence-to-sequence architecture with attention as proposed by Bahdanau et al.", 
        "57": "(2015) and applied to grammatical error correction by Yuan and Briscoe (2016).", 
        "58": "For completeness, we give a sketch here.", 
        "59": "It uses recurrent neural networks to encode the input sentence and to decode the output sentence.", 
        "60": "Given a sequence of embedding vectors, corresponding to a sequence of input words x:\nx = (x1, .", 
        "61": ".", 
        "62": ".", 
        "63": ", xT ), (1)\nthe encoder creates a corresponding context-\nspecific sequence of hidden state vectors e:\ne = (h1, .", 
        "64": ".", 
        "65": ".", 
        "66": ", hT )\nThe hidden state ht at time t is computed as: ft = GRUencf (ft−1, xt) , bt = GRUencb(bt+1, xt), ht = [ft; bt], where GRUencf and GRUencb stand for gated recurrent unit functions as described in Cho et al.", 
        "67": "(2014).", 
        "68": "We use the symbol GRU with different subscripts to represent GRU functions using different sets of parameters (for example, we used the encf and encb subscripts to denote the parameters of the forward and backward word-level encoder units.)", 
        "69": "The decoder network is also an RNN using GRU units, and defines a sequence of hidden states d̄1, .", 
        "70": ".", 
        "71": ".", 
        "72": ", d̄S used to define the probability of an output sequence y1, .", 
        "73": ".", 
        "74": ".", 
        "75": ", yS as follows:\nThe context vector cs at time step s is computed as follows:\ncs = T∑\nj=1\nαsjhj (2)\nwhere: αsk =\nusk∑T j=1 usj\n(3)\nusk = φ1(ds) Tφ2(hk) (4)\nHere φ1 and φ2 denote feedforward linear transformations followed by a tanh nonlinearity.", 
        "76": "The next hidden state d̄s is then defined as:\nds = GRUdec( ¯ds−1, ys−1),\nd̄s = ReLU(W [cs; ds])\nwhere ys−1 is the embedding of the output token at time s-1.", 
        "77": "ReLU indicates rectified linear units (Hahnloser et al., 2000).", 
        "78": "The probability of each target word ys is computed as: p(ys|y<s,x) = softmax(g(d̄s)), where g is a function that maps the decoder state into a vector of size the dimensionality of the target vocabulary.", 
        "79": "The model is trained by minimizing the crossentropy loss, which for a given (x,y) pair is:\nLoss(x,y) = − S∑\ns=1\nlog p(ys|y<s,x) (5)\nFor parallel training data C, the loss is:\nLoss = − ∑\n(x,y)∈C\nS∑\ns=1\nlog p(ys|y<s,x)  3.2 Hybrid encoder and decoder with two nested levels of attention  The word-level backbone models a limited vocabulary of source and target words, and represents out-of-vocabulary tokens with special UNK symbols.", 
        "80": "In the standard word-level NMT approach, valuable information is lost for source OOV words and target OOV words are predicted using postprocessing heuristics.", 
        "81": "Hybrid encoder\nOur hybrid architecture overcomes the loss of source information in the word-level backbone by building up compositional representations of the source OOV words using a character-level recurrent neural network with GRU units.", 
        "82": "These representations are used in place of the special source UNK embeddings in the backbone, and contribute to the contextual encoding of all source tokens.", 
        "83": "For example, a three word input sentence where the last term is out-of-vocabulary will be represented as the following vector of embeddings in the word-level model: x = (x1, x2, x3), where x3 would be the embedding for the UNK symbol.", 
        "84": "The hybrid encoder builds up a word embedding for the third word based on its character sequence: xc1, .", 
        "85": ".", 
        "86": ".", 
        "87": ", x c M .", 
        "88": "The encoder computes a sequence of hidden states ec for this character sequence, by a forward character-level GRU network:\nec = (h c 1, .", 
        "89": ".", 
        "90": ".", 
        "91": ", h c M ), (6)\nThe last state hcM is used as an embedding of the unknown word.", 
        "92": "The sequence of embeddings for our example three-word sequence becomes: x = (x1, x2, h c M ).", 
        "93": "We use the same dimensionality for word embedding vectors xi and composed character sequence vectors hcM to ensure the two ways to define embeddings are compatible.", 
        "94": "Our hybrid source encoder architecture is similar to the one proposed by Luong and Manning (2016).", 
        "95": "Nested attention hybrid decoder\nIn traditional word-based sequence-to-sequence models special target UNK tokens are used to represent outputs that are outside the target vocabulary.", 
        "96": "A post-processing UNK-replacement method is then used (Cho et al., 2015; Yuan and Briscoe, 2016) to replace these special tokens with target words.", 
        "97": "The hybrid model of (Luong and Manning, 2016) uses a jointly trained character-level decoder\nto generate target words corresponding to UNK tokens, and outperforms the traditional approach in the machine translation task.", 
        "98": "However, unlike machine translation, models for grammar correction conduct “translation” in the same language, and often need to apply a small number of local edits to the character sequence of a source word corresponding to the target UNK word.", 
        "99": "For example, rare but correct words such as entity names need to be copied as is, and local spelling errors or errors in inflection need to be corrected.", 
        "100": "The architecture of Luong and Manning (2016) does not have direct access to a source character sequence, but only uses a single fixed-dimensionality embedding of source unknown words aggregated with additional contextual information from the source.", 
        "101": "To address the needs of the grammatical error correction task, we propose a novel hybrid decoder with two nested levels of attention: word level and character-level.", 
        "102": "The character-level attention serves to provide the decoder with direct access to the relevant source character sequence.", 
        "103": "More specifically, the probability of each target word is defined as follows: For words in the target vocabulary, the probability is defined by the wordlevel backbone.", 
        "104": "For words outside the vocabulary, the probability of each token is the probability of UNK according to the backbone, multiplied by the probability of the word’s character sequence.", 
        "105": "The probability of the target character sequence corresponding to an UNK token at position s in the target is defined using a character-level decoder.", 
        "106": "As in Luong and Manning (2016), the “separate path” architecture is used to capture the relevant context and define the initial state for the character-level decoder:\nd̂s = ReLU(Ŵ [cs; ds])\nwhere Ŵ are parameters different from W , and d̂s is not used by the word-level model in predicting the subsequent tokens, but is only used to initialize the character-level decoder.", 
        "107": "To be able to attend to the relevant source character sequence when generating the target character sequence, we use the concept of hard attention (Xu et al., 2015), but use an arg-max approximation for inference instead of sampling.", 
        "108": "A similar approach to represent discrete hidden structure in a variety of architectures is used in Kong et al.", 
        "109": "(2017).", 
        "110": "The source index zs corresponding to the target\nposition s is defined according to the word-level attention model:\nzs = arg max k∈0...T−1 αsk\nwhere αsk are the intermediate outputs of the word-level attention model we described in Eq.(3).", 
        "111": "The character-level decoder generates a character sequence yc = (yc1, .", 
        "112": ".", 
        "113": ".", 
        "114": ", y c N ), conditioned on the initial vector d̂s and the source index zs.", 
        "115": "The characters are generated using a hidden state vector dcn at each time step, via a softmax(gc(dcn)), where gc maps the state to the target character vocabulary space.", 
        "116": "If the source word xzs is in the source vocabulary, the model is analogous to the one of Luong and Manning (2016) and does not use characterlevel attention: the source context is available only in aggregated form to initialize the state of the decoder.", 
        "117": "The state dcn for step n in the characterlevel decoder is defined as follows, where GRUcdec are parameters for the gated recurrent cell of this decoder:\ndcn = { GRUcdec(d̂s, ycn−1) n = 0 GRUcdec(dcn−1, ycn−1) n > 0\nIn contrast, if the corresponding token in the source xzs is also an out-of-vocabulary word, we define a second nested level of character attention and use it in the character-level decoder.", 
        "118": "The character-level attention focuses on individual characters from the source word xzs .", 
        "119": "If ec are the source character hidden vectors computed as in Eq.", 
        "120": "(6), the recurrence equations for the characterlevel decoder with nested attention are:\n¯dcn = ReLU(Wc[ccn; dcn])\ndcn = { GRUcdecNested(d̂s, ycn−1) n = 0 GRUcdecNested( ¯dcn−1, ycn−1) n > 0\nwhere ccn is the context vector obtained using character-level attention on the sequence ec and the last state of the character-level decoder dcn, computed following equations 2, 3 and 4, but using a different set of parameters.", 
        "121": "These equations show that the character-level decoder with nested attention can use both the wordlevel state d̂s, and the character-level context ccn\nand hidden state dcn to perform global and local editing operations.", 
        "122": "Since we introduced two architectures for the character-level decoder depending on whether the source word xzs is OOV, the combined loss function is defined as follows for end-to-end training:\nLosstotal = Lossw + αLossc1 + βLossc2\nHere Lossw is the standard word-level loss in Eq.", 
        "123": "(5); character level losses Lossc1 and Lossc2 are losses for target OOV words corresponding to source known and unknown tokens, respectively.", 
        "124": "α and β are hyper-parameters to balance the loss terms.", 
        "125": "As seen, our proposed nested attention hybrid model uses character-level attention only when both a predicted target word and its corresponding source input word are OOV.", 
        "126": "While the model can be naturally generalized to integrate characterlevel attention for known words, the original hybrid model proposed by Luong and Manning (2016) does not use any character-level information for known words.", 
        "127": "Thus for a controlled evaluation of the impact of the addition of character-level attention only, in this paper we limit character-level attention to OOV words, which already use characters as a basis for building their embedding vectors.", 
        "128": "A thorough investigation of the impact of characterlevel information in the encoder, attention, and decoder for known words as well is an interesting topic for future research.", 
        "129": "Decoding for word-level and hybrid models Beam-search is used to decode hypotheses according to the word-level backbone model.", 
        "130": "For the hybrid model architecture, word-level beam search is conducted first; for each target UNK token, character-level beam-search is used to generate a corresponding target word.", 
        "131": "4 Experiments    4.1 Dataset and Evaluation  We use standard publicly available datasets for training and evaluation.", 
        "132": "One data source is the NUS Corpus of Learner English (NUCLE) (Dahlmeier et al., 2013), which is provided as a training set for the CoNLL-13 and CoNLL-14 shared tasks.", 
        "133": "From the original corpus of size about 60K parallel sentences, we randomly selected close to 5K sentence pairs for use as a validation set, and 45K parallel sentences for use in training.", 
        "134": "A second data source\nTraining Validation Development Test #Sent pairs 2,608,679 4,771 1,381 1,312\nis the Cambridge Learner Corpus (CLC) (Nicholls, 2003), from which we extracted a substantially larger set of parallel sentences.", 
        "135": "Finally, we used additional training examples from the Lang-8 Corpus of Learner English v1.0 (Tajiri et al., 2012).", 
        "136": "As Lang-8 data is crowd-sourced, we used heuristics to filter out noisy examples: we removed sentences longer than 100 words and sentence pairs where the correction was substantially shorter than the input text.", 
        "137": "Table 2 shows the number of sentence pairs from each source used for training.", 
        "138": "We evaluate the performance of the models on the standard sets from the CoNLL-14 shared task (Ng et al., 2014).", 
        "139": "We report final performance on the CoNLL-14 test set without alternatives, and analyze model performance on the CoNLL-13 development set (Dahlmeier et al., 2013).", 
        "140": "We use the development and validation sets for model selection.", 
        "141": "The sizes of all datasets in number of sentences are shown in Table 1.", 
        "142": "We report performance in F0.5-measure, as calculated by the m2scorer— the official implementation of the scoring metric in the shared task.", 
        "143": "1 Given system outputs and gold-standard edits, m2scorer computes the F0.5 measure of a set of system edits against a set of gold-standard edits.", 
        "144": "4.2 Baseline  We evaluate our model in comparison to the strong baseline of a word-based neural sequenceto-sequence model with attention, with postprocessing for handling out-of-vocabulary words (Yuan and Briscoe, 2016); we refer to this model as word NMT+UNK replacement.", 
        "145": "Like Yuan and Briscoe (2016), we use a traditional wordalignment model (GIZA++) to derive a wordcorrection lexicon from the parallel training set.", 
        "146": "However, in decoding, we don’t use GIZA++ to find the corresponding source word for each tar-\n1http://www.comp.nus.edu.sg/˜nlp/sw/ m2scorer.tar.gz\nget OOV, but follow Cho et al.", 
        "147": "(2015), Section 3.3 to use the NMT system’s attention weights instead.", 
        "148": "The target OOV is then replaced by the most likely correction of the source word from the wordcorrection lexicon, or by the source word itself if there are no available corrections.", 
        "149": "4.3 Training Details and Results  The embedding size for all word and characterlevel encoders and decoders is set to 1000, and the hidden unit size is also 1000.", 
        "150": "To reproduce the model of Yuan and Briscoe (2016), we selected the word vocabulary for the baseline by choosing the 30K most frequent words in the source and target respectively to form the source and target vocabularies.", 
        "151": "In preliminary experiments for the hybrid models, we found that selecting the same vocabulary of 30K words for the source and target based on combined frequency was better (.003 in F0.5) and use that method for vocabulary selection instead.", 
        "152": "However, there was no gain observed by using such a vocabulary selection method in the baseline.", 
        "153": "Although the source and target vocabularies in the hybrid models are the same, like in the word-level model, the embedding parameters for source and target words are not shared.", 
        "154": "The hyper-parameters for the losses in our models are selected based on the development set and set as follows: α = β = 0.5.", 
        "155": "All models are trained with mini-batch size of 128 (batches are shuffled), initial learning rate of 0.0003 and a 0.95 decay ratio if the cost increases in two consecutive 100 iterations.", 
        "156": "The gradient is rescaled whenever its norm exceeds 10, and dropout is used with a probability of 0.15.", 
        "157": "Parameters are uniformly ini-\ntialized in [− √\n(3)√ 1000 ,\n√ (3)√\n1000 ].", 
        "158": "We perform inference on the validation set every 5000 iterations to log word-level cost and characterlevel costs; we save parameter values for the model every 10000 iterations as well as the end of each epoch.", 
        "159": "The stopping point for training is selected based on development set F0.5 among the top 20 parameter sets with best validation set value of the loss function.", 
        "160": "Training of the nested attention hybrid model takes approximately five days on a Tesla k40m GPU.", 
        "161": "The basic hybrid model trains in around four days and the word-level backbone trains in approximately three days.", 
        "162": "Table 3 shows the performance of the baseline and our nested attention hybrid model on the development and test sets.", 
        "163": "In addition to the word-level\nbaseline, we include the performance of a hybrid model with a single level of attention, which follows the work of Luong and Manning (2016) for machine translation, and is the first application of a hybrid word/character-level model to grammatical error correction.", 
        "164": "Based on hyper-parameter selection, the character-level component weight of the loss is α = 1 for the basic hybrid model.", 
        "165": "As shown in Table 3, our implementation of the word NMT+UNK replacement baseline approaches the performance of the one reported in Yuan and Briscoe (2016) (38.77 versus 39.9).", 
        "166": "We attribute the difference to differences in the training set and the word-alignment methods used.", 
        "167": "Our reimplementation serves to provide a controlled experimental evaluation of the impact of hybrid models and nested attention on the GEC task.", 
        "168": "As seen, our nested attention hybrid model substantially improves upon the baseline, achieving a gain of close to 3 points on the test set.", 
        "169": "The hybrid word/character model with a single level of attention brings a large improvement as well, showing the importance of character-level information for this task.", 
        "170": "We delve deeper into the impact of nested attention for the hybrid model in Section 5.", 
        "171": "4.4 Integrating a Web-scale Language Model  The value of large language models for grammatical error correction is well known, and such models have been used in classifier and MT-based systems.", 
        "172": "To establish the potential of such models in word-based neural sequence-to-sequence systems, we integrate a web-scale count-based language model.", 
        "173": "In particular, we use the modified Kneser-Ney 5-gram language model trained from Common Crawl (Buck et al., 2014), made available for download by Junczys-Dowmunt and Grundkiewicz (2016).", 
        "174": "Candidates generated by neural models are reranked using the following linear interpolation of log probabilities: sy|x = logPNN (y|x) + λ logPLM (y).", 
        "175": "Here λ is a hyper-parameter that balances the weights of the neural network model and the language model.", 
        "176": "We tuned λ separately\nfor each neural model variant, by exploring values in the range [0.0, 2.0] with step size 0.1, and selecting according to development set F0.5.", 
        "177": "The selected values of λ are: 1.6 for word NMT + UNK replacement and 1.0 for the nested attention model.", 
        "178": "Table 4 shows the impact of the LM when combined with the neural models implemented in this work.", 
        "179": "The table also lists the results reported by Xie et al.", 
        "180": "(2016), for their character-level neural model combined with a large word-level language model.", 
        "181": "Our best results exceed the ones reported in the prior work by more than 4 points, although we should note that Xie et al.", 
        "182": "(2016) used a smaller parallel data set for training.", 
        "183": "5 Analysis  We analyze the impact of sub-word level information and the two nested levels of attention in more detail by looking at the performance of the models on different segments of the data.", 
        "184": "In particular, we analyze the performance of the models on sentences containing OOV source words versus ones without OOV words, and corrections to orthographically similar versus dissimilar word forms.", 
        "185": "5.1 Performance by Segment: OOV versus Non-OOV  We present a comparative performance analysis of models on the CoNLL-13 development set.", 
        "186": "First, we divide the set into two segments: OOV and NonOOV, based on whether there is at least one OOV word in the given source input.", 
        "187": "Table 5 shows that both hybrid architectures substantially outperform the word-level model in both segments of the data.", 
        "188": "The additional nested character-level attention of our hybrid model brings a sizable improvement over the basic hybrid model in the OOV segment and a small degradation in the non-OOV segment.", 
        "189": "We should note that in future work characterlevel attention can be added for non-OOV source words in the nested attention model, which could improve performance on this segment as well.", 
        "190": "Table 6 shows an example where the nested attention hybrid model successfully corrects a misspelling resulting in an OOV word on the source, whereas the baseline word-level system simply copies the source word without fixing the error (since this particular error is not observed in the parallel training set).", 
        "191": "5.2 Impact of Nested Attention on Different Error Types  To analyze more precisely the impact of the additional character-level attention introduced by our design, we continue to investigate the OOV segment in more detail.", 
        "192": "The concept of edit, which is also used by the official M2 score metric, is defined as a minimal pair of corresponding sub-strings in a source sentence and a correction.", 
        "193": "For example, in the sentence fragment pair: “Even though there is a risk of causing harms to someone, people still are prefers to keep their pets without a leash.” → “Even though there is a risk of causing harm to someone, people still prefer to keep their pets without a leash.”, the minimal edits are “harms→ harm” and “are prefers→ prefer”.", 
        "194": "The F0.5 score is computed using weighted precision and recall of the set of a system’s edits against one or more sets of reference edits.", 
        "195": "For our in-depth analysis, we classify edits in the OOV segment into two types: small changes and large changes, based on whether the source and target phrase of the edit are orthographically similar or not.", 
        "196": "More specifically, we say that the target and\nsource phrases are orthographically similar, iff: the character edit distance is at most 2 and the source or target is at most 8 characters long, or edit ratio < 0.25, where edit ratio = character edit distancemin(len(src),len(tar))+0.1 , len(∗) denotes number of characters in ∗, and src and tgt denote the pairs in the edit.", 
        "197": "There are 307 gold edits in the “small changes” portion of the CoNLL-13 OOV segment, and 481 gold edits in the “large changes” portion.", 
        "198": "Our hypothesis is that the additional characterlevel attention layer is particularly useful to model edits among orthographically similar words.", 
        "199": "Table 7 contrasts the impact of character-level attention on the two portions of the data.", 
        "200": "We can see that the gains in the “small changes” portion are indeed quite large, indicating that the fine-grained character-level attention empowers the model to more accurately correct confusions among phrases with high character-level similarity.", 
        "201": "The impact in the “large changes” portion is slightly positive in precision and slightly negative in recall.", 
        "202": "Thus most of the benefit of the additional character-level attention stems from improvements in the “small changes” portion.", 
        "203": "Table 8 shows an example input which illustrates the precision gain of the nested attention hybrid model.", 
        "204": "The input sentence has a source OOV word which is correct.", 
        "205": "The hybrid model introduces an error in this word, because it uses only a single source context vector, aggregating the characterlevel embedding of the source OOV word together with other source words.", 
        "206": "The additional characterlevel attention layer in the nested hybrid model enables the correct copying of this long source OOV word, without employing the heuristic mechanism of the word-level NMT system.", 
        "207": "6 Conclusions  We have introduced a novel hybrid neural model with two nested levels of attention: word-level and character-level.", 
        "208": "The model addresses the unique challenges of the grammatical error correction task and achieves the best reported results on the CoNLL-14 benchmark among fully neural systems.", 
        "209": "Our nested attention hybrid model deeply combines the strengths of word and character level information in all components of an end-to-end neural model: the encoder, the attention layers, and the decoder.", 
        "210": "This enables it to correct both global wordlevel and local character-level errors in a unified way.", 
        "211": "The new architecture contributes substantial improvement in correction of confusions among rare or orthographically similar words compared to word-level sequence-to-sequence and non-nested hybrid models.", 
        "212": "Acknowledgements  We would like to thank the ACL reviewers for their insightful suggestions, Victoria Zayats for her help with reproducing the baseline word-level NMT system and Yu Shi, Daxin Jiang and Michael Zeng for the helpful discussions."
    }, 
    "document_id": "P17-1070.pdf.json"
}
