{
    "abstract_sentences": {
        "1": "We introduce an attention-based Bi-LSTM for Chinese implicit discourse relations and demonstrate that modeling argument pairs as a joint sequence can outperform word order-agnostic approaches.", 
        "2": "Our model benefits from a partial sampling scheme and is conceptually simple, yet achieves state-of-the-art performance on the Chinese Discourse Treebank.", 
        "3": "We also visualize its attention activity to illustrate the model’s ability to selectively focus on the relevant parts of an input sequence."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 256–262 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2040  1 Introduction  True text understanding is one of the key goals in Natural Language Processing and requires capabilities beyond the lexical semantics of individual words or phrases.", 
        "2": "Natural language descriptions are typically driven by an inter-sentential coherent structure, exhibiting specific discourse properties, which in turn contribute significantly to the global meaning of a text.", 
        "3": "Automatically detecting how meaning units are organized benefits practical downstream applications, such as question answering (Sun and Chai, 2007), recognizing textual entailment (Hickl, 2008), sentiment analysis (Trivedi and Eisenstein, 2013), or text summarization (Hirao et al., 2013).", 
        "4": "Various formalisms in terms of semantic coherence frameworks have been proposed to account for these contextual assumptions (Mann and Thompson, 1988; Lascarides and Asher, 1993; Webber, 2004).", 
        "5": "The annotation schemata of the Penn Discourse Treebank (Prasad et al., 2008, PDTB) and the Chinese Discourse Treebank (Zhou and Xue, 2012, CDTB), for instance, define\n∗Both first authors contributed equally to this work.", 
        "6": "discourse units as syntactically motivated character spans in the text, augmented with relations pointing from the second argument (Arg2, prototypically, a discourse unit associated with an explicit discourse marker) to its antecedent, i.e., the discourse unit Arg1.", 
        "7": "Relations are labeled with a relation type (its sense) and the associated discourse marker.", 
        "8": "Both, PDTB and CDTB, distinguish explicit from implicit relations depending on the presence of such a marker (e.g., because/因).1 Sense classification for implicit relations is by far more challenging because the argument pairs lack the marker as an important feature.", 
        "9": "Consider, for instance, the following example from the CDTB as implicit CONJUNCTION:\nArg1: 会谈就一些原则和具体问题进行了 深入讨论，达成了一些谅解 In the talks, they discussed some principles and specific questions in depth, and reached some understandings\nArg2: 双方一致认为会谈具有积极成果 Both sides agree that the talks have positive results\nMotivation: Previous work on implicit sense labeling is heavily feature-rich and requires domainspecific, semantic lexicons (Pitler et al., 2009; Feng and Hirst, 2012; Huang and Chen, 2011).", 
        "10": "Only recently, resource-lean architectures have been proposed.", 
        "11": "These promising neural methods attempt to infer latent representations appropriate for implicit relation classification (Zhang et al., 2015; Ji et al., 2016; Chen et al., 2016).", 
        "12": "So far, unfortunately, these models have been evaluated only on four top-level senses—sometimes even with inconsistent evaluation setups.2 Furthermore, most systems have initially been designed for the English PDTB and involve complex, task-\n1The set of relation types and senses is completed by alternative lexicalizations (ALTLEX/discourse marker rephrased), and entity relations (ENTREL/anaphoric coherence).", 
        "13": "2E.g., four binary classifiers vs. four-way classification.", 
        "14": "256\nspecific architectures (Liu and Li, 2016), while discourse modeling techniques for Chinese have received very little attention in the literature and are still seriously underrepresented in terms of publicly available systems.", 
        "15": "What is more, over 80% of all words in Chinese discourse relations are implicit—compared to only 52% in English (Zhou and Xue, 2012).", 
        "16": "Recently, in the context of the CoNLL 2016 shared task (Xue et al., 2016), a first independent evaluation platform beyond class level has been established.", 
        "17": "Surprisingly, the best performing neural architectures to date are standard feedforward networks, cf.", 
        "18": "Wang and Lan (2016); Schenk et al.", 
        "19": "(2016); Qin et al.", 
        "20": "(2016).", 
        "21": "Even though these specific models completely ignore word order within arguments, such feedforward architectures have been claimed by Rutherford et al.", 
        "22": "(2016) to generally outperform any thoroughly-tuned recurrent architecture.", 
        "23": "Our Contribution: In this work, we release the first attention-based recurrent neural sense classifier, specifically developed for Chinese implicit discourse relations.", 
        "24": "Inspired by Zhou et al.", 
        "25": "(2016), our system is a practical adaptation of the recent advances in relation modeling extended by a novel sampling scheme.", 
        "26": "Contrary to previous assertions by Rutherford et al.", 
        "27": "(2016), our model demonstrates superior performance over traditional bag-of-words approaches with feedfoward networks by treating discourse arguments as a joint sequence.", 
        "28": "We evaluate our method within an independent framework and show that it performs very well beyond standard class-level predictions, achieving stateof-the-art accuracy on the CDTB test set.", 
        "29": "We illustrate how our model’s attention mechanism provides means to highlight those parts of an input sequence that are relevant for the classification decision, and thus, it may enable a better understanding of the implicit discourse parsing problem.", 
        "30": "Our proposed network architecture is flexible and largely language-independent as it operates only on word embeddings.", 
        "31": "It stands out due to its structural simplicity and builds a solid ground for further development towards other textual domains.", 
        "32": "2 Approach  We propose the use of an attention-based bidirectional Long Short-Term Memory (Hochreiter\nand Schmidhuber, 1997, LSTM) network to predict senses of discourse relations.", 
        "33": "The model draws upon previous work on LSTM, in particular its bidirectional mode of operation (Graves and Schmidhuber, 2005), attention mechanisms for recurrent models (Bahdanau et al., 2014; Hermann et al., 2015), and the combined use of these techniques for entity relation recognition in annotated sequences (Zhou et al., 2016).", 
        "34": "More specifically, our model is a flexible recurrent neural network with capabilities to sequentially inspect tokens and to highlight which parts of the input sequence are most informative for the discourse relation recognition task, using the weighting provided by the attention mechanism.", 
        "35": "Furthermore, the model benefits from a novel sampling scheme for arguments, as elaborated below.", 
        "36": "The system is learned in an end-to-end manner and consists of multiple layers, which are illustrated in Figure 1.", 
        "37": "First, token sequences are taken as input and special markers (<ARG1>, </ARG1>, etc.)", 
        "38": "are inserted into the corresponding positions to inform the model on the start and end points of argument spans.", 
        "39": "This way, we can ensure a general flexibility in modeling discourse units and could easily extend them with additional context, for instance.", 
        "40": "In our experiments on implicit arguments,\nonly the tokens in the respective spans are considered.", 
        "41": "Note that, unlike previous works, our approach models Arg1-Arg2 pairs as a joint sequence and does not first compute intermediate representations of arguments separately.", 
        "42": "Second, an input layer encodes tokens using one-hot vector representations (ti for tokens at positions i ∈ [1, k]), and a subsequent embedding layer provides a dense representation (ei) to serve as input for the recurrent layers.", 
        "43": "The embedding layer is initialized using pre-trained word vectors, in our case 300-dimensional Chinese Gigaword vectors (Graff and Chen, 2005).3 These embeddings are further tuned as the network is trained towards the prediction task.", 
        "44": "Embeddings for unknown tokens, e.g., markers, are trained by backpropagation only.", 
        "45": "Note that, tokens, markers and the pre-trained vectors represent the only source of information for the prediction task.", 
        "46": "For the recurrent setup, we use a layer of LSTM networks in a bidirectional manner, in order to better capture dependencies between parts of the input sequence by inspection of both left and righthand-side contexts at each time step.", 
        "47": "The LSTM holds a state representation as a continuous vector passed to the subsequent time step, and it is capable of modeling long-range dependencies due to its gated memory.", 
        "48": "The forward (A′) and backward (A′′) LSTMs traverse the sequence ei, producing sequences of vectors h′i and h ′′ i respectively, which are then summed together (indicated by ⊕ in Figure 1).", 
        "49": "The resulting sequence of vectors hi is reduced into a single vector and fed to the final softmax output layer in order to classify the sense label y of the discourse relation.", 
        "50": "This vector may be obtained either as the final vector h produced by an LSTM, or through pooling of all hi, or by using attention, i.e., as a weighted sum over hi.", 
        "51": "While the model may be somewhat more difficult to optimize using attention, it provides the added benefit of interpretability, as the weights highlight to what extent the classifier considers the LSTM state vectors at each token during modeling.", 
        "52": "This is particularly interesting for discourse parsing, as most previous approaches have provided little support for pinpointing the driving features in each argument span.", 
        "53": "Finally, the attention layer contains the trainable\n3http://www.cs.brandeis.edu/˜clp/ conll16st/dataset.html\nvector w (of the same dimensionality as vectors hi) which is used to dynamically produce a weight vector α over time steps i by:\nα = softmax(wT tanh(H))\nwhere H is a matrix consisting of vectors hi.", 
        "54": "The output layer r is the weighted sum of vectors inH:\nr = HαT\nPartial Argument Sampling: For the purpose of enlarging the instance space of training items in the CDTB, and thus, in order to improve the predictive performance of the model, we propose a novel partial sampling scheme of arguments, whereby the model is trained and validated on sequences containing both arguments, as well as single arguments.", 
        "55": "A data point (a1, a2, y), with ai being the token sequence of argument i, is expanded into {(a1, a2, y), (a1, a2, y), (a1, y), (a2, y)}.", 
        "56": "We duplicate bi-argument samples (a1, a2, y) (in training and development data only) to balance their frequencies against single-argument samples.", 
        "57": "Two lines of motivation support the inclusion of single argument training examples, grounded in linguistics and machine learning, respectively.", 
        "58": "First, it has been shown that single arguments in isolation can evoke a strong expectation towards a certain implicit discourse relation, cf.", 
        "59": "Asr and Demberg (2015) and, in particular, Rohde and Horton (2010) in their psycholinguistic study on implicit causality verbs.", 
        "60": "Second, the procedure may encourage the model to learn better representations of individual argument spans in support of modeling of arguments in composition, cf.", 
        "61": "LeCun et al.", 
        "62": "(2015).", 
        "63": "Due to these aspects, we believe this data augmentation technique to be effective in reinforcing the overall robustness of our model.", 
        "64": "Implementational Details: We train the model using fixed-length sequences of 256 tokens with zero padding at the beginning of shorter sequences and truncate longer ones.", 
        "65": "Each LSTM has a vector dimensionality of 300, matching the embedding size.", 
        "66": "The model is regularized by 0.5 dropout rate between the layers and weight decay (2.5e−6) on the LSTM inputs.", 
        "67": "We employ Adam optimization (Kingma and Ba, 2014) using the cross-entropy loss function with mini batch size of 80.4\n4The model is implemented in Keras https:// keras.io/.", 
        "68": "3 Evaluation  We evaluate our recurrent model on the CoNLL 2016 shared task data5 which include the official training, development and test sets of the CDTB; cf.", 
        "69": "Table 2 for an overview of the implicit sense distribution.6\nIn accordance with previous setups (Rutherford et al., 2016), we treat entity relations (ENTREL) as implicit and exclude ALTLEX relations.", 
        "70": "In the evaluation, we focus on the sense-only track, the subtask for which gold arguments are provided and a system is supposed to label a given argument pair with the correct sense.", 
        "71": "The results are shown in Table 1.", 
        "72": "With our proposed architecture it is possible to correctly label 257/352 (73.01%) of implicit rela-\n5http://www.cs.brandeis.edu/˜clp/ conll16st/\n6Note that, in the CDTB, implicit relations appear almost three times more often than explicit relations.", 
        "73": "Out of these, 65% appear within the same sentence.", 
        "74": "Finally, 25 relations in the training set have two labels.", 
        "75": "tions on the test set, outperforming the best feedforward system of Wang and Lan (2016) and all other word order-agnostic approaches.", 
        "76": "Development and test set performances suggest the robustness of our approach and its ability to generalize to unseen data.", 
        "77": "Ablation Study: We perform an ablation study to quantitatively assess the contribution of two of the characteristic aspects of our model.", 
        "78": "First, we compare the use of the attention mechanism against the simpler alternative of feeding the final LSTM hidden vectors (h′k and h ′′ 1) directly to the output layer.", 
        "79": "When attention is turned off, this yields an absolute decrease in performance of 2.70% on the test set, which is substantial and significant according to a Welch two-sample t-test (p < .001).", 
        "80": "Second, we independently compare the use of the partial sampling scheme against training on the standard argument pairs in the CDTB.", 
        "81": "Here, the absence of the partial sampling scheme yields an absolute decrease in accuracy of 5.74% (p < .001), which demonstrates its importance for achieving competitive performance on the task.", 
        "82": "Performance on the PDTB: As a side experiment, we investigate the model’s language independence by applying it to the implicit argument pairs of the English PDTB.", 
        "83": "Due to computational time constraints we do not optimize hyperparameters, but instead train the model using identical settings as for Chinese, which is expected to lead to suboptimal performance on the evaluation data.", 
        "84": "Nevertheless, we measure 27.09% accuracy on the PDTB test set (surpassing the majority class baseline of 22.01%), which shows that the model has potential to generalize across implicit discourse relations in a different language.", 
        "85": "Visualizing Attention Weights: Finally, in Figure 2, we illustrate the learned attention weights which pinpoint important subcomponents within a given implicit discourse relation.", 
        "86": "For the implicit CONJUNCTION relation the weights indicate a peak on the transition between the argument boundary, establishing a connection between the semantically related terms understandings–agree.", 
        "87": "Most ENTRELs show an opposite trend: here second arguments exhibit larger intensities than Arg1, as most entity relations follow the characteristic writing style of newspapers by adding additional information by reference to the same entity.", 
        "88": "4 Summary & Outlook  In this work, we have presented the first attentionbased recurrent neural sense labeler specifically developed for Chinese implicit discourse relations.", 
        "89": "Its ability to model discourse units sequentially and jointly has been shown to be highly beneficial, both in terms of state-of-the-art performance on the CDTB (outperforming word order-agnostic feedforward approaches), and also in terms of insightful observations into the inner workings of the model through its attention mechanism.", 
        "90": "The architecture is structurally simple, benefits from partial argument sampling, and can be eas-\nily adapted to similar relation recognition tasks.", 
        "91": "In future work, we intend to extend our approach to different languages and domains, e.g., to the recent data sets on narrative story understanding or question answering (Mostafazadeh et al., 2016; Feng et al., 2015).", 
        "92": "We believe that recurrent modeling of implicit discourse information can be a driving force in successfully handling such complex semantic processing tasks.7  Acknowledgments  The authors would like to thank Ayah Zirikly, Philip Schulz and Wei Ding for their very helpful suggestions on an early draft version of the paper, and also thank the anonymous reviewers for their valuable feedback and insightful comments.", 
        "93": "We are grateful to Farrokh Mehryary for technical support with the attention layer implementation.", 
        "94": "Computational resources were provided by CSC – IT Centre for Science, Finland, and Arcada University of Applied Sciences, Helsinki, Finland.", 
        "95": "Our research at Goethe University Frankfurt was supported by the project ‘Linked Open Dictionaries (LiODi, 2015-2020)’, funded by the German Ministry for Education and Research (BMBF).", 
        "96": "7The code involved in this study is publicly available at http://www.acoli.informatik.", 
        "97": "uni-frankfurt.de/resources/."
    }, 
    "document_id": "P17-2040.pdf.json"
}
