{
    "abstract_sentences": {
        "1": "Recently emerged intelligent assistants on smartphones and home electronics (e.g., Siri and Alexa) can be seen as novel hybrids of domain-specific taskoriented spoken dialogue systems and open-domain non-task-oriented ones.", 
        "2": "To realize such hybrid dialogue systems, this paper investigates determining whether or not a user is going to have a chat with the system.", 
        "3": "To address the lack of benchmark datasets for this task, we construct a new dataset consisting of 15, 160 utterances collected from the real log data of a commercial intelligent assistant (and will release the dataset to facilitate future research activity).", 
        "4": "In addition, we investigate using tweets and Web search queries for handling open-domain user utterances, which characterize the task of chat detection.", 
        "5": "Experiments demonstrated that, while simple supervised methods are effective, the use of the tweets and search queries further improves the F1-score from 86.21 to 87.53."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1308–1319 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1120  1 Introduction    1.1 Chat detection  Conventional studies on spoken dialogue systems (SDS) have investigated either domain-specific task-oriented SDS1 (Williams and Young, 2007) or open-domain non-task-oriented SDS (a.k.a., chatbots or chat-oriented SDS) (Wallace, 2009).", 
        "2": "The former offers convenience by helping users complete tasks in specific domains, while the latter\n∗Work done during internship at Yahoo Japan Corporation.", 
        "3": "1They can be classified as single-domain or multi-domain task-oriented SDS.", 
        "4": "offers entertainment through open-ended chatting (or smalltalk) with users.", 
        "5": "Although the functionalities offered by the two types of SDS are complementary to each other, little practical effort has been made to combine them.", 
        "6": "This unfortunately has limited the potential of SDS.", 
        "7": "This situation is now being changed by the emergence of voice-activated intelligent assistants on smartphones and home electronics (e.g., Siri2 and Alexa3).", 
        "8": "These intelligent assistants typically perform various tasks (e.g., Web search, weather checking, and alarm setting) while being able to have chats with users.", 
        "9": "They can be seen as a novel hybrid of multi-domain task-oriented SDS and open-domain non-task-oriented SDS.", 
        "10": "To realize such hybrid SDS, we have to determine whether or not a user is going to have a chat with the system.", 
        "11": "For example, if a user says “What is your hobby?” it is considered that she is going to have a chat with the system.", 
        "12": "On the other hand, if she says “Set an alarm at 8 o’clock,” she is probably trying to operate her smartphone.", 
        "13": "We refer to this task as chat detection and treat it as a binary classification problem.", 
        "14": "Chat detection has not been explored enough in past studies.", 
        "15": "This is primarily because little attempts have been made to develop hybrids of task-oriented and non-task-oriented SDS (see Section 2 for related work).", 
        "16": "Although task-oriented and non-task-oriented SDS have long research histories, both of them do not require chat detection.", 
        "17": "Typically, users of task-oriented SDS do not have chats with the systems and users of non-taskoriented SDS always have chats with the systems.", 
        "18": "1.2 Summary of this paper  In this work, we construct a new dataset for chat detection.", 
        "19": "As we already discussed, chat detection\n2http://www.apple.com/ios/siri 3https://developer.amazon.com/alexa\n1308\nhas not been explored enough, and thus there exist no benchmark datasets available.", 
        "20": "To address this situation, we collected 15, 160 user utterances from real log data of a commercial intelligent assistant, and recruited crowd workers to annotate those utterances with whether or not the users are going to have chats with the intelligent assistant.", 
        "21": "The resulting dataset will be released to facilitate future studies.", 
        "22": "The technical challenge in chat detection is that we have to handle open-ended utterances of intelligent assistant users.", 
        "23": "Commercial intelligent assistants have a vast amount of users and they talk about a wide variety of topics especially when chatting with the assistants.", 
        "24": "It consequently becomes labor-intensive to collect a sufficiently large amount of annotated data for training accurate chat detectors.", 
        "25": "We develop supervised binary classifiers to perform chat detection.", 
        "26": "We address the open-ended user utterances, which characterize chat detection, by using unlabeled external resources.", 
        "27": "We specifically utilize tweets (i.e., Twitter posts) and Web search queries to enhance the supervised classifiers.", 
        "28": "Experimental results demonstrated that, while simple supervised methods are effective, the external resources are able to further improve them.", 
        "29": "The results demonstrated that the use of the external resources increases over 1 point of F1-score (from 86.21 to 87.53).", 
        "30": "2 Related Work    2.1 Previous studies on combining task-oriented and non-task-oriented SDS  Task-oriented and non-task-oriented SDS have long been investigated independently, and little attempts have been made to develop hybrids of the two types of SDS.", 
        "31": "As a consequence, previous studies have not investigated chat detection without only a few exceptions.4\nNiculescu and Banchs (2015) explored using non-task-oriented SDS as a back-off mechanism for task-oriented SDS.", 
        "32": "They, however, did not propose any concrete methods of automatically determining when to switch to non-task-oriented SDS.", 
        "33": "4Unfortunately, we cannot discuss little about chat detection in existing commercial intelligent assistants since most of their technical details have not been disclosed.", 
        "34": "We make the best effort to compensate for it by comparing the proposed methods with our in-house intelligent assistant in the experiment.", 
        "35": "Lee et al.", 
        "36": "(2007) proposed an example-based dialogue manager to combine task-oriented and nontask-oriented SDS.", 
        "37": "In such a framework, however, it is difficult to flexibly utilize state-of-the-art supervised classifiers as a component.", 
        "38": "Other studies proposed machine-learning-based frameworks for combining multi-domain taskoriented SDS and non-task-oriented SDS (Wang et al., 2014; Sarikaya, 2017).", 
        "39": "These assume that several components including a chat detector are already available, and explore integrating those components.", 
        "40": "They discuss little on how to develop each of the components.", 
        "41": "On the other hand, the focus of this work is to develop one of those components, a chat detector.", 
        "42": "Although it lies outside the scope of this paper to explore how to exploit chat detection method in a full dialogue system, the chat detection method is considered to serve, for example, as one component within those frameworks.", 
        "43": "2.2 Intent and domain determination  Chat detection is related to, but different from, intent and domain determination that have been studied in the field of SDS (Guo et al., 2014; Xu and Sarikaya, 2014; Ravuri and Stolcke, 2015; Kim et al., 2016; Zhang and Wang, 2016).", 
        "44": "Both intent and domain determination have been investigated in domain-specific task-oriented SDS.", 
        "45": "Intent determination aims to determine the type of information a user is seeking in singledomain task-oriented SDS.", 
        "46": "For example, in the ATIS dataset, which is collected from an airline travel information service system, the information type includes flight, city, and so on (Tur et al., 2010).", 
        "47": "On the other hand, domain determination aims to determine which domain is relevant to a given user utterance in multi-domain task-oriented SDS (Xu and Sarikaya, 2014).", 
        "48": "Note that it is possible that domain determination is followed by intent determination.", 
        "49": "Unlike intent and domain determination, chat detection targets hybrid systems of multi-domain task-oriented SDS and open-domain non-taskoriented SDS, and aims to determine whether the non-task-oriented component is responsible to a given user utterance or not (i.e., the user is going to have a chat or not).", 
        "50": "Therefore, the objective of chat detection is different from intent and domain determination.", 
        "51": "It may be possible to see chat detection as a spe-\ncific problem of domain determination (Sarikaya, 2017).", 
        "52": "We, nevertheless, discuss it as a different problem because of the uniqueness of the “chat domain.” It greatly differs from ordinary domains in that it plays a role of combining the two different types of SDS that have long been studied independently, rather than combining multiple SDS of the same types.", 
        "53": "In addition, we discuss the use of external resources, especially tweets, for chat detection.", 
        "54": "This approach is unique to chat detection and is not considered effective for ordinary domain determination.", 
        "55": "It is interesting to note that chat detection is not followed by slot-filling unlike intent and domain determination, as far as we use a popular response generator such as seq2seq model (Sutskever et al., 2014) or an information retrieval based approach (Yan et al., 2016).", 
        "56": "Although joint intent (or domain) determination and slot-filling has been widely studied to improve accuracy (Guo et al., 2014; Zhang and Wang, 2016), the same approach is not feasible in chat detection.", 
        "57": "2.3 Intelligent assistant  Previous studies on intelligent assistants have not investigated chat detection.", 
        "58": "Their research topics are centered around those on user behaviors including the prediction of user satisfaction and engagement (Jiang et al., 2015; Kobayashi et al., 2015; Sano et al., 2016; Kiseleva et al., 2016a,b) and gamification (Otani et al., 2016).", 
        "59": "For example, Jiang et al.", 
        "60": "(2015) investigated predicting whether users are satisfied with the responses of intelligent assistants by combining diverse features including clicks and utterances.", 
        "61": "Sano et al.", 
        "62": "(2016) explored predicting whether users will keep using the intelligent assistants in the future by using long-term usage histories.", 
        "63": "Some earlier works used the Cortana dataset as a benchmark of domain determination (Guo et al., 2014; Xu and Sarikaya, 2014; Kim et al., 2016) or proposed a development framework for Cortana (Crook et al., 2016).", 
        "64": "Those studies, however, regarded the intelligent assistant as merely one example of multi-domain task-oriented SDS and did not explore chat detection.", 
        "65": "2.4 Non-task-oriented SDS  Non-task-oriented SDS have long been studied in the research community.", 
        "66": "While early studies adopted rule-based methods (Weizenbaum, 1966; Wallace, 2009), statistical approaches have re-\ncently gained much popularity (Ritter et al., 2011; Vinyals and Le, 2015).", 
        "67": "This research direction was pioneered by Ritter et al.", 
        "68": "(2011), who applied a phrase-based SMT model to the response generation.", 
        "69": "Later, Vinyals and Le (2015) used the seq2seq model (Sutskever et al., 2014).", 
        "70": "To date, a number follow-up studies have been made to improve on the response quality (Hasegawa et al., 2013; Shang et al., 2015; Sordoni et al., 2015; Li et al., 2016a,b; Gu et al., 2016; Yan et al., 2016).", 
        "71": "Those studies assume that users always want to have chats with systems and investigate only methods of generating appropriate responses to given utterances.", 
        "72": "Chat detection is required for integrating those response generators into intelligent assistants.", 
        "73": "2.5 Use of conversational data  The recent explosion of conversational data on the Web, especially tweets, have triggered a variety of dialogue studies.", 
        "74": "Those typically used tweets either for training response generators (c.f., Section 2.4) or for discovering dialogue acts in an unsupervised fashion (Ritter et al., 2010; Higashinaka et al., 2011).", 
        "75": "This treatment of tweets differs from that in our work.", 
        "76": "3 Chat Detection Dataset  In this section we explain how we constructed the new benchmark dataset for chat detection.", 
        "77": "We then analyze the data to provide insights into the actual user behavior.", 
        "78": "3.1 Construction procedure  We sampled 15, 160 unique utterances5 (i.e., automatic speech recognition results) from the real log data of a commercial intelligent assistant, Yahoo!", 
        "79": "Voice Assist.6 The log data were collected between Jan. and Aug. 2016.", 
        "80": "In the log data, some utterances such as “Hello” appear frequently.", 
        "81": "To construct a dataset containing both high and low frequency utterances, we set frequency thresholds7 to divide the utterances into three groups (high, middle, and low frequency) and then randomly sampled the same number of utterances\n5The utterances are all in Japanese.", 
        "82": "Example utterances given in this paper are English translations.", 
        "83": "6https://v-assist.yahoo.co.jp 7We cannot disclose the exact threshold values so as to keep the detailed statistics of the original log data confidential.", 
        "84": "from each of the three groups.", 
        "85": "During the data collection, we ensured privacy by manually removing utterances that included the full name of a person or detailed address information.", 
        "86": "Next, we recruited crowd workers to annotate the 15, 160 utterances with two labels, CHAT and NONCHAT.", 
        "87": "The workers annotated the CHAT label when users were going to have chats with the intelligent assistant and annotated the NONCHAT label when users were seeking some information (e.g., searching the Web or checking the weather) or were trying to operate the smartphones (e.g., setting alarms or controlling volume).", 
        "88": "Note that our intelligent assistant works primarily on smartphones and thus the NONCHAT utterances include many operational instructions such as alarm setting.", 
        "89": "Example utterances are given in Table 1.", 
        "90": "Seven workers were assigned to each utterance, and the final labels were obtained by majority vote to address the quality issue inherent in crowdsourcing.", 
        "91": "The last column in Table 1 shows the number of votes that the majority label obtained.", 
        "92": "For example, five workers provided the CHAT label (and the other two provided the NONCHAT label) to the first utterance “Let’s talk about something.”  3.2 Data analysis  The construction process described above yielded a dataset made up of 4, 833 CHAT and 10, 327 NONCHAT utterances.", 
        "93": "We investigated the annotation agreement among the crowd workers.", 
        "94": "Table 2 shows the distribution of the numbers of votes that the majority labels obtained.", 
        "95": "The annotation given by the seven workers agreed perfectly in 5, 811 of the 15, 160 utterances (38%).", 
        "96": "Also, at least six workers agreed in the majority of cases, 10, 789 (= 4, 978 + 5, 811) utterances (71%).", 
        "97": "This indicates high agreement among the workers and the reliability of the annotation results.", 
        "98": "During the data construction, we found that a typical confusing case arises when the utterance can be interpreted as an implicit information request.", 
        "99": "For example, the utterance “I am hungry” can be seen as the user trying to have a chat with the assistant, but it might be the case that she is looking for a local restaurant.", 
        "100": "Similar examples include “I have a backache” and so on.", 
        "101": "One solution in this case might be to ask the user a clarification question (Schlöder and Fernandez, 2015).", 
        "102": "Such an exploration is left for our future research.", 
        "103": "Additionally, we manually classified the CHAT utterances according to their dialogue acts to figure out how real users have chats with the intelligent assistant (Table 3).", 
        "104": "The set of dialogue acts was designed by referring to (Meguro et al., 2010).", 
        "105": "As shown in Table 3, while some of the utterances are boilerplates (e.g., those in the GREETING act) and thus have limited variety, the majority of the utterances exhibit tremendous diversity.", 
        "106": "We see\na wide variety of topics including private issues (e.g., “I am free today”) and questions to the assistant (e.g., “Are you angry?”).", 
        "107": "Also, we even see a movie quote (“May the force be with you”) and a rooster crow (“Cock-a-doodle-doo”) in the MISC act.", 
        "108": "These clearly represent the open-domain nature of the user utterances in intelligent assistants.", 
        "109": "Interestingly, some users curse at the intelligent assistant probably because it failed to make appropriate responses (see the CURSE act).", 
        "110": "Although such user behavior would not be observed from paid research participants, we observe a certain amount of curse utterances in the real data.", 
        "111": "4 Detection Method  We formulate chat detection as a binary classification problem to train supervised classifiers.", 
        "112": "In this section, we first explain the two types of classifiers explored in this paper, and then investigate the use of external resources for enhancing those classifiers.", 
        "113": "4.1 Base classifiers  The first classifier utilizes SVM for its popularity and efficiency.", 
        "114": "It uses character and word ngram (n = 1 and 2) features.", 
        "115": "It also uses word embedding features (Turian et al., 2010).", 
        "116": "A skipgram model (Mikolov et al., 2013) is trained on\nthe entire intelligent assistant log8 to learn word embeddings.", 
        "117": "The embeddings of the words in the utterance are then averaged to produce additional features.", 
        "118": "The second classifier uses a convolutional neural network (CNN) because it has recently proven to perform well on text classification problems (Kim, 2014; Johnson and Zhang, 2015a,b).", 
        "119": "We follow (Kim, 2014) to develop a simple CNN that has a single convolution and max-pooling layer followed by the soft-max layer.", 
        "120": "We use a rectified linear unit (ReLU) as the non-linear activation function.", 
        "121": "The same word embeddings as SVM are used for the pre-training.", 
        "122": "4.2 Using external resources  We next investigate using external resources for enhancing the base classifiers.", 
        "123": "Thanks to the rapid evolution of the Web in the past decade, a variety of textual data including not only conversational (i.e., chat-like) but also non-conversational ones are abundantly available nowadays.", 
        "124": "These data offer an effective way of enhancing the base classifiers.", 
        "125": "We specifically use tweets and Web search queries as conversational and non-conversational text data, respectively.", 
        "126": "We train character-based9 language models on 8We used the same log data used in Section 3.", 
        "127": "The detailed statistics is confidential.", 
        "128": "9We also trained word-based language models in prelim-\ntweets and Web search queries, and use their scores (i.e., the normalized log probabilities of the utterance) as two additional features.", 
        "129": "Let u = c1, c2, .", 
        "130": ".", 
        "131": ".", 
        "132": ", cm be an utterance made up of m characters.", 
        "133": "Then, the score scorer(u) of the language model trained on the external resource r ∈ {tweet, query} is defined as\nscorer(u) = 1\nm\nm∑\nt=1\nlog pr(ct | c1, .", 
        "134": ".", 
        "135": ".", 
        "136": ", ct−1).", 
        "137": "The GRU language model is adopted for its superior performance (Cho et al., 2014; Chung et al., 2014).", 
        "138": "Let xt be the embedding of t-th character and ht be the t-th hidden state.", 
        "139": "GRU computes the hidden state as\nht = (1− zt)⊙ ht−1 + zt ⊙ h̃t zt = σ(W (z)zt +U (z)ht−1)\nh̃t = tanh(W (h)xt +U (h)(rt ⊙ ht−1)) rt = σ(W (r)xt +U (r)ht−1)\nwhere ⊙ is the element-wise multiplication, σ is the sigmoid and tanh is the hyperbolic tangent.", 
        "140": "W(z), U(z), W(h), U(h), W(r), and U(r) are weight matrices.", 
        "141": "The hidden states are fed to the soft-max to predict the next word.", 
        "142": "We also use a binary feature indicating whether the utterance appears in the Web search query log\ninary experiments and found that character-based ones perform consistently better.", 
        "143": "or not.", 
        "144": "We observe that some NONCHAT utterances are made up of single entities such as location and product names.", 
        "145": "Such utterances are considered to be seeking information on those entities.", 
        "146": "We therefore use the query log as an entity dictionary to derive a feature indicating whether the utterance is likely to be a single entity.", 
        "147": "The resulting three features are incorporated into the SVM-based classifier straightforwardly (Figure 1).", 
        "148": "For the CNN-based classifier, they are provided as additional inputs to the soft-max layer (Figure 2).", 
        "149": "5 Experimental Results  We empirically evaluate the proposed methods on the chat detection dataset.", 
        "150": "5.1 Experimental settings  We performed 10-fold cross validation on the chat detection dataset to train and evaluate the proposed classifiers.", 
        "151": "In each fold, we used 80%, 10%, and 10% of the data for the training, development, and evaluation, respectively.", 
        "152": "We used word2vec10 to learn 300 dimensional word embeddings.", 
        "153": "They were used to induce the additional 300 features for SVM.", 
        "154": "They were also used as the pre-trained word embeddings for CNN.", 
        "155": "We used the faster-rnn toolkit11 to train the GRU language models.", 
        "156": "The size of the embedding and hidden layer was set to 256.", 
        "157": "Noise contrastive estimation (Gutmann and Hyvärinen, 2010) was used to train the soft-max function and the number of noise samples was set to 50.", 
        "158": "Maximum entropy 4-gram models were also trained to yield a combined model (Mikolov et al., 2011).", 
        "159": "The language models were trained on 100 millions tweets collected between Apr.", 
        "160": "and July 2016 and 100 million Web search queries issued between Mar.", 
        "161": "and Jun.", 
        "162": "2016.", 
        "163": "The tweets were sampled from those received replies to collect only conversational tweets (Ritter et al., 2011).", 
        "164": "The same Web search queries were used to derive the binary feature.", 
        "165": "Although it is difficult to release those data, we plan to make the feature values available together with the benchmark dataset.", 
        "166": "We used liblinear12 to train L2-regularized L2-loss SVM.", 
        "167": "The hyperparameter c was tuned 10https://code.google.com/archive/p/word2vec 11https://github.com/yandex/faster-rnnlm 12https://www.csie.ntu.edu.tw/˜cjlin/liblinear\nover {2−10, 2−9, .", 
        "168": ".", 
        "169": ".", 
        "170": ", 210}.", 
        "171": "The CNN was implemented with chainer.13 We tuned the number of feature maps over {100, 150}, and filter region sizes over {{2}, {3}, {1, 2}, {2, 3}, {3, 4}, {1, 2, 3}, {2, 3, 4}}.", 
        "172": "The mini-batch size was set to 32.", 
        "173": "The dropout rate was set to 0.5.", 
        "174": "We used Adam (α = 0.001, β1 = 0.9, β2 = 0.999, and ϵ = 10−8) to perform stochastic gradient descent (Kingma and Ba, 2015).", 
        "175": "5.2 Baselines  The following baseline methods were implemented for comparison:\nMajority Utterances are always classified as the majority class, NONCHAT.", 
        "176": "Tweet GRU Utterances are classified as CHAT if the score of the GRU language model trained on the tweets exceeds a threshold.", 
        "177": "We used exactly the same GRU language model as the one that was used for deriving the feature.", 
        "178": "The threshold was calibrated on the development data by maximizing the F1-score of the CHAT class.", 
        "179": "In-house IA Our in-house intelligent assistant system, which adopts a hybrid of rule-based and example-based approaches.", 
        "180": "Since we cannot disclose its technical details, the result is presented just for reference.", 
        "181": "5.3 Result  Table 4 gives the precision, recall, F1-score (for the CHAT class), and overall classification accuracy results.", 
        "182": "We report only accuracy for Majority baseline.", 
        "183": "+embed.", 
        "184": "and +pre-train.", 
        "185": "represent using the word embedding features for SVM\n13http://chainer.org\nand the pre-trained word embeddings for CNN, respectively.", 
        "186": "+tweet-query represents using the three features derived from the tweets and Web search query.", 
        "187": "Table 4 represents that both of the classifiers, SVM and CNN, perform accurately.", 
        "188": "We see that both +embed.", 
        "189": "and +pre-train.", 
        "190": "improve the results.", 
        "191": "The best performing method, SVM+embed.+tweet-query, achieves 92% accuracy and 87% F1-score, outperforming all of the baselines.", 
        "192": "CNN performed worse than SVM contrary to results reported by recent studies (Kim, 2014).", 
        "193": "We think this is because the architecture of our CNN is rather simplistic.", 
        "194": "It might be possible to improve the CNN-based classifier by adopting more complex network, although it is likely to come at the cost of extra training time.", 
        "195": "Another reason would be that our SVM classifier uses carefully designed features beyond word 1-grams.", 
        "196": "Table 4 also represents that the external resources are effective, improving F1-scores almost 1 points in both SVM and CNN.", 
        "197": "Table 5 illustrates example utterances and their language model scores.", 
        "198": "We see that the language models trained on the tweets and queries successfully provide the CHAT utterances with high and low scores, respectively.", 
        "199": "Table 6 shows chat detection results when each of the three features derived from the external resources is added to SVM+embed.", 
        "200": "The results represent that they are all worse than SVM+embed.+tweet-query and thus it is crucial to combine all of them for achieving the best performance.", 
        "201": "Table 7 shows examples of feature weights of SVM+embed.+tweet-query.", 
        "202": "Tweet GRU and query GRU denote the language model score features.", 
        "203": "The others are word n-gram features.", 
        "204": "We see that the language model scores have the large\npositive and negative weights, respectively.", 
        "205": "This indicates that effectiveness of the language models.", 
        "206": "We also see that the first person has a large positive weight, while terms related to device controlling (“call to” and “volume”) have large negative weights.", 
        "207": "Table 8 represents chat detection results of SVM+embd.+tweet-query across the numbers of votes that the majority label obtained.", 
        "208": "As expected, we see that all metrics get higher as the number of agreement among the crowd workers becomes larger.", 
        "209": "In fact, we see as much as 98% accuracy when all seven workers agree.", 
        "210": "This implies that utterances easy for humans to classify are also easy for the classifiers.", 
        "211": "5.4 Training data size  We next investigate the effect of the training data size on the classification accuracy.", 
        "212": "Figure 3 illustrates the learning curve.", 
        "213": "It represents that the classification accuracy improves almost monotonically as the training data size increases.", 
        "214": "Although our training data is by no means small, the shape of the learning curve nevertheless suggests that further improvement would be achieved by adding more training data.", 
        "215": "This im-\nplies that a very large amount of training data are required for covering open-domain utterances in intelligent assistants.", 
        "216": "The figure at the same time represents the usefulness of the external resources.", 
        "217": "We see that SVM+embed.+tweet-query trained on about 25% of the training data is able to achieve comparable accuracy with SVM+embed.", 
        "218": "trained on the entire training data.", 
        "219": "This result suggests that the external resources are able to compensate for the scarcity of annotated data.", 
        "220": "5.5 Utterance length  We finally investigate how the utterance length correlates with the classification accuracy.", 
        "221": "Fig-\nure 4 illustrates the classification accuracies of SVM+embed.", 
        "222": "and SVM+embed.+tweet-query for each utterance length in the number of characters.", 
        "223": "Figure 4 reveals that the difference between the two proposed methods is evident in short utterances (i.e., ≤ 5).", 
        "224": "This is because those utterances are too short to contain sufficient information required for classification, and the additional features are helpful.", 
        "225": "We note that Japanese writing system uses ideograms and thus even five characters is enough to represent a simple sentence.", 
        "226": "We also see a clear difference in longer utterances (i.e., 15 ≤) as well.", 
        "227": "We consider those long utterances are difficult to classify because some words in the utterances are irrelevant for the classification and the n-gram and embedding features include those irrelevant ones.", 
        "228": "On the other hand, we consider that the language model scores are good at capturing stylistic information irrespective of the utterance length.", 
        "229": "6 Future Work  As discussed in Section 3.2, some user utterances such as “I am hungry” are ambiguous in nature and thus are difficult to handle in the current framework.", 
        "230": "An important future work is to develop a sophisticated dialogue manager to handle such utterances, for example, by making clarification questions (Schlöder and Fernandez, 2015).", 
        "231": "We manually investigated the dialogue acts in the chat detection dataset (c.f., Section 3.2).", 
        "232": "It is interesting to automatically determine the dialogue acts to help producing appropriate system responses.", 
        "233": "Some related studies exist in such a research direction (Meguro et al., 2010).", 
        "234": "Although we used only text data to perform\nchat detection, we can also utilize contextual information such as the previous utterances (Xu and Sarikaya, 2014), the acoustic information (Jiang et al., 2015), and the user profile (Sano et al., 2016).", 
        "235": "It is an interesting research topic to use such contextual information beyond text.", 
        "236": "It is considered promising to make use of a neural network for integrating such heterogeneous information.", 
        "237": "An automatic speech recognition (ASR) error is a popular problem in SDS, and previous studies have proposed sophisticated techniques, including re-ranking (Morbini et al., 2012) and POMDP (Williams and Young, 2007), for addressing the ASR errors.", 
        "238": "Incorporating these techniques into our methods is also an important future work.", 
        "239": "Although the studies on non-task-oriented SDS have made substantial progress in the past few years, it unfortunately remains difficult for the systems to fluently chat with users (Higashinaka et al., 2015).", 
        "240": "Further efforts on improving nontask-oriented dialogue systems is an important future work.", 
        "241": "7 Conclusion  This paper investigated chat detection for combining domain-specific task-oriented SDS and opendomain non-task-oriented SDS.", 
        "242": "To address the scarcity of benchmark datasets for this task, we constructed a new benchmark dataset from the real log data of a commercial intelligent assistant.", 
        "243": "In addition, we investigated using the external resources, tweets and Web search queries, to handle open-domain user utterances, which characterize the task of chat detection.", 
        "244": "The empirical experiment demonstrated that the off-the-shelf supervised methods augmented with the external resources perform accurately, outperforming the baseline approaches.", 
        "245": "We hope that this study contributes to remove the long-standing boundary between task-oriented and non-task-oriented SDS.", 
        "246": "To facilitate future research, we are going to release the dataset together with the feature values derived from the tweets and Web search queries.14  Acknowledgments  We thank Manabu Sassano, Chikara Hashimoto, Naoki Yoshinaga, and Masashi Toyoda for fruitful discussions and comments.", 
        "247": "We also thank the anonymous reviewers.", 
        "248": "14https://research-lab.yahoo.co.jp/en/ software"
    }, 
    "document_id": "P17-1120.pdf.json"
}
