{
    "abstract_sentences": {
        "1": "The availability of the Rhetorical Structure Theory (RST) Discourse Treebank has spurred substantial research into discourse analysis of written texts; however, limited research has been conducted to date on RST annotation and parsing of spoken language, in particular, nonnative spontaneous speech.", 
        "2": "Considering that the measurement of discourse coherence is typically a key metric in human scoring rubrics for assessments of spoken language, we initiated a research effort to obtain RST annotations of a large number of non-native spoken responses from a standardized assessment of academic English proficiency.", 
        "3": "The resulting inter-annotator κ agreements on the three different levels of Span, Nuclearity, and Relation are 0.848, 0.766, and 0.653, respectively.", 
        "4": "Furthermore, a set of features was explored to evaluate the discourse structure of non-native spontaneous speech based on these annotations; the highest performing feature showed a correlation of 0.612 with scores of discourse coherence provided by expert human raters."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 263–268 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2041  1 Introduction  The spread of English as the global language of education and commerce is continuing, and there is a strong interest in developing assessment systems that can automatically score spontaneous speech from non-native speakers with the goals of reducing the burden on human raters, improving reliability, and generating feedback that can be used by language learners.", 
        "2": "Discourse coherence, which refers to the conceptual relations be-\ntween different units within a response, is an important aspect of communicative competence, as is reflected in human scoring rubrics for assessments of non-native English (ETS, 2012).", 
        "3": "However, discourse-level features have rarely been investigated in the context of automated speech scoring.", 
        "4": "This study aims to construct a discourselevel annotation of non-native spontaneous speech in the framework of Rhetorical Structure Theory (RST) (Mann and Thompson, 1988), which can then be used in automated discourse analysis and coherence measurement for non-native spoken responses, thereby improving the validity of the automated scoring systems.", 
        "5": "RST is a descriptive framework that has been widely used in the analysis of discourse organization of written texts (Taboada and Mann, 2006b), and has been applied to various natural language processing tasks, including language generation, text summarization, and machine translation (Taboada and Mann, 2006a).", 
        "6": "In particular, the availability of RST annotations on a selection of 385 Wall Street Journal articles from the Penn Treebank1 (Carlson et al., 2001) has facilitated RST-based discourse analysis of written texts, since it provides a standard benchmark for comparing the performance of different techniques for document-level discourse parsing (Joty et al., 2013; Feng and Hirst, 2014).", 
        "7": "Another important application of RST closely related to our research is the automated evaluation of discourse in student essays.", 
        "8": "For example, one study used features for each sentence in an essay to reflect the status of its parent node as well as its rhetorical relation based on automatically parsed RST trees with the goal of providing feedback to students about the discourse structure in the essay (Burstein et al., 2003).", 
        "9": "Another study compared\n1https://catalog.ldc.upenn.edu/ LDC2002T07\n263\nfeatures derived from deep hierarchical discourse relations based on RST parsing and features derived from shallow discourse relations based on Penn Discourse Treebank (PDTB) (Prasad et al., 2008) parsing in the task of essay scoring and demonstrated the effectiveness of deep discourse structure in better differentiation of text coherence (Feng et al., 2014).", 
        "10": "Related work has also been conducted to annotate discourse relations in spoken language, which is produced and processed differently from written texts (Rehbein et al., 2016), and often lacks explicit discourse connectives that are more frequent in written language.", 
        "11": "Instead of the rootedtree structure that is employed in RST, the annotation scheme with shallow discourse structure and relations from the PDTB (Prasad et al., 2008) has been generally used for spoken language (Demirahin and Zeyrek, 2014; Stoyanchev and Bangalore, 2015).", 
        "12": "For example, Tonelli et al.", 
        "13": "adapted the PDTB annotation scheme to annotate discourse relations in spontaneous conversations in Italian (Tonelli et al., 2010) and Rehbein et al.", 
        "14": "compared two frameworks, PDTB and CCR (Cognitive approach to Coherence Relations) (Sanders et al., 1992), for the annotation of discourse relations in spoken language (Rehbein et al., 2016).", 
        "15": "In contrast to these previous studies, this study focuses on monologic spoken responses produced by non-native speakers within the context of a language proficiency assessment.", 
        "16": "A discourse annotation scheme based on the RST framework was selected due to the fact that it can effectively demonstrate the deep hierarchical discourse structure across an entire response, rather than focusing on the local coherence of adjacent units.", 
        "17": "2 Data  This study obtained manual RST annotations on a corpus of 600 spoken responses drawn from a large-scale, high-stakes standardized assessment of English for non-native speakers, the TOEFL R© Internet-based Test (TOEFL R© iBT), which assesses English communication skills for academic purposes (ETS, 2012).", 
        "18": "The speaking section of the TOEFL iBT assessment contains six tasks, each of which requires the test taker to provide an unscripted spoken response 45 or 60 seconds in duration.", 
        "19": "The corpus used in this study includes 100 responses from each of six different test questions that comprise two different speaking tasks:\n1) Independent questions: providing an opinion based on personal experience (N = 200 responses) and 2) Integrated questions: summarizing or discussing material provided in a reading and/or listening passage (N = 400 responses).", 
        "20": "The spoken responses were all manually transcribed using standard punctuation and capitalization.", 
        "21": "The average number of words per response is 104.4 (st. dev.", 
        "22": "= 34.4) and the average number of sentences is 5.5 (st. dev.", 
        "23": "= 2.1).", 
        "24": "The spoken responses were all provided with holistic English proficiency scores on a scale of 1 to 4 by expert human raters in the context of operational, high-stakes scoring for the spoken language assessment.", 
        "25": "The scoring rubrics address the following three main aspects of speaking proficiency: delivery (pronunciation, fluency, prosody), language use (grammar and lexical choice), and topic development (content and coherence).", 
        "26": "In order to ensure a sufficient quantity of responses from each proficiency level, 25 responses were selected randomly from each of the 4 score points for each of the 6 test questions.", 
        "27": "The current study builds on a previous study that investigated approaches for modeling discourse coherence in non-native spontaneous speech (but which did not consider the hierarchical rhetorical structure of speech) (Wang et al., 2013).", 
        "28": "In that study, each spoken response in the same corpus that was used for the current study was provided with global discourse coherence scores.", 
        "29": "Two expert annotators (not drawn from the pool of expert human raters who provided the holistic scores) provided each response with a score on a scale of 1 to 3 based on the orthographic transcriptions of the spoken response.", 
        "30": "The three score points were defined as follows: 3 = highly coherent (contains no instances of confusing arguments or examples), 2 = somewhat coherent (contains some awkward points in which the speaker’s line of argument is unclear), 1 = barely coherent (the entire response was confusing and hard to follow).", 
        "31": "In addition, the annotators were specifically required to ignore disfluencies and grammatical errors as much as possible.", 
        "32": "The interannotator agreement for these coherence scores was κ = 0.68.", 
        "33": "These discourse coherence scores are reused in the current study (along with the holistic profiency scores presented above) to evaluate the performance of features measuring discourse coherence based on the RST annotations.", 
        "34": "3 Annotation    3.1 Guidelines  We used a modified version of the tagging reference manual for the RST Discourse Treebank (Carlson and Marcu, 2001) for this study.", 
        "35": "According to these guidelines, annotators segment a transcribed spoken response into Elementary Discourse Unit (EDU) spans of text (corresponding to clauses or clause-like units), and indicate rhetorical relations between non-overlapping spans which typically consist of a nucleus (the most essential information in the rhetorical relation) and a satellite (supporting or background information).", 
        "36": "In contrast to well-formed written text, non-native spontaneous speech frequently contains ungrammatical sentences, disfluencies, fillers, hesitations, false starts, and unfinished utterances.", 
        "37": "In some cases, these spoken responses do not constitute coherent, well-formed discourse.", 
        "38": "On the other hand, spoken responses are relatively shorter and comprise simpler discourse structures with fewer relations, which simplifies the RST annotation task in comparison to written text.", 
        "39": "In order to account for these differences, we created an addendum to the RST Discourse Treebank manual introducing the following additional relations: Disfluency relations (in which the disfluent span is the satellite and the corresponding fluent span is the nucleus), Awkward relations (corresponding to portions of the response where the speaker’s discourse structure is infelicitous; awkward relations are based on pre-existing relations, such as awkward-Reason, if the intended relation is clear but is expressed incoherently or are labeled as awkward-Other if there is no clear relation between the awkward EDU and the surrounding discourse), Unfinished Utterance relations (representing EDUs at the end of a response that are incomplete because the test taker ran out of time in which the incomplete span is the satellite and the root node of the discourse tree is the nucleus), and Discourse Particle relations (such as you know and right, which are satellites of adjacent spans).", 
        "40": "The discourse annotation tool used in the RST Discourse Treebank2 was also adopted for this study.", 
        "41": "Using this tool, annotators incrementally build hierarchical discourse trees in which the leaves are the EDUs and the internal nodes correspond to contiguous spans of text.", 
        "42": "When the an-\n2Downloaded from http://www.isi.edu/ licensed-sw/RSTTool/index.html\nnotators assign the rhetorical relation for a node of the tree, they provide the relation’s label (drawn from the pre-defined set of relations in the annotation guidelines) and also indicate whether the spans that comprise the relation are nuclei or satellites.", 
        "43": "Figure 1 shows an example of an annotated RST tree for a response with a proficiency score of 1.", 
        "44": "This response includes three disfluencies (EDUs 3, 6, and 9), which are satellites of the corresponding repair nuclei.", 
        "45": "In addition, the response also includes an awkward Comment-Topic relation between EDU 2 and the node combining EDUs 3-11, indicated by awkward-CommentTopic-2; in this multinuclear relation, the annotator judged that the second branch of the relation was awkward, which is indicated by the 2 that was appended to the relation label.", 
        "46": "3.2 Pilot Annotation  The manual annotations were provided by two experts with prior experience in various types of data annotation on both text and speech.", 
        "47": "First, a pilot annotation was conducted to train and calibrate the annotators based on 48 training samples drawn from the TOEFL R© Practice Online (TPO) product3, which offers practice tests simulating the TOEFL iBT testing experience with authentic test questions.", 
        "48": "The training samples were selected from a TPO test form with 6 test questions and were balanced according to test question and proficiency score, i.e., 2 responses from each score level for each question.", 
        "49": "Human annotators were trained in a two-step process: 1) after a comprehensive study of the annotation guidelines described in Section 3.1, the two annotators were initially trained with 16 TPO responses (8 responses from an Independent question and 8 responses from an Integrated question) by first performing independent annotation and then resolving all disagreements through a discussion of the guidelines; 2) another round of training was conducted on an additional set of 32 TPO responses (8 responses from an Independent question and 24 responses from an Integrated question).", 
        "50": "Each annotator first annotated this set of 32 responses independently; the two annotators subsequently conducted a thorough joint review and discussion of each other’s annotations in order to resolve all disagreements on this set.", 
        "51": "In order to measure the human agreement on\n3https://toeflpractice.ets.org/\nthe EDU segmentation task, we first converted the segmentation sequences into 0/1 sequences: for each word in a response, 1 is assigned if a segment boundary exists after the word; otherwise, 0 is assigned.", 
        "52": "The inter-annotator agreement rate on the EDU segmentations of the 32 pilot samples (from stage 2) was κ = 0.876.", 
        "53": "On the hierarchical tree building task, inter-annotator agreement was evaluated on the levels of Span (assignment of discourse segment), Nuclearity (assignment of nucleus vs. satellite), and Relation (assignment of rhetorical relation) using κ, as described in (Marcu et al., 1999); on the 32 samples, the κ values are 0.861, 0.769, and 0.631 for the three levels, respectively.", 
        "54": "3.3 Formal Annotation  For the formal annotation on the full set of 600 TOEFL spoken responses, 120 responses from 6 test questions (5 responses from each score level from each question) were selected for double annotation, and the remaining 480 responses received a single annotation.", 
        "55": "The 120 double-annotated responses were split into two batches of equal size and the two annotators each performed EDU segmentation independently on one of the batches.", 
        "56": "Subsequently, the annotators reviewed each other’s EDU segmentations and adjudicated all disagreements to obtain gold-standard EDU segmentation for the 120 responses in the double-annotation set.", 
        "57": "The average number of EDUs per response in the two batches in this set of 120 responses were 15.1 and 14.1.", 
        "58": "The annotators subsequently performed the remaining steps of RST annotation (assigning the relations, nuclearity, and hierarchical structure) independently on all 120 responses using the adjudicated EDU segmentations.", 
        "59": "Table 1 shows that the κ agreements on the three levels of Span, Nucle-\narity, and Relation are 0.848, 0.766, and 0.653, respectively.", 
        "60": "Besides the κ evaluation, the standard ways of F1-Measure on three levels of Span, Nuclearity, and Relation (Marcu, 2000), commonly used to evaluate the performance of RST parsers, are also reported in Table 1.", 
        "61": "The F1-measures were calculated according to each pair of trees from two annotators on the same sample and then averaged across all samples, i.e., a macroaveraged F1-measure.", 
        "62": "The human agreement results also indicate that two annotators tend to agree better on responses from speakers with higher speaking proficiency levels.", 
        "63": "This is demonstrated by positive correlations between the F1 agreement scores and the human proficiency ratings: 0.197 for Span annotations, 0.210 for Nuclearity, and 0.188 for Relation.", 
        "64": "In addition, we also examined the distribution of the manually identified awkward relations.", 
        "65": "As shown in Table 2, awkward points occur with higher frequency in responses with lower proficiency scores.", 
        "66": "4 Discourse Features  The ultimate aim of this line of research is to use an RST-annotated corpus to investigate features for automatically assessing discourse structure in spontaneous non-native speech.", 
        "67": "Using the annotated discourse trees, we extracted several different features based on the distribution of relations and the structure of the trees, including the number of EDUs (n edu), the number of relations (n rel), the number of awkward relations (n awk rel), the number of rhetorical relations, i.e., relations that were neither classified as awkward nor as a disfluency (n rhe rel), the number of different types of rhetorical relations (n rhe relTypes), the percentage of rhetorical relations (perc rhe rel) out of all relations, the depth of the RST trees (tree depth), and the ratio between n edu and tree depth (ratio nedu depth).", 
        "68": "Table 3 lists the Pearson correlation coefficients of these features with both the holistic proficiency scores and the discourse coherence scores and demonstrates the effectiveness of these features.", 
        "69": "The n rhe rel feature achieves the highest correlation of 0.691 with the holistic proficiency scores, and the normalized feature perc rhe rel achieves the highest correlation of 0.612 with the discourse coherence scores.", 
        "70": "It is interesting to note that RSTbased discourse features generally have higher correlations with the holistic speaking proficiency scores than with the more specific discourse coherence scores.", 
        "71": "This result is somewhat unexpected, since the holistic proficiency scores are based only partially on discourse coherence and also cover other aspects of speaking proficiency, such as pronunciation, fluency, grammar, and vocabulary.", 
        "72": "One potential explanation for the higher correlations could be the difference in score range (1-4 for the holistic proficiency scores and 1-3 for the discourse scores).", 
        "73": "In addition, as described in Section 2, the data set used in this study was created using a stratified random sample with an even distribution of holistic scores (which may increase the features’ correlations with holistic scores), but this constraint does not apply to the discourse coherence scores.", 
        "74": "5 Conclusion and Future Work  In this study, we obtained discourse coherence annotations based on Rhetorical Structure Theory for a corpus of 600 non-native spontaneous spoken responses drawn from a standardized assess-\nment of non-native English.", 
        "75": "The RST annotation results show that the annotators achieved similar inter-annotator agreement rates as have been reported in previous studies that investigated wellformed written text (Marcu et al., 1999).", 
        "76": "In addition, we demonstrate the potential of using features derived from these RST annotations for assessing non-native spoken English through moderately high correlations with both holistic speaking proficiency scores and discourse coherence scores; the highest performing feature when evaluated on the discourse coherence scores provided by expert raters was the percentage of rhetorical relations in the entire spoken response (perc rhe rel), with a correlation of 0.612.", 
        "77": "In the future, we will continue this work by addressing the following main research questions: a) how can we develop additional effective features from the discourse trees; b) how well can an automatic discourse parser trained on the obtained annotations perform; c) how well will the proposed features perform when extracted using an automatic RST parser; d) how well will the features perform when using an automated speech recognizer (rather than human transcribers) to obtain the textual transcriptions of a spoken response."
    }, 
    "document_id": "P17-2041.pdf.json"
}
