{
    "abstract_sentences": {
        "1": "Keyphrase provides highly-summative information that can be effectively used for understanding, organizing and retrieving text content.", 
        "2": "Though previous studies have provided many workable solutions for automated keyphrase extraction, they commonly divided the to-be-summarized content into multiple text chunks, then ranked and selected the most meaningful ones.", 
        "3": "These approaches could neither identify keyphrases that do not appear in the text, nor capture the real semantic meaning behind the text.", 
        "4": "We propose a generative model for keyphrase prediction with an encoder-decoder framework, which can effectively overcome the above drawbacks.", 
        "5": "We name it as deep keyphrase generation since it attempts to capture the deep semantic meaning of the content with a deep learning method.", 
        "6": "Empirical analysis on six datasets demonstrates that our proposed model not only achieves a significant performance boost on extracting keyphrases that appear in the source text, but also can generate absent keyphrases based on the semantic meaning of the text.", 
        "7": "Code and dataset are available at https://github.com/memray/seq2seqkeyphrase."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 582–592 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1054  1 Introduction  A keyphrase or keyword is a piece of short, summative content that expresses the main semantic meaning of a longer text.", 
        "2": "The typical use of a keyphrase or keyword is in scientific publications to provide the core information of a paper.", 
        "3": "We use\n∗Corresponding author\nthe term “keyphrase” interchangeably with “keyword” in the rest of this paper, as both terms have an implication that they may contain multiple words.", 
        "4": "High-quality keyphrases can facilitate the understanding, organizing, and accessing of document content.", 
        "5": "As a result, many studies have focused on ways of automatically extracting keyphrases from textual content (Liu et al., 2009; Medelyan et al., 2009a; Witten et al., 1999).", 
        "6": "Due to public accessibility, many scientific publication datasets are often used as test beds for keyphrase extraction algorithms.", 
        "7": "Therefore, this study also focuses on extracting keyphrases from scientific publications.", 
        "8": "Automatically extracting keyphrases from a document is called keypharase extraction, and it has been widely used in many applications, such as information retrieval (Jones and Staveley, 1999), text summarization (Zhang et al., 2004), text categorization (Hulth and Megyesi, 2006), and opinion mining (Berend, 2011).", 
        "9": "Most of the existing keyphrase extraction algorithms have addressed this problem through two steps (Liu et al., 2009; Tomokiyo and Hurst, 2003).", 
        "10": "The first step is to acquire a list of keyphrase candidates.", 
        "11": "Researchers have tried to use n-grams or noun phrases with certain part-of-speech patterns for identifying potential candidates (Hulth, 2003; Le et al., 2016; Liu et al., 2010; Wang et al., 2016).", 
        "12": "The second step is to rank candidates on their importance to the document, either through supervised or unsupervised machine learning methods with a set of manually-defined features (Frank et al., 1999; Liu et al., 2009, 2010; Kelleher and Luz, 2005; Matsuo and Ishizuka, 2004; Mihalcea and Tarau, 2004; Song et al., 2003; Witten et al., 1999).", 
        "13": "There are two major drawbacks in the above keyphrase extraction approaches.", 
        "14": "First, these methods can only extract the keyphrases that ap-\n582\npear in the source text; they fail at predicting meaningful keyphrases with a slightly different sequential order or those that use synonyms.", 
        "15": "However, authors of scientific publications commonly assign keyphrases based on their semantic meaning, instead of following the written content in the publication.", 
        "16": "In this paper, we denote phrases that do not match any contiguous subsequence of source text as absent keyphrases, and the ones that fully match a part of the text as present keyphrases.", 
        "17": "Table 1 shows the proportion of present and absent keyphrases from the document abstract in four commonly-used datasets, from which we can observe large portions of absent keyphrases in all the datasets.", 
        "18": "The absent keyphrases cannot be extracted through previous approaches, which further prompts the development of a more powerful keyphrase prediction model.", 
        "19": "Second, when ranking phrase candidates, previous approaches often adopted machine learning features such as TF-IDF and PageRank.", 
        "20": "However, these features only target to detect the importance of each word in the document based on the statistics of word occurrence and co-occurrence, and are unable to reveal the full semantics that underlie the document content.", 
        "21": "To overcome the limitations of previous studies, we re-examine the process of keyphrase prediction with a focus on how real human annotators would assign keyphrases.", 
        "22": "Given a document, human annotators will first read the text to get a basic understanding of the content, then they try to digest its essential content and summarize it into keyphrases.", 
        "23": "Their generation of keyphrases relies on an understanding of the content, which may not necessarily use the exact words that occur in the source text.", 
        "24": "For example, when human annotators see “Latent Dirichlet Allocation” in the text, they might write down “topic modeling” and/or “text mining” as possible keyphrases.", 
        "25": "In addition to the semantic understanding, human annotators\nmight also go back and pick up the most important parts, based on syntactic features.", 
        "26": "For example, the phrases following “we propose/apply/use” could be important in the text.", 
        "27": "As a result, a better keyphrase prediction model should understand the semantic meaning of the content, as well as capture the contextual features.", 
        "28": "To effectively capture both the semantic and syntactic features, we use recurrent neural networks (RNN) (Cho et al., 2014; Gers and Schmidhuber, 2001) to compress the semantic information in the given text into a dense vector (i.e., semantic understanding).", 
        "29": "Furthermore, we incorporate a copying mechanism (Gu et al., 2016) to allow our model to find important parts based on positional information.", 
        "30": "Thus, our model can generate keyphrases based on an understanding of the text, regardless of the presence or absence of keyphrases in the text; at the same time, it does not lose important in-text information.", 
        "31": "The contribution of this paper is three-fold.", 
        "32": "First, we propose to apply an RNN-based generative model to keyphrase prediction, as well as incorporate a copying mechanism in RNN, which enables the model to successfully predict phrases that rarely occur.", 
        "33": "Second, this is the first work that concerns the problem of absent keyphrase prediction for scientific publications, and our model recalls up to 20% of absent keyphrases.", 
        "34": "Third, we conducted a comprehensive comparison against six important baselines on a broad range of datasets, and the results show that our proposed model significantly outperforms existing supervised and unsupervised extraction methods.", 
        "35": "In the remainder of this paper, we first review the related work in Section 2.", 
        "36": "Then, we elaborate upon the proposed model in Section 3.", 
        "37": "After that, we present the experiment setting in Section 4 and results in Section 5, followed by our discussion in Section 6.", 
        "38": "Section 7 concludes the paper.", 
        "39": "2 Related Work    2.1 Automatic Keyphrase Extraction  A keyphrase provides a succinct and accurate way of describing a subject or a subtopic in a document.", 
        "40": "A number of extraction algorithms have been proposed, and the process of extracting keyphrases can typically be broken down into two steps.", 
        "41": "The first step is to generate a list of phrase can-\ndidates with heuristic methods.", 
        "42": "As these candidates are prepared for further filtering, a considerable number of candidates are produced in this step to increase the possibility that most of the correct keyphrases are kept.", 
        "43": "The primary ways of extracting candidates include retaining word sequences that match certain part-of-speech tag patterns (e.g., nouns, adjectives) (Liu et al., 2011; Wang et al., 2016; Le et al., 2016), and extracting important n-grams or noun phrases (Hulth, 2003; Medelyan et al., 2008).", 
        "44": "The second step is to score each candidate phrase for its likelihood of being a keyphrase in the given document.", 
        "45": "The top-ranked candidates are returned as keyphrases.", 
        "46": "Both supervised and unsupervised machine learning methods are widely employed here.", 
        "47": "For supervised methods, this task is solved as a binary classification problem, and various types of learning methods and features have been explored (Frank et al., 1999; Witten et al., 1999; Hulth, 2003; Medelyan et al., 2009b; Lopez and Romary, 2010; Gollapalli and Caragea, 2014).", 
        "48": "As for unsupervised approaches, primary ideas include finding the central nodes in text graph (Mihalcea and Tarau, 2004; Grineva et al., 2009), detecting representative phrases from topical clusters (Liu et al., 2009, 2010), and so on.", 
        "49": "Aside from the commonly adopted two-step process, another two previous studies realized the keyphrase extraction in entirely different ways.", 
        "50": "Tomokiyo and Hurst (2003) applied two language models to measure the phraseness and informativeness of phrases.", 
        "51": "Liu et al.", 
        "52": "(2011) share the most similar ideas to our work.", 
        "53": "They used a word alignment model, which learns a translation from the documents to the keyphrases.", 
        "54": "This approach alleviates the problem of vocabulary gaps between source and target to a certain degree.", 
        "55": "However, this translation model is unable to handle semantic meaning.", 
        "56": "Additionally, this model was trained with the target of title/summary to enlarge the number of training samples, which may diverge from the real objective of generating keyphrases.", 
        "57": "Zhang et al.", 
        "58": "(2016) proposed a joint-layer recurrent neural network model to extract keyphrases from tweets, which is another application of deep neural networks in the context of keyphrase extraction.", 
        "59": "However, their work focused on sequence labeling, and is therefore not able to predict absent keyphrases.", 
        "60": "2.2 Encoder-Decoder Model  The RNN Encoder-Decoder model (which is also referred as sequence-to-sequence Learning) is an end-to-end approach.", 
        "61": "It was first introduced by Cho et al.", 
        "62": "(2014) and Sutskever et al.", 
        "63": "(2014) to solve translation problems.", 
        "64": "As it provides a powerful tool for modeling variable-length sequences in an end-to-end fashion, it fits many natural language processing tasks and can rapidly achieve great successes (Rush et al., 2015; Vinyals et al., 2015; Serban et al., 2016).", 
        "65": "Different strategies have been explored to improve the performance of the Encoder-Decoder model.", 
        "66": "The attention mechanism (Bahdanau et al., 2014) is a soft alignment approach that allows the model to automatically locate the relevant input components.", 
        "67": "In order to make use of the important information in the source text, some studies sought ways to copy certain parts of content from the source text and paste them into the target text (Allamanis et al., 2016; Gu et al., 2016; Zeng et al., 2016).", 
        "68": "A discrepancy exists between the optimizing objective during training and the metrics during evaluation.", 
        "69": "A few studies attempted to eliminate this discrepancy by incorporating new training algorithms (Marc’Aurelio Ranzato et al., 2016) or by modifying the optimizing objectives (Shen et al., 2016).", 
        "70": "3 Methodology  This section will introduce our proposed deep keyphrase generation method in detail.", 
        "71": "First, the task of keyphrase generation is defined, followed by an overview of how we apply the RNN Encoder-Decoder model.", 
        "72": "Details of the framework as well as the copying mechanism will be introduced in Sections 3.3 and 3.4.", 
        "73": "3.1 Problem Definition  Given a keyphrase dataset that consists of N data samples, the i-th data sample (x(i),p(i)) contains one source text x(i), and Mi target keyphrases p(i) = (p(i,1),p(i,2), .", 
        "74": ".", 
        "75": ".", 
        "76": ",p(i,Mi)).", 
        "77": "Both the source text x(i) and keyphrase p(i,j) are sequences of words:\nx(i) = x (i) 1 , x (i) 2 , .", 
        "78": ".", 
        "79": ".", 
        "80": ", x (i) L xi\np(i,j) = y (i,j) 1 , y (i,j) 2 , .", 
        "81": ".", 
        "82": ".", 
        "83": ", y (i,j) L p(i,j)\nLx(i) and Lp(i,j)denotes the length of word sequence of x(i) and p(i,j) respectively.", 
        "84": "Each data sample contains one source text sequence and multiple target phrase sequences.", 
        "85": "To apply the RNN Encoder-Decoder model, the data need to be converted into text-keyphrase pairs that contain only one source sequence and one target sequence.", 
        "86": "We adopt a simple way, which splits the data sample (x(i),p(i)) into Mi pairs: (x(i),p(i,1)), (x(i),p(i,2)), .", 
        "87": ".", 
        "88": ".", 
        "89": ", (x(i),p(i,Mi)).", 
        "90": "Then the Encoder-Decoder model is ready to be applied to learn the mapping from the source sequence to target sequence.", 
        "91": "For the purpose of simplicity, (x,y) is used to denote each data pair in the rest of this section, where x is the word sequence of a source text and y is the word sequence of its keyphrase.", 
        "92": "3.2 Encoder-Decoder Model  The basic idea of our keyphrase generation model is to compress the content of source text into a hidden representation with an encoder and to generate corresponding keyphrases with the decoder, based on the representation .", 
        "93": "Both the encoder and decoder are implemented with recurrent neural networks (RNN).", 
        "94": "The encoder RNN converts the variable-length input sequence x = (x1, x2, ..., xT ) into a set of hidden representation h = (h1, h2, .", 
        "95": ".", 
        "96": ".", 
        "97": ", hT ), by iterating the following equations along time t:\nht = f (xt,ht−1) (1)\nwhere f is a non-linear function.", 
        "98": "We get the context vector c acting as the representation of the whole input x through a non-linear function q.\nc = q(h1, h2, ..., hT ) (2)\nThe decoder is another RNN; it decompresses the context vector and generates a variable-length sequence y = (y1, y2, ..., yT ′) word by word, through a conditional language model:\nst = f(yt−1, st−1, c) p(yt|y1,...,t−1,x) = g(yt−1, st, c) (3)\nwhere st is the hidden state of the decoder RNN at time t. The non-linear function g is a softmax classifier, which outputs the probabilities of all the words in the vocabulary.", 
        "99": "yt is the predicted word at time t, by taking the word with largest probability after g(·).", 
        "100": "The encoder and decoder networks are trained jointly to maximize the conditional probability of\nthe target sequence, given a source sequence.", 
        "101": "After training, we use the beam search to generate phrases and a max heap is maintained to get the predicted word sequences with the highest probabilities.", 
        "102": "3.3 Details of the Encoder and Decoder  A bidirectional gated recurrent unit (GRU) is applied as our encoder to replace the simple recurrent neural network.", 
        "103": "Previous studies (Bahdanau et al., 2014; Cho et al., 2014) indicate that it can generally provide better performance of language modeling than a simple RNN and a simpler structure than other Long Short-Term Memory networks (Hochreiter and Schmidhuber, 1997).", 
        "104": "As a result, the above non-linear function f is replaced by the GRU function (see in (Cho et al., 2014)).", 
        "105": "Another forward GRU is used as the decoder.", 
        "106": "In addition, an attention mechanism is adopted to improve performance.", 
        "107": "The attention mechanism was firstly introduced by Bahdanau et al.", 
        "108": "(2014) to make the model dynamically focus on the important parts in input.", 
        "109": "The context vector c is computed as a weighted sum of hidden representation h = (h1, .", 
        "110": ".", 
        "111": ".", 
        "112": ", hT ):\nci =\nT∑\nj=1\nαijhj\nαij = exp(a(si−1, hj))∑T k=1 exp(a(si−1, hk))\n(4)\nwhere a(si−1, hj) is a soft alignment function that measures the similarity between si−1 and hj ; namely, to which degree the inputs around position j and the output at position i match.", 
        "113": "3.4 Copying Mechanism  To ensure the quality of learned representation and reduce the size of the vocabulary, typically the RNN model considers a certain number of frequent words (e.g.", 
        "114": "30,000 words in (Cho et al., 2014)), but a large amount of long-tail words are simply ignored.", 
        "115": "Therefore, the RNN is not able to recall any keyphrase that contains out-ofvocabulary words.", 
        "116": "Actually, important phrases can also be identified by positional and syntactic information in their contexts, even though their exact meanings are not known.", 
        "117": "The copying mechanism (Gu et al., 2016) is one feasible solution that enables RNN to predict out-of-vocabulary words by selecting appropriate words from the source text.", 
        "118": "By incorporating the copying mechanism, the probability of predicting each new word yt consists of two parts.", 
        "119": "The first term is the probability of generating the term (see Equation 3) and the second one is the probability of copying it from the source text:\np(yt|y1,...,t−1,x) = pg(yt|y1,...,t−1,x) + pc(yt|y1,...,t−1,x) (5)\nSimilar to attention mechanism, the copying mechanism weights the importance of each word in source text with a measure of positional attention.", 
        "120": "But unlike the generative RNN which predicts the next word from all the words in vocabulary, the copying part pc(yt|y1,...,t−1,x) only considers the words in source text.", 
        "121": "Consequently, on the one hand, the RNN with copying mechanism is able to predict the words that are out of vocabulary but in the source text; on the other hand, the model would potentially give preference to the appearing words, which caters to the fact that most keyphrases tend to appear in the source text.", 
        "122": "pc(yt|y1,...,t−1,x) = 1\nZ\n∑\nj:xj=yt\nexp(ψc(xj)), y ∈ χ\nψc(xj) = σ(h T j Wc)st\n(6) where χ is the set of all of the unique words in the source text x, σ is a non-linear function and Wc ∈ R is a learned parameter matrix.", 
        "123": "Z is the sum of all the scores and is used for normalization.", 
        "124": "Please see (Gu et al., 2016) for more details.", 
        "125": "4 Experiment Settings  This section begins by discussing how we designed our evaluation experiments, followed by the description of training and testing datasets.", 
        "126": "Then, we introduce our evaluation metrics and baselines.", 
        "127": "4.1 Training Dataset  There are several publicly-available datasets for evaluating keyphrase generation.", 
        "128": "The largest one came from Krapivin et al.", 
        "129": "(2008), which contains 2,304 scientific publications.", 
        "130": "However, this amount of data is unable to train a robust recurrent neural network model.", 
        "131": "In fact, there are millions of scientific papers available online, each of which contains the keyphrases that were assigned by their authors.", 
        "132": "Therefore, we collected a large amount of high-quality scientific metadata in the\ncomputer science domain from various online digital libraries, including ACM Digital Library, ScienceDirect, Wiley, and Web of Science etc.", 
        "133": "(Han et al., 2013; Rui et al., 2016).", 
        "134": "In total, we obtained a dataset of 567,830 articles, after removing duplicates and overlaps with testing datasets, which is 200 times larger than the one of Krapivin et al.", 
        "135": "(2008).", 
        "136": "Note that our model is only trained on 527,830 articles, since 40,000 publications are randomly held out, among which 20,000 articles were used for building a new test dataset KP20k.", 
        "137": "Another 20,000 articles served as the validation dataset to check the convergence of our model, as well as the training dataset for supervised baselines.", 
        "138": "4.2 Testing Datasets  For evaluating the proposed model more comprehensively, four widely-adopted scientific publication datasets were used.", 
        "139": "In addition, since these datasets only contain a few hundred or a few thousand publications, we contribute a new testing dataset KP20k with a much larger number of scientific articles.", 
        "140": "We take the title and abstract as the source text.", 
        "141": "Each dataset is described in detail below.", 
        "142": "– Inspec (Hulth, 2003): This dataset provides 2,000 paper abstracts.", 
        "143": "We adopt the 500 testing papers and their corresponding uncontrolled keyphrases for evaluation, and the remaining 1,500 papers are used for training the supervised baseline models.", 
        "144": "– Krapivin (Krapivin et al., 2008): This dataset provides 2,304 papers with full-text and author-assigned keyphrases.", 
        "145": "However, the author did not mention how to split testing data, so we selected the first 400 papers in alphabetical order as the testing data, and the remaining papers are used to train the supervised baselines.", 
        "146": "– NUS (Nguyen and Kan, 2007): We use the author-assigned keyphrases and treat all 211 papers as the testing data.", 
        "147": "Since the NUS dataset did not specifically mention the ways of splitting training and testing data, the results of the supervised baseline models are obtained through a five-fold cross-validation.", 
        "148": "– SemEval-2010 (Kim et al., 2010): 288 articles were collected from the ACM Digital\nLibrary.", 
        "149": "100 articles were used for testing and the rest were used for training supervised baselines.", 
        "150": "– KP20k: We built a new testing dataset that contains the titles, abstracts, and keyphrases of 20,000 scientific articles in computer science.", 
        "151": "They were randomly selected from our obtained 567,830 articles.", 
        "152": "Due to the memory limits of implementation, we were not able to train the supervised baselines on the whole training set.", 
        "153": "Thus we take the 20,000 articles in the validation set to train the supervised baselines.", 
        "154": "It is worth noting that we also examined their performance by enlarging the training dataset to 50,000 articles, but no significant improvement was observed.", 
        "155": "4.3 Implementation Details  In total, there are 2,780,316 〈text, keyphrase〉 pairs for training, in which text refers to the concatenation of the title and abstract of a publication, and keyphrase indicates an author-assigned keyword.", 
        "156": "The text pre-processing steps including tokenization, lowercasing and replacing all digits with symbol 〈digit〉 are applied.", 
        "157": "Two encoderdecoder models are trained, one with only attention mechanism (RNN) and one with both attention and copying mechanism enabled (CopyRNN).", 
        "158": "For both models, we choose the top 50,000 frequently-occurred words as our vocabulary, the dimension of embedding is set to 150, the dimension of hidden layers is set to 300, and the word embeddings are randomly initialized with uniform distribution in [-0.1,0.1].", 
        "159": "Models are optimized using Adam (Kingma and Ba, 2014) with initial learning rate = 10−4, gradient clipping = 0.1 and dropout rate = 0.5.", 
        "160": "The max depth of beam search is set to 6, and the beam size is set to 200.", 
        "161": "The training is stopped once convergence is determined on the validation dataset (namely earlystopping, the cross-entropy loss stops dropping for several iterations).", 
        "162": "In the generation of keyphrases, we find that the model tends to assign higher probabilities for shorter keyphrases, whereas most keyphrases contain more than two words.", 
        "163": "To resolve this problem, we apply a simple heuristic by preserving only the first single-word phrase (with the highest generating probability) and removing the rest.", 
        "164": "4.4 Baseline Models  Four unsupervised algorithms (Tf-Idf, TextRank (Mihalcea and Tarau, 2004), SingleRank (Wan and Xiao, 2008), and ExpandRank (Wan and Xiao, 2008)) and two supervised algorithms (KEA (Witten et al., 1999) and Maui (Medelyan et al., 2009a)) are adopted as baselines.", 
        "165": "We set up the four unsupervised methods following the optimal settings in (Hasan and Ng, 2010), and the two supervised methods following the default setting as specified in their papers.", 
        "166": "4.5 Evaluation Metric  Three evaluation metrics, the macro-averaged precision, recall and F-measure (F1) are employed for measuring the algorithm’s performance.", 
        "167": "Following the standard definition, precision is defined as the number of correctly-predicted keyphrases over the number of all predicted keyphrases, and recall is computed by the number of correctlypredicted keyphrases over the total number of data records.", 
        "168": "Note that, when determining the match of two keyphrases, we use Porter Stemmer for preprocessing.", 
        "169": "5 Results and Analysis  We conduct an empirical study on three different tasks to evaluate our model.", 
        "170": "5.1 Predicting Present Keyphrases  This is the same as the keyphrase extraction task in prior studies, in which we analyze how well our proposed model performs on a commonly-defined task.", 
        "171": "To make a fair comparison, we only consider the present keyphrases for evaluation in this task.", 
        "172": "Table 2 provides the performances of the six baseline models, as well as our proposed models (i.e., RNN and CopyRNN).", 
        "173": "For each method, the table lists its F-measure at top 5 and top 10 predictions on the five datasets.", 
        "174": "The best scores are highlighted in bold and the underlines indicate the second best performances.", 
        "175": "The results show that the four unsupervised models (Tf-idf, TextTank, SingleRank and ExpandRank) have a robust performance across different datasets.", 
        "176": "The ExpandRank fails to return any result on the KP20k dataset, due to its high time complexity.", 
        "177": "The measures on NUS and SemEval here are higher than the ones reported in (Hasan and Ng, 2010) and (Kim et al., 2010), probably because we utilized the paper abstract instead of the full text for training, which may\nfilter out some noisy information.", 
        "178": "The performance of the two supervised models (i.e., Maui and KEA) were unstable on some datasets, but Maui achieved the best performances on three datasets among all the baseline models.", 
        "179": "As for our proposed keyphrase prediction approaches, the RNN model with the attention mechanism did not perform as well as we expected.", 
        "180": "It might be because the RNN model is only concerned with finding the hidden semantics behind the text, which may tend to generate keyphrases or words that are too general and may not necessarily refer to the source text.", 
        "181": "In addition, we observe that 2.5% (70,891/2,780,316) of keyphrases in our dataset contain out-of-vocabulary words, which the RNN model is not able to recall, since the RNN model can only generate results with the 50,000 words in vocabulary.", 
        "182": "This indicates that a pure generative model may not fit the extraction task, and we need to further link back to the language usage within the source text.", 
        "183": "The CopyRNN model, by considering more contextual information, significantly outperforms not only the RNN model but also all baselines, exceeding the best baselines by more than 20% on average.", 
        "184": "This result demonstrates the importance of source text to the extraction task.", 
        "185": "Besides, nearly 2% of all correct predictions contained outof-vocabulary words.", 
        "186": "The example in Figure 1(a) shows the result of predicted present keyphrases by RNN and CopyRNN for an article about video search.", 
        "187": "We see that both models can generate phrases that relate to the topic of information retrieval and video.", 
        "188": "However most of RNN predictions are high-level terminologies, which are too general to be selected as keyphrases.", 
        "189": "CopyRNN, on the other hand,\npredicts more detailed phrases like “video metadata” and “integrated ranking”.", 
        "190": "An interesting bad case, “rich content” coordinates with a keyphrase “video metadata”, and the CopyRNN mistakenly puts it into prediction.", 
        "191": "5.2 Predicting Absent Keyphrases  As stated, one important motivation for this work is that we are interested in the proposed model’s capability for predicting absent keyphrases based on the “understanding” of content.", 
        "192": "It is worth noting that such prediction is a very challenging task, and, to the best of our knowledge, no existing methods can handle this task.", 
        "193": "Therefore, we only provide the RNN and CopyRNN performances in the discussion of the results of this task.", 
        "194": "Here, we evaluate the performance within the recall of the top 10 and top 50 results, to see how many absent keyphrases can be correctly predicted.", 
        "195": "We use the absent keyphrases in the testing datasets for evaluation.", 
        "196": "Table 3 presents the recall results of the top 10/50 predicted keyphrases for our RNN and CopyRNN models, in which we observe that the CopyRNN can, on average, recall around 8%\n(15%) of keyphrases at top 10 (50) predictions.", 
        "197": "This indicates that, to some extent, both models can capture the hidden semantics behind the textual content and make reasonable predictions.", 
        "198": "In addition, with the advantage of features from the source text, the CopyRNN model also outperforms the RNN model in this condition, though it does not show as much improvement as the present keyphrase extraction task.", 
        "199": "An example is shown in Figure 1(b), in which we see that two absent keyphrases, “video retrieval” and “video indexing”, are correctly recalled by both models.", 
        "200": "Note that the term “indexing” does not appear in the text, but the models may detect the information “index videos” in the first sentence and paraphrase it to the target phrase.", 
        "201": "And the CopyRNN successfully predicts another two keyphrases by capturing the detailed information from the text (highlighted text segments).", 
        "202": "5.3 Transferring the Model to the News Domain  RNN and CopyRNN are supervised models, and they are trained on data in a specific domain and writing style.", 
        "203": "However, with sufficient training on a large-scale dataset, we expect the models to be able to learn universal language features that are also effective in other corpora.", 
        "204": "Thus in this task, we will test our model on another type of text, to see whether the model would work when being transferred to a different environment.", 
        "205": "We use the popular news article dataset DUC2001 (Wan and Xiao, 2008) for analysis.", 
        "206": "The dataset consists of 308 news articles and 2,488 manually annotated keyphrases.", 
        "207": "The result of this analysis is shown in Table 4, from which we could see that the CopyRNN can extract a portion of correct keyphrases from a unfamiliar text.", 
        "208": "Compared to the results reported in (Hasan and Ng, 2010), the performance of CopyRNN is better than TextRank (Mihalcea and Tarau, 2004) and KeyCluster (Liu et al., 2009), but lags behind the other\nthree baselines.", 
        "209": "As it is transferred to a corpus in a completely different type and domain, the model encounters more unknown words and has to rely more on the positional and syntactic features within the text.", 
        "210": "In this experiment, the CopyRNN recalls 766 keyphrases.", 
        "211": "14.3% of them contain out-ofvocabulary words, and many names of persons and places are correctly predicted.", 
        "212": "6 Discussion  Our experimental results demonstrate that the CopyRNN model not only performs well on predicting present keyphrases, but also has the ability to generate topically relevant keyphrases that are absent in the text.", 
        "213": "In a broader sense, this model attempts to map a long text (i.e., paper abstract) with representative short text chunks (i.e., keyphrases), which can potentially be applied to improve information retrieval performance by generating high-quality index terms, as well as assisting user browsing by summarizing long documents into short, readable phrases.", 
        "214": "Thus far, we have tested our model with scientific publications and news articles, and have demonstrated that our model has the ability to capture universal language patterns and extract key information from unfamiliar texts.", 
        "215": "We believe that our model has a greater potential to be generalized to other domains and types, like books, online reviews, etc., if it is trained on a larger data corpus.", 
        "216": "Also, we directly applied our model, which was trained on a publication dataset, into generating keyphrases for news articles without any adaptive training.", 
        "217": "We believe that with proper training on news data, the model would make further improvement.", 
        "218": "Additionally, this work mainly studies the problem of discovering core content from textual materials.", 
        "219": "Here, the encoder-decoder framework is applied to model language; however, such a framework can also be extended to locate the core information on other data resources, such as summarizing content from images and videos.", 
        "220": "7 Conclusions and Future Work  In this paper, we proposed an RNN-based generative model for predicting keyphrases in scientific text.", 
        "221": "To the best of our knowledge, this is the first application of the encoder-decoder model to a keyphrase prediction task.", 
        "222": "Our model summarizes phrases based the deep semantic meaning\nof the text, and is able to handle rarely-occurred phrases by incorporating a copying mechanism.", 
        "223": "Comprehensive empirical studies demonstrate the effectiveness of our proposed model for generating both present and absent keyphrases for different types of text.", 
        "224": "Our future work may include the following two directions.", 
        "225": "– In this work, we only evaluated the performance of the proposed model by conducting off-line experiments.", 
        "226": "In the future, we are interested in comparing the model to human annotators and using human judges to evaluate the quality of predicted phrases.", 
        "227": "– Our current model does not fully consider correlation among target keyphrases.", 
        "228": "It would also be interesting to explore the multiple-output optimization aspects of our model.", 
        "229": "Acknowledgments  We would like to thank Jiatao Gu and Miltiadis Allamanis for sharing the source code and giving helpful advice.", 
        "230": "We also thank Wei Lu, Yong Huang, Qikai Cheng and other IRLAB members at Wuhan University for the assistance of dataset development.", 
        "231": "This work is partially supported by the National Science Foundation under Grant No.1525186."
    }, 
    "document_id": "P17-1054.pdf.json"
}
