{
    "abstract_sentences": {
        "1": "Linguistic typology studies the range of structures present in human language.", 
        "2": "The main goal of the field is to discover which sets of possible phenomena are universal, and which are merely frequent.", 
        "3": "For example, all languages have vowels, while most—but not all—languages have an [u] sound.", 
        "4": "In this paper we present the first probabilistic treatment of a basic question in phonological typology: What makes a natural vowel inventory?", 
        "5": "We introduce a series of deep stochastic point processes, and contrast them with previous computational, simulation-based approaches.", 
        "6": "We provide a comprehensive suite of experiments on over 200 distinct languages."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1182–1192 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1109  1 Introduction  Human languages exhibit a wide range of phenomena, within some limits.", 
        "2": "However, some structures seem to occur or co-occur more frequently than others.", 
        "3": "Linguistic typology attempts to describe the range of natural variation and seeks to organize and quantify linguistic universals, such as patterns of co-occurrence.", 
        "4": "Perhaps one of the simplest typological questions comes from phonology: which vowels tend to occur and co-occur within the phoneme inventories of different languages?", 
        "5": "Drawing inspiration from the linguistic literature, we propose models of the probability distribution from which the attested vowel inventories have been drawn.", 
        "6": "It is a typological universal that every language contains both vowels and consonants (Velupillai, 2012).", 
        "7": "But which vowels a language contains is guided by softer constraints, in that certain configurations are more widely attested than others.", 
        "8": "For instance, in a typical phoneme inventory, there tend to be far fewer vowels than consonants.", 
        "9": "Likewise, all languages contrast vowels based on height, although which contrast is made is language-dependent (Ladefoged and Maddieson, 1996).", 
        "10": "Moreover, while over 600 unique vowel\nphonemes have been attested cross-linguistically (Moran et al., 2014), certain regions of acoustic space are used much more often than others, e.g., the regions conventionally transcribed as [a], [i], and [u].", 
        "11": "Human language also seems to prefer inventories where phonologically distinct vowels are spread out in acoustic space (“dispersion”) so that they can be easily distinguished by a listener.", 
        "12": "We depict the acoustic space for English in Figure 2.", 
        "13": "In this work, we regard the proper goal of linguistic typology as the construction of a universal prior distribution from which linguistic systems are drawn.", 
        "14": "For vowel system typology, we propose three formal probability models based on stochastic point processes.", 
        "15": "We estimate the parameters of the model on one set of languages and evaluate performance on a held-out set.", 
        "16": "We explore three questions: (i) How well do the properties of our proposed probability models line up experimentally with linguistic theory?", 
        "17": "(ii) How well can our models predict held-out vowel systems?", 
        "18": "(iii) Do our models benefit from a “deep” transformation from formant space to metric space?", 
        "19": "1182  2 Vowel Inventories and their Typology  Vowel inventories are a simple entry point into the study of linguistic typology.", 
        "20": "Every spoken language chooses a discrete set of vowels, and the number of vowel phonemes ranges from 3 to 46, with a mean of 8.7 (Gordon, 2016).", 
        "21": "Nevertheless, the empirical distribution over vowel inventories is remarkably peaked.", 
        "22": "The majority of languages have 5–7 vowels, and there are only a handful of distinct 4-vowel systems attested despite many possibilities.", 
        "23": "Reigning linguistic theory (BeckerKristal, 2010) has proposed that vowel inventories are shaped by the principles discussed below.", 
        "24": "2.1 Acoustic Phonetics  One way to describe the sound of a vowel is through its acoustic energy at different frequencies.", 
        "25": "A spectrogram (Figure 3) is a visualization of the energy at various frequencies over time.", 
        "26": "Consider the “peak” frequencies F0 < F1 < F2 < .", 
        "27": ".", 
        "28": ".", 
        "29": "that have a greater energy than their neighboring frequencies.", 
        "30": "F0 is called the fundamental frequency or pitch.", 
        "31": "The other qualities of the vowel are largely determined by F1, F2, .", 
        "32": ".", 
        "33": "., which are known as formants (Ladefoged and Johnson, 2014).", 
        "34": "In many languages, the first two formants F1 and F2 contain enough information to identify a vowel: Figure 3 shows how these differ across three English vowels.", 
        "35": "We consider each vowel listed in the International Phonetic Alphabet (IPA) to be cross-linguistically characterized by some (F1, F2) pair.", 
        "36": "2.2 Dispersion  The dispersion criterion (Liljencrants and Lindblom, 1972; Lindblom, 1986) states that the phonemes of a language must be “spread out” so that they are easily discriminated by a listener.", 
        "37": "A\n0 Hz\n1000 Hz\n2000 Hz\n3000 Hz\n4000 Hz\n5000 Hz /i/ /u/ /ɑ/\nFigure 3: Example spectrogram of the three English vowels: [i], [u] and [A].", 
        "38": "The x-axis is time and y-axis is frequency.", 
        "39": "The first two formants F1 and F2 are marked in with colored arrows for each vowel.", 
        "40": "We used the Praat toolkit to generate the spectrogram and find the formants (Boersma et al., 2002).", 
        "41": "language seeks phonemes that are sufficiently “distant” from one another to avoid confusion.", 
        "42": "Distances between phonemes are defined in some latent “metric space.” We use this term rather than “perceptual space” because the confusability of two vowels may reflect not just their perceptual similarity, but also their common distortions by imprecise articulation or background noise.1  2.3 Focalization  The dispersion criterion alone does not seem to capture the whole story.", 
        "43": "Certain vowels are simply more popular cross-linguistically.", 
        "44": "A commonly accepted explanation is the quantal theory of speech (Stevens, 1972, 1989).", 
        "45": "The quantal theory states that certain sounds are easier to articulate and to perceive than others.", 
        "46": "These vowels may be characterized as those where F1 and F2 have frequencies that are close to one another.", 
        "47": "On the production side, these vowels are easier to pronounce since they allow for greater articulatory imprecision.", 
        "48": "On the perception side, they are more salient since the two spectral peaks aggregate and act as one, larger peak to a certain degree.", 
        "49": "In general, languages will prefer these vowels.", 
        "50": "2.4 Dispersion-Focalization Theory  The dispersion-focalization theory (DFT) combines both of the above notions.", 
        "51": "A good vowel system now consists of vowels that contrast with each other and are individually desirable (Schwartz et al., 1997).", 
        "52": "This paper provides the first probabilistic treatment of DFT, and new evaluation metrics for future probabilistic and non-probabilistic treatments of vowel inventory typology.", 
        "53": "1We assume in this paper that the metric space is universal—although it would not be unreasonable to suppose that each language’s vowel system has adapted to avoid confusion in the specific communicative environment of its speakers.", 
        "54": "3 Point Process Models  Given a base set V , a point process is a distribution over its subsets.2 In this paper, we take V to be the set of all IPA symbols corresponding to vowels.", 
        "55": "Thus a draw from a point process is a vowel inventory V ⊆ V , and the point process itself is a distribution over such inventories.", 
        "56": "We will consider three basic point process models for vowel systems: the Bernoulli Point Process, the Markov Point Process and the Determinantal Point Process.", 
        "57": "In this section, we review the relevant theory of point processes, highlighting aspects related to §2.", 
        "58": "3.1 Bernoulli Point Processes  Taking V = {v1, .", 
        "59": ".", 
        "60": ".", 
        "61": ", vN}, a Bernoulli point process (BPP) makes an independent decision about whether to include each vowel in the subset.", 
        "62": "The probability of a vowel system V ⊆ V is thus\np(V ) ∝ ∏\nvi∈V φ(vi), (1)\nwhere φ is a unary potential function, i.e., φ(vi) ≥ 0.", 
        "63": "Qualitatively, this means that φ(vi) should be large if the ith vowel is good in the sense of §2.3.", 
        "64": "Marginal inference in a BPP is computationally trivial.", 
        "65": "The probability that the inventory V contains vi is φ(vi)/(1 + φ(vi)), independent of the other vowels in V .", 
        "66": "Since a BPP predicts each vowel independently, it only models focalization.", 
        "67": "Thus, the model provides an appropriate baseline that will let us measure the importance of the dispersion principle—how far can we get with just focalization?", 
        "68": "A BPP may still tend to generate well-dispersed sets if it defines φ to be large only on certain vowels in V and these are well-dispersed (e.g., [i], [u], [a]).", 
        "69": "More precisely, it can define φ so that φ(vi)φ(vj) is small whenever vi, vj are similar.3 But it cannot actively encourage dispersion:\n2A point process is a specific kind of stochastic process, which is the technical term for a distribution over functions.", 
        "70": "Under this view, drawing some subset of V from the point process is regarded as drawing some indicator function on V .", 
        "71": "3We point out that such a scheme would break down if we extended our work to cover fine-grained phonetic modeling of the vowel inventory.", 
        "72": "In that setting, we ask not just whether the inventory includes /i/ but exactly which pronunciation of /i/ it contains.", 
        "73": "In the limit, φ becomes a function over a continuous vowel space V = R2, turning the BPP into an inhomogeneous spatial Poisson process.", 
        "74": "A continuous φ function implies that the model places similar probability on similar vowels.", 
        "75": "Then if most vowel inventories contain some version of /i/, then many of them will contain several closely related variants of /i/ (independently chosen).", 
        "76": "By contrast, the other methods in this paper do extend nicely to fine-grained phonetic modeling.", 
        "77": "including vi does not lower the probability of also including vj .", 
        "78": "3.2 Markov Point Processes  A Markov Point Process (MPP) (Van Lieshout, 2000)—also known as a Boltzmann machine (Ackley et al., 1985; Hinton and Sejnowski, 1986)— generalizes the BPP by adding pairwise interactions between vowels.", 
        "79": "The probability of a vowel system V ⊆ V is now\np(V ) ∝ ∏\nvi∈V φ(vi)\n∏\nvi,vj∈V ψ(vi, vj), (2)\nwhere each φ(vi) ≥ 0 is, again, a unary potential that scores the quality of the ith vowel, and each ψ(vi, vj) ≥ 0 is a binary potential that scores the combination of the ith and jth vowels.", 
        "80": "Roughly speaking, the potential ψ(vi, vj) should be large if the ith and jth vowel often co-occur.", 
        "81": "Recall that under the principle of dispersion, the vowels that often co-occur are easily distinguishable.", 
        "82": "Thus, confusable vowel pairs should tend to have potential ψ(vi, vj) < 1.", 
        "83": "Unlike the BPP, the MPP can capture both focalization and dispersion.", 
        "84": "In this work, we will consider a fully connected MPP, i.e., there is a potential function for each pair of vowels in V .", 
        "85": "MPPs closely resemble Ising models (Ising, 1925), but with the difference that Ising models are typically lattice-structured, rather than fully connected.", 
        "86": "Inference in MPPs.", 
        "87": "Inference in fully connected MPPs, just as in general Markov Random Fields (MRFs), is intractable (Cooper, 1990) and we must rely on approximation.", 
        "88": "In this work, we estimate any needed properties of the MPP distribution by (approximately) drawing vowel inventories from it via Gibbs sampling (Geman and Geman, 1984; Robert and Casella, 2005).", 
        "89": "Gibbs sampling simulates a discrete-time Markov chain whose stationary distribution is the desired MPP distribution.", 
        "90": "At each time step, for some random vi ∈ V , it stochastically decides whether to replace the current inventory V with V̄ , where V̄ is a copy of V with vi added (if vi /∈ V ) or removed (if vi ∈ V ).", 
        "91": "The probability of replacement is p(V̄ )\np(V )+p(V̄ ) .", 
        "92": "3.3 Determinantal Point Processes  A determinantal point process (DPP) (Macchi, 1975) provides an elegant alternative to an MPP, and one that is directly suited to modeling both focalization and dispersion.", 
        "93": "Inference requires only\na few matrix computations and runs tractably in O(|V|3) time, even though the model may encode a rich set of multi-way interactions.", 
        "94": "We focus on the L-ensemble parameterization of the DPP, due to Borodin and Rains (2005).4 This type of DPP defines the probability of an inventory V ⊆ V as\np(V ) ∝ detLV , (3)\nwhere L ∈ RN×N (for N = |V|) is a symmetric positive semidefinite matrix, and LV refers to the submatrix of L with only those rows and columns corresponding to those elements in the subset V .", 
        "95": "Although MAP inference remains NP-hard in DPPs (just as in MPPs), marginal inference becomes tractable.", 
        "96": "We may compute the normalizing constant in closed form as follows:\n∑\nV ∈2V detLV = det (L+ I) .", 
        "97": "(4)\nHow does a DPP ensure focalization and dispersion?", 
        "98": "L is positive semidefinite iff it can be written as E>E for some matrix E ∈ RN×N .", 
        "99": "It is possible to express p(V ) in terms of the column vectors of E, which we call e1, .", 
        "100": ".", 
        "101": ".", 
        "102": ", eN :\n• For inventories of size 2, p({vi, vj}) ∝ (φ(vi)φ(vj) sin θ)\n2, where φ(vi), φ(vj) represent the quality of vowels vi, vj (as in the BPP) while sin θ ∈ [0, 1] represents their dissimilarity.", 
        "103": "More precisely, φ(vi), φ(vj) are the lengths of vectors ei, ej while θ is the angle between them.", 
        "104": "Thus, we should choose the columns of E so that focal vowels get long vectors and similar vowels get vectors of similar direction.", 
        "105": "• Generalizing beyond inventories of size 2, p(V ) is proportional to the square of the volume of the parallelepiped whose sides are given by {ei : vi ∈ V }.", 
        "106": "This volume can be regarded as\n∏ vi∈V φ(vi) times a term that\nranges from 1 for an orthogonal set of vowels to 0 for a linearly dependent set of vowels.", 
        "107": "• The events vi ∈ V and vj ∈ V are anti-\ncorrelated (when not independent).", 
        "108": "That is, while both vowels may individually have high probabilities (focalization), having either one in the inventory lowers the probability of the other (dispersion).", 
        "109": "4Most DPPs are L-ensembles (Kulesza and Taskar, 2012).", 
        "110": "4 Dataset  At this point it is helpful to introduce the empirical dataset we will model.", 
        "111": "For each of 223 languages,5 Becker-Kristal (2010) provides the vowel inventory as a set of IPA symbols, listing the first 5 formants for each vowel (or fewer when not available in the original source).", 
        "112": "Some corpus statistics are shown in Figs.", 
        "113": "4 and 5.6 For the present paper, we take V to be the set of all 53 IPA symbols that appear in the corpus.", 
        "114": "We treat these IPA labels as meaningful, in that we consider two vowels in different languages to be the same vowel in V if (for example) they are both annotated as [O].", 
        "115": "We characterize that vowel by its average formant vector across all languages in the corpus that contain the vowel: e.g., (F1, F2, .", 
        "116": ".", 
        "117": ".)", 
        "118": "= (500, 700, .", 
        "119": ".", 
        "120": ".)", 
        "121": "for [O].", 
        "122": "In future work, we plan to relax this idealization (see footnote 3), allowing us to investigate natural questions such as whether [u] is pronounced higher (smaller F1) in languages that also contain [o] (to achieve better dispersion).", 
        "123": "5 Model Parameterization  The BPP, MPP, and DPP models (§3) require us to specify parameters for each vowel in V .", 
        "124": "In §5.1, we will accomplish this by deriving the parameters for each vowel vi from a possibly high-dimensional embedding of that vowel, e(vi) ∈ Rr.", 
        "125": "In §5.2, e(vi) ∈ Rr will in turn be defined as some learned function of f(vi) ∈ Rk, where f : V 7→ Rk is the function that maps a vowel to a k-vector of its measurable acoustic properties.", 
        "126": "This approach allows us to determine reasonable parameters even for rare vowels, based on their measurable properties.", 
        "127": "It will even enable us in\n5Becker-Kristal lists some languages multiple times with different measurements.", 
        "128": "When a language had multiple listings, we selected one randomly for our experiments.", 
        "129": "6Caveat: The corpus is a curation of information from various phonetics papers into a common electronic format.", 
        "130": "No standard procedure was followed across all languages: it was up to individual phoneticists to determine the size of each vowel inventory, the choice of IPA symbols to describe it, and the procedure for measuring the formants.", 
        "131": "Moreover, it is an idealization to provide a single vector of formants for each vowel type in the language.", 
        "132": "In real speech, different tokens of the same vowel are pronounced differently, because of coarticulation with the vowel context, allophony, interspeaker variation, and stochastic intraspeaker variation.", 
        "133": "Even within a token, the formants change during the duration of the vowel.", 
        "134": "Thus, one might do better to represent a vowel’s pronunciation not by a formant vector, but by a conditional probability distribution over its formant trajectories given its context, or by a parameter vector that characterizes such a conditional distribution.", 
        "135": "This setting would require richer data than we present here.", 
        "136": "future to generalize to vowels that were unseen in the training set, letting us scale to very large or infinite V (footnote 3).", 
        "137": "5.1 Deep Point Processes  We consider deep versions of all three processes.", 
        "138": "Deep Bernoulli Point Process.", 
        "139": "We define\nφ(vi) = ||e(vi)|| ≥ 0 (5) Deep Markov Point Process.", 
        "140": "The MPP employs the same unary potential as the BPP, as well as the binary potential\nψ(vi, vj) = exp− 1\nT · ||e(vi)−e(vj)||2 < 1 (6)\nwhere the learned temperature T > 0 controls the relative strength of the unary and binary potentials.", 
        "141": "This formula is inspired by Coulomb’s law for describing the repulsion of static electrically charged particles.", 
        "142": "Just as the repulsive force between two particles approaches∞ as they approach each other, the probability of finding two vowels in the same inventory approaches exp−∞ = 0 as they approach each other.", 
        "143": "The formula is also reminiscent of Shepard (1987)’s “universal law of generalization,” which says here that the probability of responding to vi as if it were vj should fall off exponentially with their distance in some “psychological space” (here, embedding space).", 
        "144": "Deep Determinantal Point Process.", 
        "145": "For the DPP, we simply define the vector ei to be e(vi), and proceed as before.", 
        "146": "Summary.", 
        "147": "In the deep BPP, the probability of a set of vowels is proportional to the product of the lengths of their embedding vectors.", 
        "148": "The deep MPP modifies this by multiplying in pairwise repulsion terms in (0, 1) that increase as the vectors’ endpoints move apart in Euclidean space (or as T → ∞).", 
        "149": "The deep DPP instead modifies it by multiplying in a single setwise repulsion term in (0, 1) that increases as the embedding vectors become more mutually orthogonal.", 
        "150": "In the limit, then, the MPP and DPP both approach the BPP.", 
        "151": "5.2 Embeddings  Throughout this work, we simply have f extract the first k = 2 formants, since our dataset does not provide higher formants for all languages.7 For\n7In lieu of higher formants, we could have extended the vector f(vi) to encode the binary distinctive features of the IPA vowel vi: round, tense, long, nasal, creaky, etc.", 
        "152": "example, we have f([O]) = (500, 700).", 
        "153": "We now describe three possible methods for mapping f(vi) to an embedding e(vi).", 
        "154": "Each of these maps has learnable parameters.", 
        "155": "Neural Embedding.", 
        "156": "We first consider directly embedding each vowel vi into a vector space Rr.", 
        "157": "We achieve this through a feed-forward neural net\ne(vi) = W1 tanh (W0f(vi) + b0) + b1, (7)\nEquation (7) gives an architecture with 1 layer of nonlinearity; in general we consider stacking d ≥ 0 layers.", 
        "158": "Here W0 ∈ Rr×k,W1 ∈ Rr×r, .", 
        "159": ".", 
        "160": ".Wd ∈ Rr×r are weight matrices, b0, .", 
        "161": ".", 
        "162": ".bd ∈ Rr are bias vectors, and tanh could be replaced by any pointwise nonlinearity.", 
        "163": "We treat both the depth d and the embedding size r as hyperparameters, and select the optimal values on a development set.", 
        "164": "Interpretable Neural Embedding.", 
        "165": "We are interested in the special case of neural embeddings when r = k since then (for any d) the mapping f(vi) 7→ e(vi) is a diffeomorphism:8 a smooth invertible function of Rk.", 
        "166": "An example of such a diffeomorphism is shown in Figure 1.", 
        "167": "There is a long history in cognitive psychology of mapping stimuli into some psychological space.", 
        "168": "The distances in this psychological space may be predictive of generalization (Shepard, 1987) or of perception.", 
        "169": "Due to the anatomy of the ear, the mapping of vowels from acoustic space to perceptual space is often presumed to be nonlinear (Rosner and Pickering, 1994; Nearey and Kiefte, 2003), and there are many perceptually-oriented phonetic scales, e.g., Bark and Mel, that carry out such nonlinear transformations while preserving the dimensionality k, as we do here.", 
        "170": "As discussed in §2.2, vowel system typology is similarly believed to be influenced by distances between the vowels in a latent metric space.", 
        "171": "We are interested in whether a constrained k-dimensional model of these distances can do well in our experiments.", 
        "172": "Prototype-Based Embedding.", 
        "173": "Unfortunately, our interpretable neural embedding is unfortunately incompatible with the DPP.", 
        "174": "The DPP assigns probability 0 to any vowel inventory V whose e vectors are linearly dependent.", 
        "175": "If the vectors are in Rk, then this means that p(V ) = 0 whenever |V | > k. In our setting, this would limit vowel inventories to size 2.", 
        "176": "8Provided that our nonlinearity in (7) is a differentiable invertible function like tanh rather than relu.", 
        "177": "Our solution to this problem is to still construct our interpretable metric space Rk, but then map that nonlinearly to Rr for some large r. This latter map is constrained.", 
        "178": "Specifically, we choose “prototype” points µ1, .", 
        "179": ".", 
        "180": ".", 
        "181": ",µr ∈ Rk.", 
        "182": "These prototype points are parameters of the model: their coordinates are learned and do not necessarily correspond to any actual vowel.", 
        "183": "We then construct e(vi) ∈ Rr as a “response vector” of similarities of our vowel vi to these prototypes.", 
        "184": "Crucially, the responses depend on distances measured in the interpretable metric space Rk.", 
        "185": "We use a Gaussian-density response function, where x(vi) denotes the representation of our vowel vi in the interpretable space:\ne(vi)` = w` p(x(vi);µ`, σ 2I) (8)\n= w` (2πσ 2)−( k 2 ) exp (−||x− µ`||2 2σ2 ) .", 
        "186": "for ` = 1, 2, .", 
        "187": ".", 
        "188": ".", 
        "189": ", r. We additionally impose the constraints that each w` ≥ 0 and ∑r `=1w` = 1.", 
        "190": "Notice that the sum ∑r\n`=1 e(vi) may be viewed as the density at x(vi) under a Gaussian mixture model.", 
        "191": "We use this fact to construct a prototypebased MPP as well: we redefine φ(vi) to equal this positive density, while still defining ψ via equation (6).", 
        "192": "The idea is that dispersion is measured in the interpretable space Rk, and focalization is defined by certain “good” regions in that space that are centered at the r prototypes.", 
        "193": "6 Evaluation Metrics  Fundamentally, we are interested in whether our model has abstracted the core principles of what makes a good vowel system.", 
        "194": "Our choice of a probabilistic model provides a natural test: how surprised is our model by held-out languages?", 
        "195": "In other words, how likely does our model think unobserved, but attested vowel systems are?", 
        "196": "While this is a natural evaluation paradigm in NLP, it has not—to the best of our knowledge—been applied to a quantitative investigation of linguistic typology.", 
        "197": "As a second evaluation, we introduce a vowel system cloze task that could also be used to evaluate non-probabilistic models.", 
        "198": "This task is defined by analogy to the traditional semantic cloze task (Taylor, 1953), where the reader is asked to fill in a missing word in the sentence from the context.", 
        "199": "In our vowel system cloze task, we present a learner with a subset of the vowels in a held-out vowel system and ask them to predict the remaining vowels.", 
        "200": "Consider, as a concrete example, the\ngeneral American English vowel system (excluding long vowels) {[i], [I], [u], [U], [E], [æ], [O], [A], [@]}.", 
        "201": "One potential cloze task would be to predict {[i], [u]} given {[I], [U], [E], [æ], [O], [A], [@]} and the fact that two vowels are missing from the inventory.", 
        "202": "Within the cloze task, we report accuracy, i.e., did we guess the missing vowel right?", 
        "203": "We consider three versions of the cloze tasks.", 
        "204": "First, we predict one missing vowel in a setting where exactly one vowel was deleted.", 
        "205": "Second, we predict up to one missing vowel where a vowel may have been deleted.", 
        "206": "Third, we predict up to two missing vowels, where one or two vowels may be deleted.", 
        "207": "7 Experiments  We evaluate our models using 10-fold crossvalidation over the 223 languages.", 
        "208": "We report the mean performance over the 10 folds.", 
        "209": "The performance on each fold (“test”) was obtained by training many models on 8 of the other 9 folds (“train”), selecting the model that obtained the best task-specific performance on the remaining fold (“development”), and assessing it on the test fold.", 
        "210": "Minimization of the parameters is performed with the L-BFGS algorithm (Liu and Nocedal, 1989).", 
        "211": "As a preprocessing step, the first two formants values F1 and F2 are centered around zero and scaled down by a factor of 1000 since the formant values themselves may be quite large.", 
        "212": "Specifically, we use the development fold to select among the following combinations of hyperparameters.", 
        "213": "For neural embeddings, we tried r ∈ {2, 10, 50, 100, 150, 200}.", 
        "214": "For prototype embeddings, we took the number of components r ∈ {20, 30, 40, 50}.", 
        "215": "We tried network depths d ∈ {0, 1, 2, 3}.", 
        "216": "We sweep the coefficient for an L2 regularizer on the neural network parameters.", 
        "217": "7.1 Results and Discussion  Figure 1 visualizes the diffeomorphism from formant space to metric space for one of our DPP models (depth d = 3 with r = 20 prototypes).", 
        "218": "Similar figures can be generated for all of the interpretable models.", 
        "219": "We report results for cross-entropy and the cloze evaluation in Table 1.9 Under both metrics, we see that the DPP is slightly better than the MPP; both are better than the BPP.", 
        "220": "This ranking holds for\n9Computing cross-entropy exactly is intractable with the MPP, so we resort to an unbiased importance sampling scheme where we draw samples from the BPP and reweight according to the MPP (Liu et al., 2015).", 
        "221": "each of the 3 embedding schemes.", 
        "222": "The embedding schemes themselves are compared in the caption.", 
        "223": "Within each embedding scheme, the BPP performs several points worse on the cloze tasks, confirming that dispersion is needed to model vowel inventories well.", 
        "224": "Still, the BPP’s respectable performance shows that much of the structure can be capture by focalization.", 
        "225": "As §3 noted, the BPP may generate well-dispersed sets, as the common vowels tend to be dispersed already (see Figure 4).", 
        "226": "In this capacity, however, the BPP is not explanatory as it cannot actually tell us why these vowels should be frequent.", 
        "227": "We mention that depth in the neural network is helpful, with deeper embedding networks performing slightly better than depth d = 0.", 
        "228": "Finally, we identified each model’s favorite complete vowel system of size n (Table 2).", 
        "229": "For the BPP, this is simply the n most probable vowels.", 
        "230": "Decoding the DPP and MPP is NP-hard, but we found the best system by brute force (for small n).", 
        "231": "The dispersion in these models predicts different systems than the BPP.", 
        "232": "8 Discussion: Probabilistic Typology  Typology as Density Estimation?", 
        "233": "Our goal is to define a universal distribution over all possible vowel inventories.", 
        "234": "Is this appropriate?", 
        "235": "We regard this as a natural approach to typology, because it directly describes which kinds of linguistic systems are more or less common.", 
        "236": "Traditional implicational universals (“all languages with vi have vj”) are softened, in our approach, into conditional probabilities such as “p(vj ∈ V | vi ∈ V ) ≈ 0.9.” Here the 0.9 is not merely an empirical ratio, but a smoothed\nprobability derived from the complete estimated distribution.", 
        "237": "It is meant to make predictions about unseen languages.", 
        "238": "Whether human language learners exploit any properties of this distribution10 is a separate question that goes beyond typology.", 
        "239": "Jakobson (1941) did find that children acquired phoneme inventories in an order that reflected principles similar to dispersion (“maximum contrast”) and focalization.", 
        "240": "At any rate, we estimate the distribution given some set of attested systems that are assumed to have been drawn IID from it.", 
        "241": "One might object that this IID assumption ignores evolutionary relationships among the attested systems, causing our estimated distribution to favor systems that are coincidentally frequent among current human languages, rather than being natural in some timeless sense.", 
        "242": "We reply that our approach is then appropriate when the goal of typology is to estimate the distribution of actual human languages—a distribution that can be utilized in principle (and also in practice, as we show) to predict properties of actual languages from outside the training set.", 
        "243": "A different possible goal of typology is a theory of natural human languages.", 
        "244": "This goal would require a more complex approach.", 
        "245": "One should not imagine that natural languages are drawn in a vacuum from some single, stationary distribution.", 
        "246": "Rather, each language is drawn conditionally on its parent language.", 
        "247": "Thus, one should estimate a stochastic model of the evolution of linguistic systems through time, and identify “naturalness” with\n10This could happen because learners have evolved to expect the languages (the Baldwin effect), or because the languages have evolved to be easily learned (universal grammar).", 
        "248": "the directions in which this system tends to evolve.", 
        "249": "Energy Minimization Approaches.", 
        "250": "The traditional energy-based approach (Liljencrants and Lindblom, 1972) to vowel simulation minimizes the following objective (written in our notation):\nE(m) = ∑\n1≤i<j≤m\n1\n||e(vi)− e(vj)||2 , (9)\nwhere the vectors e(vi) ∈ Rr are not spit out of a deep network, as in our case, but rather directly optimized.", 
        "251": "Liljencrants and Lindblom (1972) propose a coordinate descent algorithm to optimize E(m).", 
        "252": "While this is not in itself a probabilistic model, they generate diverse vowel systems through random restarts that find different local optima (a kind of deterministic evolutionary mechanism).", 
        "253": "We note that equation (9) assumes that the number of vowels m is given, and only encodes a notion of dispersion.", 
        "254": "Roark (2001) subsequently extended equation (9) to include the notion of focalization.", 
        "255": "Vowel Inventory Size.", 
        "256": "A fatal flaw of the traditional energy minimization paradigm is that it has no clear way to compare vowel inventories of different sizes.", 
        "257": "The problem is quite crippling since, in general, inventories with fewer vowels will have lower energy.", 
        "258": "This does not match reality—the empirical distribution over inventory sizes (shown in Figure 5) shows that the mode is actually 5 and small inventories are uncommon: no 1-vowel inventory is attested and only one 2-vowel inventory is known.", 
        "259": "A probabilistic model over all vowel systems must implicitly model the size of the system.", 
        "260": "Indeed, our models pit all potential inventories against each other, bestowing the extra burden to match the empirical distribution over size.", 
        "261": "Frequency of Inventories.", 
        "262": "Another problem is the inability to model frequency.", 
        "263": "While for inventories of a modest size (3-5 vowels) there are very few unique attested systems, there is a plethora of\nattested larger vowel systems.", 
        "264": "The energy minimization paradigm has no principled manner to tell the scientist how likely a novel system may be.", 
        "265": "Appealing again to the empirical distribution over attested vowel systems, we consider the relative diversity of systems of each size.", 
        "266": "We graph this in Figure 5.", 
        "267": "Consider all vowel systems of size 7.", 
        "268": "There are (|V| 7 ) potential inventories, yet the empirical distribution is remarkably peaked.", 
        "269": "Our probabilistic models have the advantage in this context as well, as they naturally quantify the likelihood of an individual inventory.", 
        "270": "Typology is a Small-Data Problem.", 
        "271": "In contrast to many common problems in applied NLP, e.g., part-of-speech tagging, parsing and machine translation, the modeling of linguistic typology is fundamentally a “small-data” problem.", 
        "272": "Out of the 7105 languages on earth, we only have linguistic annotation for 2600 of them (Comrie et al., 2013).", 
        "273": "Moreover, we only have phonetic and phonological annotation for a much smaller set of languages— between 300-500 (Maddieson, 2013).", 
        "274": "Given the paucity of data, overfitting on only those attested languages is a dangerous possibility—just because a certain inventory has never been attested, it is probably wrong to conclude that it is impossible— or even improbable—on that basis alone.", 
        "275": "By analogy to language modeling, almost all sentences observed in practice are novel with respect to the training data, but we still must employ a principled manner to discriminate high-probability sentences (which are syntactically and semantically coherent) from low-probability ones.", 
        "276": "Probabilistic modeling provides a natural paradigm for this sort of investigation—machine learning has developed well-understood smoothing techniques, e.g., regularization with tuning on a held-out dev set, to avoid overfitting in a small-data scenario.", 
        "277": "Related Work in NLP.", 
        "278": "Various point processes have been previously applied to potpourri of tasks\nin NLP.", 
        "279": "Determinantal point processes have found a home in the literature in tasks that require diversity.", 
        "280": "E.g., DPPs have achieved state-of-the-art results on multi-document document summarization (Kulesza and Taskar, 2011), news article selection (Affandi et al., 2012) recommender systems (Gartrell et al., 2017), joint clustering of verbal lexical semantic properties (Reichart and Korhonen, 2013), inter alia.", 
        "281": "Poisson point processes have also been applied to NLP problems: Yee et al.", 
        "282": "(2015) model the emerging topic on social media using a homogeneous point process and Lukasik et al.", 
        "283": "(2015) apply a log-Gaussian point process, a variant of the Poisson point process, to rumor detection in Twitter.", 
        "284": "We are unaware of previous attempts to probabilistically model vowel inventory typology.", 
        "285": "Future Work.", 
        "286": "This work lends itself to several technical extensions.", 
        "287": "One could expand the function f to more completely characterize each vowel’s acoustic properties, perceptual properties, or distinctive features (footnote 7).", 
        "288": "One could generalize our point process models to sample finite subsets from the continuous space of vowels (footnote 3).", 
        "289": "One could consider augmenting the MPP with a new factor that explicitly controls the size of the vowel inventory.", 
        "290": "Richer families of point processes might also be worth exploring.", 
        "291": "For example, perhaps the vowel inventory is generated by some temporal mechanism with latent intermediate steps, such as sequential selection of the vowels or evolutionary drift of the inventory.", 
        "292": "Another possibility is that vowel systems tend to reuse distinctive features or even follow factorial designs, so that an inventory with creaky front vowels also tends to have creaky back vowels.", 
        "293": "9 Conclusions  We have presented a series of point process models for the modeling of vowel system inventory typology with the goal of a mathematical grounding for research in phonological typology.", 
        "294": "All models were additionally given a deep parameterization to learn representations similar to perceptual space in cognitive science.", 
        "295": "Also, we motivated our preference for probabilistic modeling in linguistic typology over previously proposed computational approaches and argued it is a more natural research paradigm.", 
        "296": "Additionally, we have introduced several novel evaluation metrics for research in vowelsystem typology, which we hope will spark further interest in the area.", 
        "297": "Their performance was empirically validated on the Becker-Kristal corpus, which includes data from over 200 languages.", 
        "298": "Acknowledgments  The first author was funded by an NDSEG graduate fellowship, and the second author by NSF grant IIS1423276.", 
        "299": "We would like to thank Tim Vieira and Huda Khayrallah for helpful initial feedback."
    }, 
    "document_id": "P17-1109.pdf.json"
}
