{
    "abstract_sentences": {
        "1": "A fundamental question in language learning concerns the role of a speaker’s first language in second language acquisition.", 
        "2": "We present a novel methodology for studying this question: analysis of eye-movement patterns in second language reading of free-form text.", 
        "3": "Using this methodology, we demonstrate for the first time that the native language of English learners can be predicted from their gaze fixations when reading English.", 
        "4": "We provide analysis of classifier uncertainty and learned features, which indicates that differences in English reading are likely to be rooted in linguistic divergences across native languages.", 
        "5": "The presented framework complements production studies and offers new ground for advancing research on multilingualism.1"
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 541–551 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1050  1 Introduction  The influence of a speaker’s native language on learning and performance in a foreign language, also known as cross-linguistic transfer, has been studied for several decades in linguistics and psychology (Odlin, 1989; Martohardjono and Flynn, 1995; Jarvis and Pavlenko, 2008; Berkes and Flynn, 2012; Alonso, 2015).", 
        "2": "The growing availably of learner corpora has also sparked interest in cross-linguistic influence phenomena in NLP, where studies have explored the task of Native Language Identification (NLI) (Tetreault et al., 2013), as well as analysis of textual features in relation to the author’s native language (Jarvis and Crossley, 2012; Swanson and Charniak, 2013; Malmasi and Dras, 2014).", 
        "3": "Despite these advances,\n1The experimental data collected in this study will be made publicly available.", 
        "4": "the extent and nature of first language influence in second language processing remains far from being established.", 
        "5": "Crucially, most prior work on this topic focused on production, while little is currently known about cross-linguistic influence in language comprehension.", 
        "6": "In this work, we present a novel framework for studying cross-linguistic influence in language comprehension using eyetracking for reading and free-form native English text.", 
        "7": "We collect and analyze English newswire reading data from 182 participants, including 145 English as Second Language (ESL) learners from four different native language backgrounds: Chinese, Japanese, Portuguese and Spanish, as well as 37 native English speakers.", 
        "8": "Each participant reads 156 English sentences, half of which are shared across all participants, and the remaining half are individual to each participant.", 
        "9": "All the sentences are manually annotated with part-of-speech (POS) tags and syntactic dependency trees.", 
        "10": "We then introduce the task of Native Language Identification from Reading (NLIR), which requires predicting a subject’s native language from gaze while reading text in a second language.", 
        "11": "Focusing on ESL participants and using a log-linear classifier with word fixation times normalized for reading speed as features, we obtain 71.03 NLIR accuracy in the shared sentences regime.", 
        "12": "We further demonstrate that NLIR can be generalized effectively to the individual sentences regime, in which each subject reads a different set of sentences, by grouping fixations according to linguistically motivated clustering criteria.", 
        "13": "In this regime, we obtain an NLIR accuracy of 51.03.", 
        "14": "Further on, we provide classification and feature analyses, suggesting that the signal underlying NLIR is likely to be related to linguistic characteristics of the respective native languages.", 
        "15": "First, drawing on previous work on ESL production, we\n541\nobserve that classifier uncertainty in NLIR correlates with global linguistic similarities across native languages.", 
        "16": "In other words, the more similar are the languages, the more similar are the reading patterns of their native speakers in English.", 
        "17": "Second, we perform feature analysis across native and non-native English speakers, and discuss structural and lexical factors that could potentially drive some of the non-native reading patterns in each of our native languages.", 
        "18": "Taken together, our results provide evidence for a systematic influence of native language properties on reading, and by extension, on online processing and comprehension in a second language.", 
        "19": "To summarize, we introduce a novel framework for studying cross-linguistic influence in language learning by using eyetracking for reading free-form English text.", 
        "20": "We demonstrate the utility of this framework in the following ways.", 
        "21": "First, we obtain the first NLIR results, addressing both the shared and the individual textual input scenarios.", 
        "22": "We further show that reading preserves linguistic similarities across native languages of ESL readers, and perform feature analysis, highlighting key distinctive reading patterns in each native language.", 
        "23": "The proposed framework complements and extends production studies, and can inform linguistic inquiry on cross-linguistic influence.", 
        "24": "This paper is structured as follows.", 
        "25": "In section 2 we present the data and our experimental setup.", 
        "26": "Section 3 describes our approach to NLIR and summarizes the classification results.", 
        "27": "We analyze cross-linguistic influence in reading in section 4.", 
        "28": "In section 4.1 we examine NLIR classification uncertainty in relation to linguistic similarities between native languages.", 
        "29": "In section 4.2 we discuss several key fixation features associated with different native languages.", 
        "30": "Section 5 surveys related work, and section 6 concludes.", 
        "31": "2 Experimental Setup  Participants\nWe recruited 182 adult participants.", 
        "32": "Of those, 37 are native English speakers and 145 are ESL learners from four native language backgrounds: Chinese, Japanese, Portuguese and Spanish.", 
        "33": "All the participants in the experiment are native speakers of only one language.", 
        "34": "The ESL speakers were tested for English proficiency using the grammar and listening sections of the Michigan English test (MET), which consist of 50 multiple choice ques-\ntions.", 
        "35": "The English proficiency score was calculated as the number of correctly answered questions on these modules.", 
        "36": "The majority of the participants scored in the intermediate-advanced proficiency range.", 
        "37": "Table 1 presents the number of participants and the mean English proficiency score for each native language group.", 
        "38": "Additionally, we collected metadata on gender, age, level of education, duration of English studies and usage, time spent in English speaking countries and proficiency in any additional language spoken.", 
        "39": "Reading Materials\nWe utilize 14,274 randomly selected sentences from the Wall Street Journal part of the Penn Treebank (WSJ-PTB) (Marcus et al., 1993).", 
        "40": "To support reading convenience and measurement precision, the maximal sentence length was set to 100 characters, leading to an average sentence length of 11.4 words.", 
        "41": "Word boundaries are defined as whitespaces.", 
        "42": "From this sentence pool, 78 sentences (900 words) were presented to all participants (henceforth shared sentences) and the remaining 14,196 sentences were split into 182 individual batches of 78 sentences (henceforth individual sentences, averaging 880 words per batch).", 
        "43": "All the sentences include syntactic annotations from the Universal Dependency Treebank project (UDT) (McDonald et al., 2013).", 
        "44": "The annotations include PTB POS tags (Santorini, 1990), Google universal POS tags (Petrov et al., 2012) and dependency trees.", 
        "45": "The dependency annotations of the UDT are converted automatically from the manual phrase structure tree annotations of the WSJ-PTB.", 
        "46": "Gaze Data Collection\nEach participant read 157 sentences.", 
        "47": "The first sentence was presented to familiarize participants with the experimental setup and was discarded during analysis.", 
        "48": "The following 156 sentences consisted of 78 shared and 78 individual sen-\ntences.", 
        "49": "The shared and the individual sentences were mixed randomly and presented to all participants in the same order.", 
        "50": "The experiment was divided into three parts, consisting of 52 sentences each.", 
        "51": "Participants were allowed to take a short break between experimental parts.", 
        "52": "Each sentence was presented on a blank screen as a one-liner.", 
        "53": "The text appeared in Times font, with font size 23.", 
        "54": "To encourage attentive reading, upon completion of sentence reading participants answered a simple yes/no question about its content, and were subsequently informed if they answered the question correctly.", 
        "55": "Both the sentences and the questions were triggered by a 300ms gaze on a fixation target (fixation circle for sentences and the letter “Q” for questions) which appeared on a blank screen and was co-located with the beginning of the text in the following screen.", 
        "56": "Throughout the experiment, participants held a joystick with buttons for indicating completion of sentence reading and answering the comprehension questions.", 
        "57": "Eye-movement of participants’ dominant eye was recorded using a desktop mount Eyelink 1000 eyetracker, at a sampling rate of 1000Hz.", 
        "58": "Further details on the experimental setup are provided in appendix A.", 
        "59": "3 Native Language Identification from Reading  Our first goal is to determine whether the native language of ESL learners can be decoded from their gaze patterns while reading English text.", 
        "60": "We address this question in two regimes, corresponding to our division of reading input into shared and individual sentences.", 
        "61": "In the shared regime, all the participants read the same set of sentences.", 
        "62": "Normalizing over the reading input, this regime facilitates focusing on differences in reading behavior across readers.", 
        "63": "In the individual regime, we use the individual batches from our data to address the more challenging variant of the NLIR task in which the reading material given to each participant is different.", 
        "64": "3.1 Features  We seek to utilize features that can provide robust, simple and interpretable characterizations of reading patterns.", 
        "65": "To this end, we use speed normalized fixation duration measures over word sequences.", 
        "66": "Fixation Measures We utilize three measures of word fixation duration:\n• First Fixation duration (FF) Duration of the first fixation on a word.", 
        "67": "• First Pass duration (FP) Time spent from first entering a word to first leaving it (including re-fixations within the word).", 
        "68": "• Total Fixation duration (TF) The sum of all fixation times on a word.", 
        "69": "We experiment with fixations over unigram, bigram and trigram sequences seqi,k = wi, ..., wi+k−1, k ∈ {1, 2, 3}, where for each metric M ∈ {FF, FP, TF} the fixation time for a sequence Mseqi,k is defined as the sum of fixations on individual tokens Mw in the sequence2.", 
        "70": "Mseqi,k = ∑\nw′∈seqi,k Mw′ (1)\nImportantly, we control for variation in reading speeds across subjects by normalizing each subjects’s sequence fixation times.", 
        "71": "For each metric M and sequence seqi,k we normalize the sequence fixation time Mseqi,k relative to the subject’s sequence fixation times in the textual context of the sequence.", 
        "72": "The context C is defined as the sentence in which the sequence appears for the Words in Fixed Context feature-set and the entire textual input for the Syntactic and Information clusters feature-sets (see definitions of feature-sets below).", 
        "73": "The normalization term SM,C,k is accordingly defined as the metric’s fixation time per sequence of length k in the context:\nSM,C,k = 1 |C| ∑\nseqk∈C Mseqk (2)\nWe then obtain a normalized fixation time Mnormseqi,k as:\nMnormseqi,k = Mseqi,k SM,C,k\n(3)\n2Note that for bigrams and trigrams, one could also measure FF and FP for interest regions spanning the sequence, instead, or in addition to summing these fixation times over individual tokens.", 
        "74": "Feature Types We use the above presented speed normalized fixation metrics to extract three feature-sets, Words in Fixed Context (WFC), Syntactic Clusters (SC) and Information Clusters (IC).", 
        "75": "WFC is a token-level feature-set that presupposes a fixed textual input for all participants.", 
        "76": "It is thus applicable only in the shared sentences regime.", 
        "77": "SC and IC are typelevel features which provide abstractions over sequences of words.", 
        "78": "Crucially, they can also be applied when participants read different sentences.", 
        "79": "• Words in Fixed Context (WFC) The WFC features capture fixation times on word sequences in a specific sentence.", 
        "80": "This featureset consists of FF, FP and TF times for each of the 900 unigram, 822 bigram, and 744 trigram word sequences comprising the shared sentences.", 
        "81": "The fixation times of each metric are normalized for each participant relative to their fixations on sequences of the same length in the surrounding sentence.", 
        "82": "As noted above, the WFC feature-set is not applicable in the individual regime, as it requires identical sentences for all participants.", 
        "83": "• Syntactic Clusters (SC) CS features are average globally normalized FF, FP and TF times for word sequences clustered by our three types of syntactic labels: universal POS, PTB POS, and syntactic relation labels.", 
        "84": "An example of such a feature is the average of speed-normalized TF times spent on the PTB POS bigram sequence DT NN.", 
        "85": "We take into account labels that appear at least once in the reading input of all participants.", 
        "86": "On the four non-native languages, considering all three label types, we obtain 104 unigram, 636 bigram and 1,310 trigram SC features per fixation metric in the shared regime, and 56 unigram, 95 bigram and 43 trigram SC features per fixation metric in the individual regime.", 
        "87": "• Information Clusters (IC) We also obtain average FF, FP and TF for words clustered according to their length, measured in number of characters.", 
        "88": "Word length was previously shown to be a strong predictor of information content (Piantadosi et al., 2011).", 
        "89": "As such, it provides an alternative abstraction to the syntactic clusters, combining both syntactic and lexical information.", 
        "90": "As with SC features, we take into account features that ap-\npear at least once in the textual input of all participants.", 
        "91": "For our set of non-native languages, we obtain for each fixation metric 15 unigram, 21 bigram and 23 trigram IC features in the shared regime, and 12 unigram, 18 bigram and 18 trigram IC features in the individual regime.", 
        "92": "Notably, this feature-set is very compact, and differently from the syntactic clusters, does not rely on the availability of external annotations.", 
        "93": "In each feature-set, we perform a final preprocessing step for each individual feature, in which we derive a zero mean unit variance scaler from the training set feature values, and apply it to transform both the training and the test values of the feature to Z scores.", 
        "94": "3.2 Model  The experiments are carried out using a log-linear model:\np(y|x; θ) = exp(θ · f(x, y))∑ y′∈Y exp(θ · f(x, y′))\n(4)\nwhere y is the reader’s native language, x is the reading input and θ are the model parameters.", 
        "95": "The classifier is trained with gradient descent using LBFGS (Byrd et al., 1995).", 
        "96": "3.3 Experimental Results  In table 2 we report 10-fold cross-validation results on NLIR in the shared and the individual experimental regimes for native speakers of Chinese, Japanese, Portuguese and Spanish.", 
        "97": "We introduce two baselines against which we compare the performance of our feature-sets.", 
        "98": "The majority baseline selects the native language with the largest number of participants.", 
        "99": "The random clusters baseline clusters words into groups randomly, with the number of groups set to the number of syntactic categories in our data.", 
        "100": "In the shared regime, WFC fixations yield the highest classification rates, substantially outperforming the cluster feature-sets and the two baselines.", 
        "101": "The strongest result using this featureset, 71.03, is obtained by combining unigram, bigram and trigram fixation times.", 
        "102": "In addition to this outcome, we note that training binary classifiers in this setup yields accuracies ranging from 68.49 for the language pair Portuguese and Spanish, to 93.15 for Spanish and Japanese.", 
        "103": "These results confirm the effectiveness of the shared input\nregime for performing reliable NLIR, and suggest a strong native language signal in non-native reading fixation times.", 
        "104": "SC features yield accuracies of 45.52 to 58.62 on the shared sentences, while IC features exhibit weaker performance in this regime, with accuracies of 41.38 to 46.21.", 
        "105": "Both results are well above chance, but lower than WFC fixations due to the information loss imposed by the clustering step.", 
        "106": "Crucially, both feature-sets remain effective in the individual input regime, with 43.45 to 48.97 accuracy for SC features and 32.41 to 38.62 accuracy for IC features.", 
        "107": "The strongest result in the individual regime is 51.03, obtained by concatenating IC and SC features over unigrams.", 
        "108": "We also note that using this setup in a binary classification scheme yields results ranging from chance level 49.31 for Portuguese versus Spanish, to 84.93 on Spanish versus Japanese.", 
        "109": "Generally, we observe that adding bigram and trigram fixations in the shared regime leads to performance improvements compared to using unigram features only.", 
        "110": "This trend does not hold for the individual sentences, presumably due to a combination of feature sparsity and context variation in this regime.", 
        "111": "We also note that IC and SC features tend to perform better together than in separation, suggesting that the information encoded using these feature-sets is to some extent complementary.", 
        "112": "The generalization power of our cluster based feature-sets has both practical and theoretical consequences.", 
        "113": "Practically, they provide useful abstractions for performing NLIR over arbitrary textual input.", 
        "114": "That is, they enable performing this task using any textual input during both training and testing phases.", 
        "115": "Theoretically, the effectiveness of linguistically motivated features in discerning native languages suggests that linguistic factors\nplay an important role in the ESL reading process.", 
        "116": "The analysis presented in the following sections will further explore this hypothesis.", 
        "117": "4 Analysis of Cross-Linguistic Influence in ESL Reading  As mentioned in the previous section, the ability to perform NLIR in general, and the effectiveness of linguistically motivated features in particular, suggest that linguistic factors in the native and second languages are pertinent to ESL reading.", 
        "118": "In this section we explore this hypothesis further, by analyzing classifier uncertainty and the features learned in the NLIR task.", 
        "119": "4.1 Preservation of Linguistic Similarity  Previous work in NLP suggested a link between textual patterns in ESL production and linguistic similarities of the respective native languages (Nagata and Whittaker, 2013; Nagata, 2014; Berzak et al., 2014, 2015).", 
        "120": "In particular, Berzak et al.", 
        "121": "(2014) has demonstrated that NLI classification uncertainty correlates with similarities between languages with respect to their typological features.", 
        "122": "Here, we extend this framework and examine if preservation of native language similarities in ESL production is paralleled in reading.", 
        "123": "Similarly to Berzak et al.", 
        "124": "(2014) we define the classification uncertainty for a pair of native languages y and y′ in our data collection D, as the average probability assigned by the NLIR classifier to one language given the other being the true native language.", 
        "125": "This approach provides a robust measure of classification confusion that does not rely on the actual performance of the classifier.", 
        "126": "We interpret the classifier uncertainty as a similarity measure between the respective languages and de-\nnote it as English Reading Similarity ERS.", 
        "127": "ERSy,y′ =\n∑ (x,y)∈Dy p(y′|x;θ)+ ∑ (x,y′)∈Dy′ p(y|x;θ)\n|Dy |+|Dy′ | (5)\nWe compare these reading similarities to the linguistic similarities between our native languages.", 
        "128": "To approximate these similarities, we utilize feature vectors from the URIEL Typological Compendium (Littel et al., 2016) extracted using the lang2vec tool (Littell et al., 2017).", 
        "129": "URIEL aggregates, fuses and normalizes typological, phylogenetic and geographical information about the world’s languages.", 
        "130": "We obtain all the 103 available morphosyntactic features in URIEL, which are derived from the World Atlas of Language Structures (WALS) (Dryer and Haspelmath, 2013), Syntactic Structures of the World’s Languages (SSWL) (Collins and Kayne, 2009) and Ethnologue (Lewis et al., 2015).", 
        "131": "Missing feature values are completed with a KNN classifier.", 
        "132": "We also extract URIEL’s 3,718 language family features derived from Glottolog (Hammarström et al., 2015).", 
        "133": "Each of these features represents membership in a branch of Glottolog’s world language tree.", 
        "134": "Truncating features with the same value for all our languages, we remain with 76 features, consisting of 49 syntactic features and 27 family tree features.", 
        "135": "The linguistic similarity LS between a pair of languages y and y′ is then determined by the cosine similarity of their URIEL feature vectors.", 
        "136": "LSy,y′ = vy · vy′ ‖vy‖‖vy′‖\n(6)\nFigure 1 presents the URIEL based linguistic similarities for our set of non-native languages against the average NLIR classification uncertainties on the cross-validation test samples.", 
        "137": "The results presented in this figure are based on the unigram IC+SC feature-set in the individual sentences regime.", 
        "138": "We also provide a graphical illustration of the language similarities for each measure, using the Ward clustering algorithm (Ward Jr, 1963).", 
        "139": "We observe a correlation between the two measures which is also reflected in similar hierarchies in the two language trees.", 
        "140": "Thus, linguistically motived features in English reveal linguistic similarities across native languages.", 
        "141": "This outcome supports the hypothesis that English\nreading differences across native languages are related to linguistic factors.", 
        "142": "We note that while comparable results are obtained for the IC and SC feature-sets, together and in separation in the shared regime, WFC features in the shared regime do not exhibit a clear uncertainty distinction when comparing across the pairs Japanese and Spanish, Japanese and Portuguese, Chinese and Spanish, and Chinese and Portuguese.", 
        "143": "Instead, this feature-set yields very low uncertainty, and correspondingly very high performance ranging from 90.41 to 93.15, for all four language pairs.", 
        "144": "4.2 Feature Analysis  Our framework enables not only native language classification, but also exploratory analysis of native language specific reading patterns in English.", 
        "145": "The basic question that we examine in this respect is on which features do readers of different native language groups spend more versus less time.", 
        "146": "We also discuss several potential relations of the observed reading time differences to usage patterns and grammatical errors committed by speakers of our four native languages in production.", 
        "147": "We obtain this information by extracting grammatical error counts from the CLC FCE corpus (Yannakoudakis et al., 2011), and from the ngram frequency analysis in Nagata and Whittaker (2013).", 
        "148": "In order to obtain a common benchmark for reading time comparisons across non-native speakers, in this analysis we also consider our group of native English speakers.", 
        "149": "In this context, we train four binary classifiers that discern each of the non-native groups from native English speakers based on TF times over unigram PTB POS tags in the shared regime.", 
        "150": "The features with the strongest positive and negative weights learned by these classifiers are presented in table 3.", 
        "151": "These features serve as a reference point for selecting the case studies discussed below.", 
        "152": "Interestingly, some of the reading features that are most predictive of each native language lend themselves to linguistic interpretation with respect to structural factors.", 
        "153": "For example, in Japanese and Chinese we observe shorter reading times for determiners (DT), which do not exist in these languages.", 
        "154": "Figure 2a presents the mean TF times for determiners in all five native languages, suggesting that native speakers of Portuguese and Spanish, which do have determiners, do not exhibit reduced reading times on this structure compared to natives.", 
        "155": "In ESL production, missing determiner errors are the most frequent error for native speakers of Japanese and third most common error for native speakers of Chinese.", 
        "156": "In figure 2b we present the mean TF reading times for pronouns (PRP), where we also see shorter reading times by natives of Japanese and Chinese as compared to English natives.", 
        "157": "In both languages pronouns can be omitted both in object and subject positions.", 
        "158": "Portuguese and Spanish, in which pronoun omission is restricted to the subject position present similar albeit weaker tendency.", 
        "159": "In figure 2c we further observe that differently from natives of Chinese and Japanese, native speakers of Portuguese and Spanish spend more time on NN+POS in head final possessives such as “the public’s confidence”.", 
        "160": "While similar constructions exist in Chinese and Japanese, the NN+POS combination is expressed in Portuguese and Spanish as a head initial NN of NN.", 
        "161": "This form exists in English (e.g.", 
        "162": "“the confidence of the public”) and is preferred by speakers of these languages in ESL writing (Nagata and Whittaker, 2013).", 
        "163": "As an additional baseline for this construction, we provide the TF times for NN in figure 2d.", 
        "164": "There, relative to English natives, we observe longer reading times for Japanese and Chinese and comparable times for Portuguese and Spanish.", 
        "165": "The reading times of NN in figure 2d also give\nrise to a second, potentially competing interpretation of differences in ESL reading times, which highlights lexical rather than structural factors.", 
        "166": "According to this interpretation, increased reading times of nouns are the result of substantially smaller lexical sharing with English by Chinese and Japanese as compared to Spanish and Portuguese.", 
        "167": "Given the utilized speed normalization, lexical effects on nouns could in principle account for reduced reading times on determiners and pronouns.", 
        "168": "Conversely, structural influence leading to reduced reading times on determiners and pronouns could explain longer dwelling on nouns.", 
        "169": "A third possibility consistent with the observed reading patterns would allow for both structural and lexical effects to impact second language reading.", 
        "170": "Importantly, in each of these scenarios, ESL reading patterns are related to linguistic factors of the reader’s native language.", 
        "171": "We note that the presented analysis is preliminary in nature, and warrants further study in future research.", 
        "172": "In particular, reading times and classifier learned features may in some cases differ between the shared and the individual regimes.", 
        "173": "In the examples presented above, similar results are obtained in the individual sentences regime for DT, PRP and NN.", 
        "174": "The trend for the NN+POS construction, however, diminishes in that setup with similar reading times for all languages.", 
        "175": "On the other hand, one of the strongest features for predicting Portuguese and Spanish in the individual regime are longer reading times for prepositions (IN), an outcome that holds in the shared regime only relative to Chinese and Japanese, but not relative to native speakers of English.", 
        "176": "Despite these caveats, our results suggest that reading patterns can potentially be related to linguistic factors of the reader’s native language.", 
        "177": "This analysis can be extended in various ways, such as inclusion of additional feature types and fixation metrics, as well as utilization of other comparative methodologies.", 
        "178": "Combined with evidence from language production, this line of investigation can be instrumental for informing linguistic theory of cross-linguistic influence.", 
        "179": "5 Related Work  Eyetracking and second language reading Second language reading has been studied using eyetracking, with much of the work focusing on processing of syntactic ambiguities and analysis\nof specific target word classes such as cognates (Dussias, 2010; Roberts and Siyanova-Chanturia, 2013).", 
        "180": "In contrast to our work, such studies typically use controlled, rather than free-form sentences.", 
        "181": "Investigation of global metrics in freeform second language reading was introduced only recently by Cop et al.", 
        "182": "(2015).", 
        "183": "This study compared ESL and native reading of a novel by native speakers of Dutch, observing longer sentence reading times, more fixations and shorter saccades in ESL reading.", 
        "184": "Differently from this study, our work focuses on comparison of reading patterns between different native languages.", 
        "185": "We also analyze a related, but different metric, namely speed normalized fixation durations on word sequences.", 
        "186": "Eyetracking for NLP tasks Recent work in NLP has demonstrated that reading gaze can serve as a valuable supervision signal for standard NLP tasks.", 
        "187": "Prominent examples of such work include POS tagging (Barrett and Søgaard, 2015a; Barrett et al., 2016), syntactic parsing (Barrett and Søgaard, 2015b) and sentence compression (Klerke et al., 2016).", 
        "188": "Our work also tackles a traditional NLP task with free-form text, but differs from this line of research in that it addresses this task only in comprehension.", 
        "189": "Furthermore, while these studies use gaze recordings of native readers, our work focuses on non-native readers.", 
        "190": "NLI in production NLI was first introduced in Koppel et al.", 
        "191": "(2005) and has been drawing considerable attention in NLP, including a recent shared-task challenge with 29 participating teams (Tetreault et al., 2013).", 
        "192": "NLI has also been driving much of the work on identification of native language related features in writing (Tsur and Rappoport, 2007; Jarvis and Crossley, 2012; Brooke and Hirst, 2012; Tetreault et al., 2012; Swanson and Charniak, 2013, 2014; Malmasi and Dras, 2014; Bykh and Meurers, 2016).", 
        "193": "Several studies have also linked usage patterns and grammatical errors in production to linguistic properties of the writer’s native language (Nagata and Whittaker, 2013; Nagata, 2014; Berzak et al., 2014, 2015).", 
        "194": "Our work departs from NLI in writing and introduces NLI and related feature analysis in reading.", 
        "195": "6 Conclusion and Outlook  We present a novel framework for studying crosslinguistic influence in multilingualism by measuring gaze fixations during reading of free-form En-\nglish text.", 
        "196": "We demonstrate for the first time that this signal can be used to determine a reader’s native language.", 
        "197": "The effectiveness of linguistically motivated criteria for fixation clustering and our subsequent analysis suggest that the ESL reading process is affected by linguistic factors.", 
        "198": "Specifically, we show that linguistic similarities between native languages are reflected in similarities in ESL reading.", 
        "199": "We also identify several key features that characterize reading in different native languages, and discuss their potential connection to structural and lexical properties of the native langauge.", 
        "200": "The presented results demonstrate that eyetracking data can be instrumental for developing predictive and explanatory models of second language reading.", 
        "201": "While this work is focused on NLIR from fixations, our general framework can be used to address additional aspects of reading, such as analysis of saccades and gaze trajectories.", 
        "202": "In future work, we also plan to explore the role of native and second language writing system characteristics in second language reading.", 
        "203": "More broadly, our methodology introduces parallels with production studies in NLP, creating new opportunities for integration of data, methodologies and tasks between production and comprehension.", 
        "204": "Furthermore, it holds promise for formulating language learning theory that is supported by empirical findings in naturalistic setups across language processing domains.", 
        "205": "Acknowledgements  We thank Amelia Smith, Emily Weng, Run Chen and Lila Jansen for contributions to stimuli preparation and data collection.", 
        "206": "We also thank Andrei Barbu, Guy Ben-Yosef, Yen-Ling Kuo, Roger Levy, Jonathan Malmaud, Karthik Narasimhan and the anonymous reviewers for valuable feedback on this work.", 
        "207": "This material is based upon work supported by the Center for Brains, Minds, and Machines (CBMM), funded by NSF STC award CCF-1231216.", 
        "208": "A Supplemental Material  Eyetracking Setup We use a 44.5x30cm screen with 1024x768px resolution to present the reading materials, and a desktop mount Eyelink 1000 eyetracker (1000Hz) to record gaze.", 
        "209": "The screen, eyetracker camera and chinrest are horizontally aligned on a table surface.", 
        "210": "The screen center (x=512, y=384) is 79cm away from the center of\nthe forehead bar, and 13cm below it.", 
        "211": "The eyetracker camera knob is 65cm away from forehead bar.", 
        "212": "Throughout the experiment participants hold a joystick with a button for indicating sentence completion, and two buttons for answering yes/no questions.", 
        "213": "We record gaze of the participant’s dominant eye.", 
        "214": "Text Parameters All the textual material in the experiment is presented using Times font, normal style, with font size 23.", 
        "215": "In our setup, this corresponds to 0.36 degrees (11.3px) average lower case letter width, and 0.49 degrees (15.7px) average upper case letter width.", 
        "216": "We chose a nonmonospace font, as such fonts are generally more common in reading.", 
        "217": "They are also more compact compared to monospace fonts, allowing to substantially increase the upper limit for sentence length.", 
        "218": "Calibration We use 3H line calibration with point repetition on the central horizontal line (y=384), using 16px outer circle, 6px inner circle, fixation points.", 
        "219": "At least three calibrations are performed during the experiment, one at the beginning of each experimental section.", 
        "220": "We also recalibrate upon failure to produce a 300ms fixation on any fixation trigger preceding a sentence or a question within 4 seconds after its appearance.", 
        "221": "The mean validation error for calibrations across subjects is 0.146 degrees (std 0.038)."
    }, 
    "document_id": "P17-1050.pdf.json"
}
