{
    "abstract_sentences": {
        "1": "Recurrent Neural Networks are showing much promise in many sub-areas of natural language processing, ranging from document classification to machine translation to automatic question answering.", 
        "2": "Despite their promise, many recurrent models have to read the whole text word by word, making it slow to handle long documents.", 
        "3": "For example, it is difficult to use a recurrent network to read a book and answer questions about it.", 
        "4": "In this paper, we present an approach of reading text while skipping irrelevant information if needed.", 
        "5": "The underlying model is a recurrent network that learns how far to jump after reading a few words of the input text.", 
        "6": "We employ a standard policy gradient method to train the model to make discrete jumping decisions.", 
        "7": "In our benchmarks on four different tasks, including number prediction, sentiment analysis, news article classification and automatic Q&A, our proposed model, a modified LSTM with jumping, is up to 6 times faster than the standard sequential LSTM, while maintaining the same or even better accuracy."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1880–1890 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1172  1 Introduction  The last few years have seen much success of applying neural networks to many important applications in natural language processing, e.g., partof-speech tagging, chunking, named entity recognition (Collobert et al., 2011), sentiment analysis (Socher et al., 2011, 2013), document classification (Kim, 2014; Le and Mikolov, 2014; Zhang et al., 2015; Dai and Le, 2015), machine translation (Kalchbrenner and Blunsom, 2013; Sutskever\n∗Most of work was done when AWY was with Google.", 
        "2": "et al., 2014; Bahdanau et al., 2014; Sennrich et al., 2015; Wu et al., 2016), conversational/dialogue modeling (Sordoni et al., 2015; Vinyals and Le, 2015; Shang et al., 2015), document summarization (Rush et al., 2015; Nallapati et al., 2016), parsing (Andor et al., 2016) and automatic question answering (Q&A) (Weston et al., 2015; Hermann et al., 2015; Wang and Jiang, 2016; Wang et al., 2016; Trischler et al., 2016; Lee et al., 2016; Seo et al., 2016; Xiong et al., 2016).", 
        "3": "An important characteristic of all these models is that they read all the text available to them.", 
        "4": "While it is essential for certain applications, such as machine translation, this characteristic also makes it slow to apply these models to scenarios that have long input text, such as document classification or automatic Q&A.", 
        "5": "However, the fact that texts are usually written with redundancy inspires us to think about the possibility of reading selectively.", 
        "6": "In this paper, we consider the problem of understanding documents with partial reading, and propose a modification to the basic neural architectures that allows them to read input text with skipping.", 
        "7": "The main benefit of this approach is faster inference because it skips irrelevant information.", 
        "8": "An unexpected benefit of this approach is that it also helps the models generalize better.", 
        "9": "In our approach, the model is a recurrent network, which learns to predict the number of jumping steps after it reads one or several input tokens.", 
        "10": "Such a discrete model is therefore not fully differentiable, but it can be trained by a standard policy gradient algorithm, where the reward can be the accuracy or its proxy during training.", 
        "11": "In our experiments, we use the basic LSTM recurrent networks (Hochreiter and Schmidhuber, 1997) as the base model and benchmark the proposed algorithm on a range of document classification or reading comprehension tasks, using various datasets such as Rotten Tomatoes (Pang\n1880\nand Lee, 2005), IMDB (Maas et al., 2011), AG News (Zhang et al., 2015) and Children’s Book Test (Hill et al., 2015).", 
        "12": "We find that the proposed approach of selective reading speeds up the base model by two to six times.", 
        "13": "Surprisingly, we also observe our model beats the standard LSTM in terms of accuracy.", 
        "14": "In summary, the main contribution of our work is to design an architecture that learns to skim text and show that it is both faster and more accurate in practical applications of text processing.", 
        "15": "Our model is simple and flexible enough that we anticipate it would be able to incorporate to recurrent nets with more sophisticated structures to achieve even better performance in the future.", 
        "16": "2 Methodology  In this section, we introduce the proposed model named LSTM-Jump.", 
        "17": "We first describe its main structure, followed by the difficulty of estimating part of the model parameters because of nondifferentiability.", 
        "18": "To address this issue, we appeal to a reinforcement learning formulation and adopt a policy gradient method.", 
        "19": "2.1 Model Overview  The main architecture of the proposed model is shown in Figure 1, which is based on an LSTM recurrent neural network.", 
        "20": "Before training, the number of jumps allowed N , the number of tokens read between every two jumps R and the maximum size of jumping K are chosen ahead of time.", 
        "21": "While K is a fixed parameter of the model, N and R are hyperparameters that can vary between training and testing.", 
        "22": "Also, throughout the paper, we would use d1:p to denote a sequence d1, d2, ..., dp.", 
        "23": "In the following, we describe in detail how the model operates when processing text.", 
        "24": "Given a training example x1:T , the recurrent network will read the embedding of the first R tokens x1:R and output the hidden state.", 
        "25": "Then this state is used to compute the jumping softmax that determines a distribution over the jumping steps between 1 and K. The model then samples from this distribution a jumping step, which is used to decide the next token to be read into the model.", 
        "26": "Let κ be the sampled value, then the next starting token is xR+κ.", 
        "27": "Such process continues until either\na) the jump softmax samples a 0; or b) the number of jumps exceeds N ; or c) the model reaches the last token xT .", 
        "28": "After stopping, as the output, the latest hidden state is further used for predicting desired targets.", 
        "29": "How to leverage the hidden state depends on the specifics of the task at hand.", 
        "30": "For example, for classification problems in Section 3.1, 3.2 and 3.3, it is directly applied to produce a softmax for classification, while in automatic Q&A problem of Section 3.4, it is used to compute the correlation with the candidate answers in order to select the best one.", 
        "31": "Figure 1 gives an example with K = 5, R = 2 and N = 10 terminating on condition a).", 
        "32": "2.2 Training with REINFORCE  Our goal for training is to estimate the parameters of LSTM and possibly word embedding, which are denoted as θm, together with the jumping action parameters θa.", 
        "33": "Once obtained, they can be used for inference.", 
        "34": "The estimation of θm is straightforward in the tasks that can be reduced as classification problems (which is essentially what our experiments cover), as the cross entropy objective J1(θm) is\ndifferentiable over θm that we can directly apply backpropagation to minimize.", 
        "35": "However, the nature of discrete jumping decisions made at every step makes it difficult to estimate θa, as cross entropy is no longer differentiable over θa.", 
        "36": "Therefore, we formulate it as a reinforcement learning problem and apply policy gradient method to train the model.", 
        "37": "Specifically, we need to maximize a reward function over θa which can be constructed as follows.", 
        "38": "Let j1:N be the jumping action sequence during the training with an example x1:T .", 
        "39": "Suppose hi is a hidden state of the LSTM right before the i-th jump ji,1 then it is a function of j1:i−1 and thus can be denoted as hi(j1:i−1).", 
        "40": "Now the jump is attained by sampling from the multinomial distribution p(ji|hi(j1:i−1); θa), which is determined by the jump softmax.", 
        "41": "We can receive a reward R after processing x1:T under the current jumping strategy.2 The reward should be positive if the output is favorable or non-positive otherwise.", 
        "42": "In our experiments, we choose\nR = { 1 if prediction correct; −1 otherwise.", 
        "43": "Then the objective function of θa we want to maximize is the expected reward under the distribution defined by the current jumping policy, i.e.,\nJ2(θa) = Ep(j1:N ;θa)[R].", 
        "44": "(1)\nwhere p(j1:N ; θa) = ∏ i p(j1:i|hi(j1:i−1); θa).", 
        "45": "Optimizing this objective numerically requires computing its gradient, whose exact value is intractable to obtain as the expectation is over high dimensional interaction sequences.", 
        "46": "By running S examples, an approximated gradient can be computed by the following REINFORCE algorithm (Williams, 1992):\n∇θaJ2(θa) = N∑\ni=1\nEp(j1:N ;θa)[∇θa log p(j1:i|hi; θa)R]\n≈ 1 S\nS∑\ns=1\nN∑\ni=1\n[∇θa log p(js1:i|hsi ; θa)Rs]\nwhere the superscript s denotes a quantity belonging to the s-th example.", 
        "47": "Now the term\n1The i-th jumping step is usually not xi.", 
        "48": "2In the general case, one may receive (discounted) intermediate rewards after each jump.", 
        "49": "But in our case, we only consider final reward.", 
        "50": "It is equivalent to a special case that all intermediate rewards are identical and without discount.", 
        "51": "∇θa log p(j1:i|hi; θa) can be computed by standard backpropagation.", 
        "52": "Although the above estimation of ∇θaJ2(θa) is unbiased, it may have very high variance.", 
        "53": "One widely used remedy to reduce the variance is to subtract a baseline value bsi from the reward R\ns, such that the approximated gradient becomes\n∇θaJ2(θa) ≈ 1\nS\nS∑\ns=1\nN∑\ni=1\n[∇θa log p(js1:i|hsi ; θ)(Rs−bsi )]\nIt is shown (Williams, 1992; Zaremba and Sutskever, 2015) that any number bsi will yield an unbiased estimation.", 
        "54": "Here, we adopt the strategy of Mnih et al.", 
        "55": "(2014) that bsi = wbh s i + cb and the parameter θb = {wb, cb} is learned by minimizing (Rs− bsi )2.", 
        "56": "Now the final objective to minimize is\nJ(θm, θa, θb) = J1(θm)−J2(θa)+ S∑\ns=1\nN∑\ni=1\n(Rs−bsi )2,\nwhich is fully differentiable and can be solved by standard backpropagation.", 
        "57": "2.3 Inference  During inference, we can either use sampling or greedy evaluation by selecting the most probable jumping step suggested by the jump softmax and follow that path.", 
        "58": "In the our experiments, we will adopt the sampling scheme.", 
        "59": "3 Experimental Results  In this section, we present our empirical studies to understand the efficiency of the proposed model in reading text.", 
        "60": "The tasks under experimentation are: synthetic number prediction, sentiment analysis, news topic classification and automatic question answering.", 
        "61": "Those, except the first one, are representative tasks in text reading involving different sizes of datasets and various levels of text processing, from character to word and to sentence.", 
        "62": "Table 1 summarizes the statistics of the dataset in our experiments.", 
        "63": "To exclude the potential impact of advanced models, we restrict our comparison between the vanilla LSTM (Hochreiter and Schmidhuber, 1997) and our model, which is referred to as LSTM-Jump.", 
        "64": "In a nutshell, we show that, while achieving the same or even better testing accuracy, our model is up to 6 times and 66 times faster than the baseline LSTM model in real and synthetic\ndatasets, respectively, as we are able to selectively skip a large fraction of text.", 
        "65": "In fact, the proposed model can be readily extended to other recurrent neural networks with sophisticated mechanisms such as attention and/or hierarchical structure to achieve higher accuracy than those presented below.", 
        "66": "However, this is orthogonal to the main focus of this work and would be left as an interesting future work.", 
        "67": "General Experiment Settings We use the Adam optimizer (Kingma and Ba, 2014) with a learning rate of 0.001 in all experiments.", 
        "68": "We also apply gradient clipping to all the trainable variables with the threshold of 1.0.", 
        "69": "The dropout rate between the LSTM layers is 0.2 and the embedding dropout rate is 0.1.", 
        "70": "We repeat the notations N,K,R defined previously in Table 2, so readers can easily refer to when looking at Tables 4,5,6 and 7.", 
        "71": "While K is fixed during both training and testing, we would fix R and N at training but vary their values during test to see the impact of parameter changes.", 
        "72": "Note that N is essentially a constraint which can be relaxed.", 
        "73": "Yet we prefer to enforce this constraint here to let the model learn to read fewer tokens.", 
        "74": "Finally, the reported test time is measured by running one pass of the whole test set instance by instance, and the speedup is over the base LSTM model.", 
        "75": "The code is written with TensorFlow.3  3.1 Number Prediction with a Synthetic Dataset  We first test whether LSTM-Jump is indeed able to learn how to jump if a very clear jumping sig-\n3https://www.tensorflow.org/\nnal is given in the text.", 
        "76": "The input of the task is a sequence of L positive integers x0:T−1 and the output is simply xx0 .", 
        "77": "That is, the output is chosen from the input sequence, with index determined by x0 .", 
        "78": "Here are two examples to illustrate the idea:\ninput1 : 4, 5, 1, 7, 6, 2. output1 : 6\ninput2 : 2, 4, 9, 4, 5, 6. output2 : 9\nOne can see that x0 is essentially the oracle jumping signal, i.e.", 
        "79": "the indicator of how many steps the reading should jump to get the exact output and obviously, the remaining number of the sequence are useless.", 
        "80": "After reading the first token, a “smart” network should be able to learn from the training examples to jump to the output position, skipping the rest.", 
        "81": "We generate 1 million training and 10,000 validation examples with the rule above, each with sequence length T = 100.", 
        "82": "We also impose 1 ≤ x0 < T to ensure the index is valid.", 
        "83": "We find that directly training the LSTM-Jump with full sequence is unlikely to converge, therefore, we adopt a curriculum training scheme.", 
        "84": "More specifically, we generate sequences with lengths {10, 20, 30, 40, 50, 60, 70, 80, 90, 100} and train the model starting from the shortest.", 
        "85": "Whenever the training accuracy reaches a threshold, we shift to longer sequences.", 
        "86": "We also train an LSTM with the same curriculum training scheme.", 
        "87": "The training stops when the validation accuracy is larger than 98%.", 
        "88": "We choose such stopping criterion simply because it is the highest that both models can achieve.4 All the networks are single layered, with hidden size 512, embedding size 32 and batch size 100.", 
        "89": "During testing, we generate sequences of lengths 10, 100 and 1000 with the same rule, each having 10,000 examples.", 
        "90": "As the training size is large enough, we do not have to worry about overfitting so dropout is not applied.", 
        "91": "In fact, we find that the training, validation and testing accuracies are almost the same.", 
        "92": "4In fact, our model can get higher but we stick to 98% for ease of comparison.", 
        "93": "The results of LSTM and our method, LSTMJump, are shown in Table 3.", 
        "94": "The first observation is that LSTM-Jump is faster than LSTM; the longer the sequence is, the more significant speedup LSTM-Jump can gain.", 
        "95": "This is because the well-trained LSTM-Jump is aware of the jumping signal at the first token and hence can directly jump to the output position to make prediction, while LSTM is agnostic to the signal and has to read the whole sequence.", 
        "96": "As a result, the reading speed of LSTM-Jump is hardly affected by the length of sequence, but that of LSTM is linear with respect to length.", 
        "97": "Besides, LSTM-Jump also outperforms LSTM in terms of test accuracy under all cases.", 
        "98": "This is not surprising either, as LSTM has to read a large amount of tokens that are potentially not helpful and could interfere with the prediction.", 
        "99": "In summary, the results indicate LSTM-Jump is able to learn to jump if the signal is clear.", 
        "100": "3.2 Word Level Sentiment Analysis with Rotten Tomatoes and IMDB datasets  As LSTM-Jump has shown great speedups in the synthetic dataset, we would like to understand whether it could carry this benefit to real-world data, where “jumping” signal is not explicit.", 
        "101": "So in this section, we conduct sentiment analysis on two movie review datasets, both containing equal numbers of positive and negative reviews.", 
        "102": "The first dataset is Rotten Tomatoes, which contains 10,662 documents.", 
        "103": "Since there is not a standard split, we randomly select around 80% for training, 10% for validation, and 10% for testing.", 
        "104": "The average and maximum lengths of the reviews are 22 and 56 words respectively, and we pad each of them to 60.", 
        "105": "We choose the pre-trained word2vec embeddings5 (Mikolov et al., 2013) as\n5https://code.google.com/archive/p/ word2vec/\nour fixed word embedding that we do not update this matrix during training.", 
        "106": "Both LSTM-Jump and LSTM contain 2 layers, 256 hidden units and the batch size is 100.", 
        "107": "As the amount of training data is small, we slightly augment the data by sampling a continuous 50-word sequence in each padded reviews as one training sample.", 
        "108": "During training, we enforce LSTM-Jump to read 8 tokens before a jump (R = 8), and the maximum skipping tokens per jump is 10 (K = 10), while the number of jumps allowed is 3 (N = 3).", 
        "109": "The testing result is reported in Table 4.", 
        "110": "In a nutshell, LSTM-Jump is always faster than LSTM under different combinations of R and N .", 
        "111": "At the same time, the accuracy is on par with that of LSTM.", 
        "112": "In particular, the combination of (R,N) = (7, 4) even achieves slightly better accuracy than LSTM while having a 1.5x speedup.", 
        "113": "The second dataset is IMDB (Maas et al., 2011),6 which contains 25,000 training and 25,000 testing movie reviews, where the average length of text is 240 words, much longer than that of Rotten Tomatoes.", 
        "114": "We randomly set aside about 15% of training data as validation set.", 
        "115": "Both LSTM-Jump and LSTM has one layer and 128 hidden units, and the batch size is 50.", 
        "116": "Again, we use pretrained word2vec embeddings as initialization but they are updated during training.", 
        "117": "We either pad a short sequence to 400 words or randomly select a 400- word segment from a long sequence as a training example.", 
        "118": "During training, we setR = 20,K = 40 and N = 5.", 
        "119": "As Table 5 shows, the result exhibits a similar trend as found in Rotten Tomatoes that LSTMJump is uniformly faster than LSTM under many settings.", 
        "120": "The various (R,N) combinations again demonstrate the trade-off between efficiency and accuracy.", 
        "121": "If one cares more about accuracy, then allowing LSTM-Jump to read and jump more\n6http://ai.Stanford.edu/amaas/data/ sentiment/index.html\ntimes is a good choice.", 
        "122": "Otherwise, shrinking either one would bring a significant speedup though at the price of losing some accuracy.", 
        "123": "Nevertheless, the configuration with the highest accuracy still enjoys a 1.6x speedup compared to LSTM.", 
        "124": "With a slight loss of accuracy, LSTM-Jump can be 2.5x faster .", 
        "125": "3.3 Character Level News Article Classification with AG dataset  We now present results on testing the character level jumping with a news article classification problem.", 
        "126": "The dataset contains four classes of topics (World, Sports, Business, Sci/Tech) from the AG’s news corpus,7 a collection of more than 1 million news articles.", 
        "127": "The data we use is the subset constructed by Zhang et al.", 
        "128": "(2015) for classification with character-level convolutional networks.", 
        "129": "There are 30,000 training and 1,900 testing examples for each class respectively, where 15% of training data is set aside as validation.", 
        "130": "The nonspace alphabet under use are:\nabcdefghijklmnopqrstuvwxyz0123456 789-,;.!?", 
        "131": ":/\\|_@#$%&*˜‘+-=<>()[]{}\nSince the vocabulary size is small, we choose 16 as the embedding size.", 
        "132": "The initialized entries of the embedding matrix are drawn from a uniform distribution in [−0.25, 0.25], which are progressively updated during training.", 
        "133": "Both LSTM-Jump and LSTM have 1 layer and 64 hidden units and the batch sizes are 20 and 100 respectively.", 
        "134": "The training sequence is again of length 400 that it is either padded from a short sequence or sampled from a long one.", 
        "135": "During training, we setR = 30,K = 40 and N = 5.", 
        "136": "The result is summarized in Table 6.", 
        "137": "It is interesting to see that even with skipping, LSTM-Jump\n7http://www.di.unipi.it/˜gulli/AG_ corpus_of_news_articles.html\nis not always faster than LSTM.", 
        "138": "This is mainly due to the fact that the embedding size and hidden layer are both much smaller than those used previously, and accordingly the processing of a token is much faster.", 
        "139": "In that case, other computation overhead such as calculating and sampling from the jump softmax might become a dominating factor of efficiency.", 
        "140": "By this cross-task comparison, we can see that the larger the hidden unit size of recurrent neural network and the embedding are, the more speedup LSTM-Jump can gain, which is also confirmed by the task below.", 
        "141": "3.4 Sentence Level Automatic Question Answering with Children’s Book Test dataset  The last task is automatic question answering, in which we aim to test the sentence level skimming of LSTM-Jump.", 
        "142": "We benchmark on the data set Children’s Book Test (CBT) (Hill et al., 2015).8 In each document, there are 20 contiguous sentences (context) extracted from a children’s book followed by a query sentence.", 
        "143": "A word of the query is deleted and the task is to select the best fit for this position from 10 candidates.", 
        "144": "Originally, there are four types of tasks according to the part of speech of the missing word, from which, we choose the most difficult two, i.e., the name entity (NE) and common noun (CN) as our focus, since simple language models can already achieve human-level performance for the other two types .", 
        "145": "The models, LSTM or LSTM-Jump, firstly read the whole query, then the context sentences and finally output the predicted word.", 
        "146": "While LSTM reads everything, our jumping model would decide how many context sentences should skip after reading one sentence.", 
        "147": "Whenever a model finishes reading, the context and query are encoded in its\n8http://www.thespermwhale.com/ jaseweston/babi/CBTest.tgz\nhidden state ho, and the best answer from the candidate words has the same index that maximizes the following:\nsoftmax(CWho) ∈ R10,\nwhere C ∈ R10×d is the word embedding matrix of the 10 candidates and W ∈ Rd×hidden size is a trainable weight variable.", 
        "148": "Using such bilinear form to select answer basically follows the idea of Chen et al.", 
        "149": "(2016), as it is shown to have good performance.", 
        "150": "The task is now distilled to a classification problem of 10 classes.", 
        "151": "We either truncate or pad each context sentence, such that they all have length 20.", 
        "152": "The same preprocessing is applied to the query sentences except that the length is set as 30.", 
        "153": "For both models, the number of layers is 2, the number of hidden units is 256 and the batch size is 32.", 
        "154": "Pretrained word2vec embeddings are again used and they are not adjusted during training.", 
        "155": "The maximum number of context sentences LSTM-Jump can skip per time is K = 5 while the number of total jumping is limited to N = 5.", 
        "156": "We let the model jump after reading every sentence, so R = 1 (20 words).", 
        "157": "The result is reported in Table 7.", 
        "158": "The performance of LSTM-Jump is superior to LSTM in terms of both accuracy and efficiency under all settings in our experiments.", 
        "159": "In particular, the fastest LSTM-Jump configuration achieves a remarkable 6x speedup over LSTM, while also having respectively 1.4% and 4.4% higher accuracy in Children’s Book Test - Named Entity and Children’s Book Test - Common Noun.", 
        "160": "The dominant performance of LSTM-Jump over LSTM might be interpreted as follows.", 
        "161": "After reading the query, both LSTM and LSTM-Jump\nknow what the question is.", 
        "162": "However, LSTM still has to process the remaining 20 sentences and thus at the very end of the last sentence, the long dependency between the question and output might become weak that the prediction is hampered.", 
        "163": "On the contrary, the question can guide LSTM-Jump on how to read selectively and stop early when the answer is clear.", 
        "164": "Therefore, when it comes to the output stage, the “memory” is both fresh and uncluttered that a more accurate answer is likely to be picked.", 
        "165": "In the following, we show two examples of how the model reads the context given a query (bold face sentences are those read by our model in the increasing order).", 
        "166": "XXXXX is the missing word we want to fill.", 
        "167": "Note that due to truncation, a few sentences might look uncompleted.", 
        "168": "Example 1 In the first example, the exact answer appears in the context multiple times, which makes the task relatively easy, as long as the reader has captured their occurrences.", 
        "169": "(a) Query: ‘XXXXX!", 
        "170": "(b) Context: 1. said Big Klaus, and he ran off at once to\nLittle Klaus.", 
        "171": "2.", 
        "172": "‘Where did you get so much money from?’ 3.", 
        "173": "‘Oh, that was from my horse-skin.", 
        "174": "4.", 
        "175": "I sold it yesterday evening.’ 5.", 
        "176": "‘That ’s certainly a good price!’ 6. said Big Klaus; and running home in great\nhaste, he took an axe, knocked all his four 7.", 
        "177": "‘Skins!", 
        "178": "8. skins!", 
        "179": "9. Who will buy skins?’\n10. he cried through the streets.", 
        "180": "11.", 
        "181": "All the shoemakers and tanners came running\nto ask him what he wanted for them.’ 12.", 
        "182": "A bushel of money for each,’ said Big\nKlaus.", 
        "183": "13.", 
        "184": "‘Are you mad?’ 14. they all exclaimed.", 
        "185": "15.", 
        "186": "‘Do you think we have money by the bushel?’ 16.", 
        "187": "‘Skins!", 
        "188": "17. skins!", 
        "189": "18. Who will buy skins?’ 19. he cried again, and to all who asked him what\nthey cost, he answered,’ A bushel 20.", 
        "190": "‘He is making game of us,’ they said; and the\nshoemakers seized their yard measures and (c) Candidates: Klaus | Skins | game | haste |\nhead | home | horses | money | price| streets\n(d) Answer: Skins The reading behavior might be interpreted as follows.", 
        "191": "The model tries to search for clues, and after reading sentence 8, it realizes that the most plausible answer is “Klaus” or “Skins”, as they both appear twice.", 
        "192": "“Skins” is more likely to be the answer as it is followed by a “!”.", 
        "193": "The model searches further to see if ”Klaus!” is mentioned somewhere, but it only finds “Klaus” without “!” for the third time.", 
        "194": "After the last attempt at sentence 14, it is confident about the answer and stops to output with “Skins”.", 
        "195": "Example 2 In this example, the answer is illustrated by a word “nuisance” that does not show up in the context at all.", 
        "196": "Hence, to answer the query, the model has to understand the meaning of both the query and context and locate the synonym of “nuisance”, which is not merely verbatim and thus much harder than the previous example.", 
        "197": "Nevertheless, our model is still able to make a right choice while reading much fewer sentences.", 
        "198": "(a) Query: Yes, I call XXXXX a nuisance.", 
        "199": "(b) Context: 1.", 
        "200": "But to you and me it would have looked\njust as it did to Cousin Myra – a very discontented 2.", 
        "201": "“I’m awfully glad to see you, Cousin Myra, ”explained Frank carefully, “and your 3.", 
        "202": "But Christmas is just a bore – a regular bore.” 4.", 
        "203": "That was what Uncle Edgar called things that didn’t interest him, so that Frank felt pretty sure of 5.", 
        "204": "Nevertheless, he wondered uncomfortably what made Cousin Myra smile so queerly.", 
        "205": "6.", 
        "206": "“Why, how dreadful!” 7. she said brightly.", 
        "207": "8.", 
        "208": "“I thought all boys and girls looked upon\nChristmas as the very best time in the year.” 9.", 
        "209": "“We don’t, ”said Frank gloomily.", 
        "210": "10.", 
        "211": "“It’s just the same old thing year in and year out.", 
        "212": "11.", 
        "213": "We know just exactly what is going to happen.", 
        "214": "12.", 
        "215": "We even know pretty well what presents we are going to get.", 
        "216": "13.", 
        "217": "And Christmas Day itself is always the same.", 
        "218": "14.", 
        "219": "We’ll get up in the morning , and our stock-\nings will be full of things, and half of 15.", 
        "220": "Then there ’s dinner.", 
        "221": "16.", 
        "222": "It ’s always so poky.", 
        "223": "17.", 
        "224": "And all the uncles and aunts come to dinner – just the same old crowd, every year, and 18.", 
        "225": "Aunt Desda always says, ‘Why, Frankie, how you have grown!’ 19.", 
        "226": "She knows I hate to be called Frankie.", 
        "227": "20.", 
        "228": "And after dinner they’ll sit round and talk the\nrest of the day, and that’s all.", 
        "229": "(c) Candidates: Christmas | boys | day | dinner |\nhalf | interest | rest | stockings | things | uncles (d) Answer: Christmas The reading behavior can be interpreted as follows.", 
        "230": "After reading the query, our model realizes that the answer should be something like a nuisance.", 
        "231": "Then it starts to process the text.", 
        "232": "Once it hits sentence 3, it may begin to consider “Christmas” as the answer, since “bore” is a synonym of “nuisance”.", 
        "233": "Yet the model is not 100% sure, so it continues to read, very conservatively – it does not jump for the next three sentences.", 
        "234": "After that, the model gains more confidence on the answer “Christmas” and it makes a large jump to see if there is something that can turn over the current hypothesis.", 
        "235": "It turns out that the last-read sentence is still talking about Christmas with a negative voice.", 
        "236": "Therefore, the model stops to take “Christmas” as the output.", 
        "237": "4 Related Work  Closely related to our work is the idea of learning visual attention with neural networks (Mnih et al., 2014; Ba et al., 2014; Sermanet et al., 2014), where a recurrent model is used to combine visual evidence at multiple fixations processed by a convolutional neural network.", 
        "238": "Similar to our approach, the model is trained end-to-end using the REINFORCE algorithm (Williams, 1992).", 
        "239": "However, a major difference between those work and ours is that we have to sample from discrete jumping distribution, while they can sample from continuous distribution such as Gaussian.", 
        "240": "The difference is mainly due to the inborn characteristics of text and image.", 
        "241": "In fact, as pointed out by Mnih et al.", 
        "242": "(2014), it was difficult to learn policies over more than 25 possible discrete locations.", 
        "243": "This idea has recently been explored in the context of natural language processing applications, where the main goal is to filter irrelevant content using a small network (Choi et al., 2016).", 
        "244": "Perhaps the most closely related to our work is the concurrent work on learning to reason with reinforcement\nlearning (Shen et al., 2016).", 
        "245": "The key difference between our work and Shen et al.", 
        "246": "(2016) is that they focus on early stopping after multiple pass of data to ensure accuracy whereas our method focuses on selective reading with single pass to enable fast processing.", 
        "247": "The concept of “hard” attention has also been used successfully in the context of making neural network predictions more interpretable (Lei et al., 2016).", 
        "248": "The key difference between our work and Lei et al.", 
        "249": "(2016)’s method is that our method optimizes for faster inference, and is more dynamic in its jumping.", 
        "250": "Likewise is the difference between our approach and the “soft” attention approach by (Bahdanau et al., 2014).", 
        "251": "Our method belongs to adaptive computation of neural networks, whose idea is recently explored by (Graves, 2016; Jernite et al., 2016), where different amount of computations are allocated dynamically per time step.", 
        "252": "The main difference between our method and Graves; Jernite et al.’s methods is that our method can set the amount of computation to be exactly zero for many steps, thereby achieving faster scanning over texts.", 
        "253": "Even though our method requires policy gradient methods to train, which is a disadvantage compared to (Graves, 2016; Jernite et al., 2016), we do not find training with policy gradient methods problematic in our experiments.", 
        "254": "At the high-level, our model can be viewed as a simplified trainable Turing machine, where the controller can move on the input tape.", 
        "255": "It is therefore related to the prior work on Neural Turing Machines (Graves et al., 2014) and especially its RL version (Zaremba and Sutskever, 2015).", 
        "256": "Compared to (Zaremba and Sutskever, 2015), the output tape in our method is more simple and reward signals in our problems are less sparse, which explains why our model is easy to train.", 
        "257": "It is worth noting that Zaremba and Sutskever report difficulty in using policy gradients to train their model.", 
        "258": "Our method, by skipping irrelevant content, shortens the length of recurrent networks, thereby addressing the vanishing or exploding gradients in them (Hochreiter et al., 2001).", 
        "259": "The baseline method itself, Long Short Term Memory (Hochreiter and Schmidhuber, 1997), belongs to the same category of methods.", 
        "260": "In this category, there are several recent methods that try to achieve the same goal, such as having recurrent networks that operate in different frequency (Koutnik et al., 2014) or\nis organized in a hierarchical fashion (Chan et al., 2015; Chung et al., 2016).", 
        "261": "Lastly, we should point out that we are among the recent efforts that deploy reinforcement learning to the field of natural language processing, some of which have achieved encouraging results in the realm of such as neural symbolic machine (Liang et al., 2017), machine reasoning (Shen et al., 2016) and sequence generation (Ranzato et al., 2015).", 
        "262": "5 Conclusions  In this paper, we focus on learning how to skim text for fast reading.", 
        "263": "In particular, we propose a “jumping” model that after reading every few tokens, it decides how many tokens should be skipped by sampling from a softmax.", 
        "264": "Such jumping behavior is modeled as a discrete decision making process, which can be trained by reinforcement learning algorithm such as REINFORCE.", 
        "265": "In four different tasks with six datasets (one synthetic and five real), we test the efficiency of the proposed method on various levels of text jumping, from character to word and then to sentence.", 
        "266": "The results indicate our model is several times faster than, while the accuracy is on par with the baseline LSTM model.", 
        "267": "Acknowledgments  The authors would like to thank the Google Brain Team, especially Zhifeng Chen and Yuan Yu for helpful discussion about the implementation of this model on Tensorflow.", 
        "268": "The first author also wants to thank Chen Liang, Hanxiao Liu, Yingtao Tian, Fish Tung, Chiyuan Zhang and Yu Zhang for their help during the project.", 
        "269": "Finally, the authors appreciate the invaluable feedback from anonymous reviewers."
    }, 
    "document_id": "P17-1172.pdf.json"
}
