{
    "abstract_sentences": {
        "1": "In recent years word-embedding models have gained great popularity due to their remarkable performance on several tasks, including word analogy questions and caption generation.", 
        "2": "An unexpected “sideeffect” of such models is that their vectors often exhibit compositionality, i.e., adding two word-vectors results in a vector that is only a small angle away from the vector of a word representing the semantic composite of the original words, e.g., “man” + “royal” = “king”.", 
        "3": "This work provides a theoretical justification for the presence of additive compositionality in word vectors learned using the Skip-Gram model.", 
        "4": "In particular, it shows that additive compositionality holds in an even stricter sense (small distance rather than small angle) under certain assumptions on the process generating the corpus.", 
        "5": "As a corollary, it explains the success of vector calculus in solving word analogies.", 
        "6": "When these assumptions do not hold, this work describes the correct non-linear composition operator.", 
        "7": "Finally, this work establishes a connection between the Skip-Gram model and the Sufficient Dimensionality Reduction (SDR) framework of Globerson and Tishby: the parameters of SDR models can be obtained from those of Skip-Gram models simply by adding information on symbol frequencies.", 
        "8": "This shows that SkipGram embeddings are optimal in the sense of Globerson and Tishby and, further, implies that the heuristics commonly used to approximately fit Skip-Gram models can be used to fit SDR models."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 69–76 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1007\nThis work provides a theoretical justification for the presence of additive compositionality in word vectors learned using the Skip-Gram model.", 
        "2": "In particular, it shows that additive compositionality holds in an even stricter sense (small distance rather than small angle) under certain assumptions on the process generating the corpus.", 
        "3": "As a corollary, it explains the success of vector calculus in solving word analogies.", 
        "4": "When these assumptions do not hold, this work describes the correct non-linear composition operator.", 
        "5": "Finally, this work establishes a connection between the Skip-Gram model and the Sufficient Dimensionality Reduction (SDR) framework of Globerson and Tishby: the parameters of SDR models can be obtained from those of Skip-Gram models simply by adding information on symbol frequencies.", 
        "6": "This shows that SkipGram embeddings are optimal in the sense of Globerson and Tishby and, further, implies that the heuristics commonly used to approximately fit Skip-Gram models can be used to fit SDR models.", 
        "7": "1 Introduction  The strategy of representing words as vectors has a long history in computational linguistics and machine learning.", 
        "8": "The general idea is to find a map from words to vectors such that wordsimilarity and vector-similarity are in correspondence.", 
        "9": "Whilst vector-similarity can be readily quantified in terms of distances and angles, quantifying word-similarity is a more ambiguous task.", 
        "10": "A key insight in that regard is to posit that the meaning of a word is captured by “the company it keeps” (Firth, 1957) and, therefore, that two words that keep company with similar words are likely to be similar themselves.", 
        "11": "In the simplest case, one seeks vectors whose inner products approximate the co-occurrence frequencies.", 
        "12": "In more sophisticated methods cooccurrences are reweighed to suppress the effect of more frequent words (Rohde et al., 2006) and/or to emphasize pairs of words whose co-occurrence frequency maximally deviates from the independence assumption (Church and Hanks, 1990).", 
        "13": "An alternative to seeking word-embeddings that reflect co-occurrence statistics is to extract the vectorial representation of words from non-linear statistical language models, specifically neural networks.", 
        "14": "(Bengio et al., 2003) already proposed (i) associating with each vocabulary word a feature vector, (ii) expressing the probability function of word sequences in terms of the feature vectors of the words in the sequence, and (iii) learning simultaneously the vectors and the parameters of the probability function.", 
        "15": "This approach came into prominence recently through works of Mikolov et al.", 
        "16": "(see below) whose main departure from (Bengio et al., 2003) was to follow the suggestion of (Mnih and Hinton, 2007) and tradeaway the expressive capacity of general neuralnetwork models for the scalability (to very large\n69\ncorpora) afforded by (the more restricted class of) log-linear models.", 
        "17": "An unexpected side effect of deriving wordembeddings via neural networks is that the wordvectors produced appear to enjoy (approximate) additive compositionality: adding two wordvectors often results in a vector whose nearest word-vector belongs to the word capturing the composition of the added words, e.g., “man” + “royal” = “king” (Mikolov et al., 2013c).", 
        "18": "This unexpected property allows one to use these vectors to answer word-analogy questions algebraically, e.g., answering the question “Man is to king as woman is to ” by returning the word whose word-vector is nearest to the vector\nv(king) - v(man) + v(woman).", 
        "19": "In this work we focus on explaining the source of this phenomenon for the most prominent such model, namely the Skip-Gram model introduced in (Mikolov et al., 2013a).", 
        "20": "The Skip-Gram model learns vector representations of words based on their patterns of co-occurrence in the training corpus as follows: it assigns to each word c in the vocabulary V , a “context” and a “target” vector, respectively uc and vc, which are to be used in order to predict the words that appear around each occurrence of c within a window of ∆ tokens.", 
        "21": "Specifically, the log probability of any target word w to occur at any position within distance ∆ of a context word c is taken to be proportional to the inner product between uc and vw, i.e., letting n = |V |,\np(w|c) = e uTc vw\n∑n i=1 e uTc vi .", 
        "22": "(1)\nFurther, Skip-Gram assumes that the conditional probability of each possible set of words in a window around a context word c factorizes as the product of the respective conditional probabilities:\np(w−∆, .", 
        "23": ".", 
        "24": ".", 
        "25": ", w∆|c) = ∆∏\nδ=−∆ δ 6=0\np(wδ|c).", 
        "26": "(2)\n(Mikolov et al., 2013a) proposed learning the Skip-Gram parameters on a training corpus by using maximum likelihood estimation under (1) and (2).", 
        "27": "Thus, if wi denotes the i-th word in the training corpus and T the length of the corpus, we seek\nthe word vectors that maximize\n1\nT\nT∑\ni=1\n∆∑\nδ=−∆ δ 6=0\nlog p(wi+δ|wi) .", 
        "28": "(3)\nAs mentioned, the normalized context vectors obtained from maximizing (3) under (1) and (2) exhibit additive compositionality.", 
        "29": "For example, the cosine distance between the sum of the context vectors of the words “Vietnam” and “capital” and the context vector of the word “Hanoi” is small.", 
        "30": "While there has been much interest in using algebraic operations on word vectors to carry out semantic operations like composition, and mathematically-flavored explanations have been offered (e.g., in the recent work (Paperno and Baroni, 2016)), the only published work which attempts a rigorous theoretical understanding of this phenomenon is (Arora et al., 2016).", 
        "31": "This work guarantees that word vectors can be recovered by factorizing the so-called PMI matrix, and that algebraic operations on these word vectors can be used to solve analogies, under certain conditions on the process that generated the training corpus.", 
        "32": "Specifically, the word vectors must be known a priori, before their recovery, and to have been generated by randomly scaling uniformly sampled vectors from the unit sphere1.", 
        "33": "Further, the ith word in the corpus must have been selected with probability proportional to eu T wci , where the “discourse” vector ci governs the topic of the corpus at the ith word.", 
        "34": "Finally, the discourse vector is assumed to evolve according to a random walk on the unit sphere that has a uniform stationary distribution.", 
        "35": "By way of contrast, our results assume nothing a priori about the properties of the word vectors.", 
        "36": "In fact, the connection we establish between the Skip-Gram and the Sufficient Dimensionality Reduction model of (Globerson and Tishby, 2003) shows that the word vectors learned by Skip-Gram are information-theoretically optimal.", 
        "37": "Further, the context word c in the Skip-Gram model essentially serves the role that the discourse vector does in the PMI model of (Arora et al., 2016): the words neighboring c are selected with probability proportional to eu T c vw .", 
        "38": "We find the exact non-linear composition operator when no assumptions are made on the context word.", 
        "39": "When an analogous assumption to that of (Arora et al., 2016) is made, that the\n1More generally, it suffices that the word vectors have certain properties consistent with this sampling process.", 
        "40": "context words are uniformly distributed, we prove that the composition operator reduces to vector addition.", 
        "41": "While our primary motivation has been to provide a better theoretical understanding of word compositionality in the popular Skip-Gram model, our connection with the SDR method illuminates a much more general point about the practical applicability of the Skip-Gram model.", 
        "42": "In particular, it addresses the question of whether, for a given corpus, fitting a Skip-Gram model will give good embeddings.", 
        "43": "Even if we are making reasonable linguistic assumptions about how to model words and the interdependencies of words in a corpus, it’s not clear that these have to hold universally on all corpuses to which we apply Skip-Gram.", 
        "44": "However, the fact that when we fit a Skip-Gram model we are fitting an SDR model (up to frequency information), and the fact that SDR models are information-theoretically optimal in a certain sense, argues that regardless of whether the Skip-Gram assumptions hold, Skip-Gram always gives us optimal features in the following sense: the learned context embeddings and target embeddings preserve the maximal amount of mutual information between any pair of random variablesX and Y consistent with the observed co-occurence matrix, where Y is the target word and X is the predictor word (in a min-max sense, since there are many ways of coupling X and Y , each of which may have different amounts of mutual information).", 
        "45": "Importantly, this statement requires no assumptions on the distribution P (X,Y ).", 
        "46": "2 Compositionality of Skip-Gram  In this section, we first give a mathematical formulation of the intuitive notion of compositionality of words.", 
        "47": "We then prove that the composition operator for the Skip-Gram model in full generality is a non-linear function of the vectors of the words being composed.", 
        "48": "Under a single simplifying assumption, the operator linearizes and reduces to the addition of the word vectors.", 
        "49": "Finally, we explain how linear compositionality allows for solving word analogies with vector algebra.", 
        "50": "A natural way of capturing the compositionality of words is to say that the set of context words c1, .", 
        "51": ".", 
        "52": ".", 
        "53": ", cm has the same meaning as the single word c if for every other word w,\np(w|c1, .", 
        "54": ".", 
        "55": ".", 
        "56": ", cm) = p(w|c) .", 
        "57": "Although this is an intuitively satisfying definition, we never expect it to hold exactly; instead, we replace exact equality with the minimization of KL-divergence.", 
        "58": "That is, we state that the best candidate for having the same meaning as the set of context words C is the word\narg min c∈V\nDKL(p(·|C) | p(·|c)) .", 
        "59": "(4)\nWe refer to any vector that minimizes (4) as a paraphrase of the set of words C.\nThere are two natural concerns with (4).", 
        "60": "The first is that, in general, it is not clear how to define p(·|C).", 
        "61": "The second is that KL-divergence minimization is a hard problem, as it involves optimization over many high dimensional probability distributions.", 
        "62": "Our main result shows that both of these problems go away for any language model that satisfies the following two assumptions:\nA1.", 
        "63": "For every word c, there exists Zc such that for every word w,\np(w|c) = 1 Zc exp(uTc vw) .", 
        "64": "(5)\nA2.", 
        "65": "For every set of words C = {c1, c2, .", 
        "66": ".", 
        "67": ".", 
        "68": ", cm}, there exists ZC such that for every word w,\np(w|C) = p(w) 1−m\nZC\nm∏\ni=1\np(w|ci) .", 
        "69": "(6)\nClearly, the Skip-Gram model satisfies A1 by definition.", 
        "70": "We prove that it also satisfies A2 when m ≤ ∆ (Lemma 1).", 
        "71": "Next, we state a theorem that holds for any model satisfying assumptions A1 and A2, including the Skip-Gram model when m ≤ ∆.", 
        "72": "Theorem 1.", 
        "73": "In every word model that satisfies A1 and A2, for every set of words C = {c1, .", 
        "74": ".", 
        "75": ".", 
        "76": ", cm}, any paraphase c of C satisfies\n∑ w∈V p(w|c)vw = ∑ w∈V p(w|C)vw .", 
        "77": "(7)\nTheorem 1 characterizes the composition operator for any language model which satisfies our two assumptions; in general, this operator is not addition.", 
        "78": "Instead, a paraphrase c is a vector such that the average word vector under p(·|c) matches that under p(·|C).", 
        "79": "When the expectations in (7) can be computed, the composition operator can be implemented by solving a non-linear system of equations to find a vector u for which the left-hand side of (7) equals the right-hand side.", 
        "80": "Our next result proves that although the composition operator is nontrivial in the general case, to recover vector addition as the composition operator, it suffices to assume that the word frequency is uniform.", 
        "81": "Theorem 2.", 
        "82": "In every word model that satisfies A1, A2, and where p(w) = 1/|V | for everyw ∈ V , the paraphrase of C = {c1, .", 
        "83": ".", 
        "84": ".", 
        "85": ", cm} is\nu1 + .", 
        "86": ".", 
        "87": ".+ um .", 
        "88": "As word frequencies are typically much closer to a Zipf distribution (Piantadosi, 2014), the uniformity assumption of Theorem 2 is not realistic.", 
        "89": "That said, we feel it is important to point out that, as reported in (Mikolov et al., 2013b), additivity captures compositionality more accurately when the training set is manipulated so that the prior distribution of the words is made closer to uniform.", 
        "90": "Using composition to solve analogies.", 
        "91": "It has been observed that word vectors trained using nonlinear models like Skip-Gram tend to encode semantic relationships between words as linear relationships between the word vectors (Mikolov et al., 2013b; Pennington et al., 2014; Levy and Goldberg, 2014).", 
        "92": "In particular, analogies of the form “man:woman::king:?” can often be solved by taking ?", 
        "93": "to be the word in the vocabulary whose context vector has the smallest angle with uwoman + (uking − uman).", 
        "94": "Theorems 1 and 2 offer insight into the solution such analogy questions.", 
        "95": "We first consider solving an analogy of the form “m:w::k:?”” in the case where the composition operator is nonlinear.", 
        "96": "The fact that m and w share a relationship means m is a paraphrase of the set of words {w,R}, whereR is a set of words encoding the relationship between m and w. Similarly, the fact that k and ?", 
        "97": "share the same relationship means k is a paraphrase of the set of words {?, R}.", 
        "98": "By Theorem 1, we have that R and ?", 
        "99": "must satisfy\n∑ `∈V p(`|m)v` = ∑ `∈V p(`|w,R)v` and\n∑ `∈V p(`|k)v` = ∑ `∈V p(`|?, R)v`.", 
        "100": "We see that solving analogies when the composition operator is nonlinear requires the solution of two highly nonlinear systems of equations.", 
        "101": "In sharp contrast, when the composition operator is linear, the solution of analogies delightfully reduces to elementary vector algebra.", 
        "102": "To see this,\nwe again begin with the assertion that the fact that m and w share a relationship means m is a paraphrase of the set of words {w,R}; Similarly, k is a paraphrase of {?, R}.", 
        "103": "By Theorem 2,\num = uw + ur and\nuk = u?", 
        "104": "+ ur,\nwhich gives the expected relationship\nu?", 
        "105": "= uk + (uw − um).", 
        "106": "Note that because this expression for u?", 
        "107": "is in terms of k, w, andm, there is actually no need to assume that R is a set of actual words in V .", 
        "108": "2.1 Proofs  Proof of Theorem 1.", 
        "109": "Note that p(w|C) equals\np(w)1−m\nZC\nm∏\ni=1\np(w|ci)\n= p(w)1−m\nZC exp\n( m∑\ni=1\nuTcivw − m∑\ni=1\nlogZci\n)\n= 1 Z p(w)1−m exp(uTCvw) ,\nwhere Z = ZC ∏m i=1 Zi, and uC = ∑m i=1 ui.", 
        "110": "Minimizing the KL-divergence\nDKL(p(·|c1, .", 
        "111": ".", 
        "112": ".", 
        "113": ", cm)‖p(·|c))\nas a function of c is equivalent to maximizing the negative cross-entropy as a function of uc, i.e., as maximizing\nQ(uc) = Z ∑\nw\nexp(uTCvw)\np(w)m−1 (uTc vw − logZc) .", 
        "114": "Since Q is concave, the maximizers occur where its gradient vanishes.", 
        "115": "As∇ucQ equals Z ∑\nw\nexp(uTCvw)\np(w)m−1\n[ vw − ∑n `=1 exp(u T c v`)v`∑n\nk=1 exp(u T c vk)\n]\n=\n∑n `=1 exp(u\nT c v`)v`∑n\nk=1 exp(u T c vk)\n− Z ∑\nw\nexp(uTCvw)vw p(w)m−1\n= ∑\nw∈V p(w|c)vw −\n∑ w∈V p(w|c1, .", 
        "116": ".", 
        "117": ".", 
        "118": ", cm)vw ,\nwe see that (7) follows.", 
        "119": "Proof of Theorem 2.", 
        "120": "Recall that uC = ∑m\ni=1 ui.", 
        "121": "When p(w) = 1/|V | for all w ∈ V , the negative cross-entropy simplifies to\nQ(uc) = Z ∑\nw\nexp ( uTCvw ) (uTc vw − logZc) ,\nand its gradient∇ucQ to\nZ ∑\nw\nexp(uC Tvw) [ vw − ∑n `=1 exp(u T c v`)v`∑n\nk=1 exp(u T c vk)\n]\n= Z ∑\nw\nexp(uC Tvw)vw −\n∑\nw\nexp(uTc vw)vw .", 
        "122": "Thus,∇Q(uC) = 0 and since Q is concave, uC is its unique maximizer.", 
        "123": "Lemma 1.", 
        "124": "The Skip-Gram model satisfies assumption A2 when m ≤ ∆.", 
        "125": "Proof of Lemma 1.", 
        "126": "First, assume that m = ∆.", 
        "127": "In the Skip-Gram model target words are conditionally independent given a context word, i.e.,\np(c1, .", 
        "128": ".", 
        "129": ".", 
        "130": ", cm|w) = m∏\ni=1\np(ci|w).", 
        "131": "Applying Baye’s rule,\np(w|c1, .", 
        "132": ".", 
        "133": ".", 
        "134": ", cm) = p(c1, .", 
        "135": ".", 
        "136": ".", 
        "137": ", cm|w)p(w)\np(c1, .", 
        "138": ".", 
        "139": ".", 
        "140": ", cm)\n= p(w)\np(c1, .", 
        "141": ".", 
        "142": ".", 
        "143": ", cm)\nm∏\ni=1\np(ci|w)\n= p(w)\np(c1, .", 
        "144": ".", 
        "145": ".", 
        "146": ", cm)\nm∏\ni=1\np(w|ci)p(ci) p(w)\n= p(w)1−m\nZC\nm∏\ni=1\np(w|ci) , (8)\nwhere ZC = 1/ ( ∏m i=1 p(ci)).", 
        "147": "This establishes the result when m = ∆.", 
        "148": "The cases m < ∆ follow by marginalizing out ∆ −m context words in the equality (8).", 
        "149": "Projection of paraphrases onto the vocabulary Theorem 2 states that if there is a word c in the vocabulary V whose context vector equals the sum of the context vectors of the words c1, .", 
        "150": ".", 
        "151": ".", 
        "152": ", cm, then c has the same “meaning”, in the sense of (4), as the composition of the words c1, .", 
        "153": ".", 
        "154": ".", 
        "155": ", cm.", 
        "156": "For any given set of words C = {c1, .", 
        "157": ".", 
        "158": ".", 
        "159": ", cm}, it is unlikely that there exists a word c ∈ V whose context vector is exactly equal to the sum of the context vectors of the words c1, .", 
        "160": ".", 
        "161": ".", 
        "162": ", cm.", 
        "163": "Similarly, in Theorem 1, the solution(s) to (7) will most likely not equal the context vector of any word in V .", 
        "164": "In both cases, we thus need to project the vector(s) onto words in our vocabulary in some manner.", 
        "165": "Since Theorem 1 holds for any prior over V , in theory, we could enumerate all words in V and\nfind the word(s) that minimize the difference of the left hand side of (7) from the right hand side.", 
        "166": "In practice, it turns out that the angle between the context vector of a word w ∈ V and solutionvector(s) is a good proxy and one gets very good experimental results by selecting as the paraphrase of a collection of words, the word that minimizes the angle to the paraphrase vector.", 
        "167": "Minimizing the angle has been empirically successful at capturing composition in multiple loglinear word models.", 
        "168": "One way to understand the success of this approach is to recall that each word c is characterized by a categorical distribution over all other words w, as stated in (1).", 
        "169": "The peaks of this categorical distribution are precisely the words with which c co-occurs most often.", 
        "170": "These words characterize c more than all the other words in the vocabulary, so it is reasonable to expect that a word c′ whose categorical distribution has similar peaks as the categorical distribution of c is similar in meaning to c. Note that the location of the peaks of p(·|c) are immune to the scaling of uc (athough the values of p(·|c) may change); thus, the wordsw which best characterize c are those for which vw has a high inner product with uc/‖uc‖2.", 
        "171": "Since\n∣∣∣∣ uTc vw ‖uc‖2 − u T c′vw ‖uc′‖2 ∣∣∣∣≤ √ 2 ( 1− u T c uc′ ‖uc‖2‖uc′‖2 ) ‖vw‖2,\nit is clear that if the angle between the context representations of c and c′ is small, the distributions p(w|c) and p(w|c′) will tend to have similar peaks.", 
        "172": "3 Skip-Gram learns a Sufficient Dimensionality Reduction Model  The Skip-Gram model assumes that the distribution of the neighbors of a word follows a specific exponential parametrization of a categorical distribution.", 
        "173": "There is empirical evidence that this model generates features that are useful for NLP tasks, but there is no a priori guarantee that the training corpus was generated in this manner.", 
        "174": "In this section, we provide theoretical support for the usefulness of the features learned even when the SkipGram model is misspecified.", 
        "175": "To do so, we draw a connection between SkipGram and the Sufficient Dimensionality Reduction (SDR) factorization of Globerson and Tishby (Globerson and Tishby, 2003).", 
        "176": "The SDR model\nlearns optimal2 embeddings for discrete random variables X and Y without assuming any parametric form on the distributions of X and Y , and it is useful in a variety of applications, including information retrieval, document classification, and association analysis (Globerson and Tishby, 2003).", 
        "177": "As it turns out, these embeddings, like Skip-Gram, are obtained by learning the parameters of an exponentially parameterized distribution.", 
        "178": "In Theorem 3 below, we show that if a SkipGram model is fit to the cooccurence statistics of X and Y , then the output can be trivially modified (by adding readily-available information on word frequencies) to obtain the parameters of an SDR model.", 
        "179": "This connection is significant for two reasons: first, the original algorithm of (Globerson and Tishby, 2003) for learning SDR embeddings is expensive, as it involves information projections.", 
        "180": "Theorem 3 shows that if one can efficiently fit a Skip-Gram model, then one can efficiently fit an SDR model.", 
        "181": "This implies that Skip-Gram specific approximation heuristics like negativesampling, hierarchical softmax, and Glove, which are believed to return high-quality approximations to Skip-Gram parameters (Mikolov et al., 2013b; Pennington et al., 2014), can be used to efficiently approximate SDR model parameters.", 
        "182": "Second, (Globerson and Tishby, 2003) argues for the optimality of the SDR embedding in any domain where the training information on X and Y consists of their coocurrence statistics; this optimality and the Skip-Gram/SDR connection argues for the use of Skip-Gram approximations in such domains, and supports the positive experimental results that have been observed in applications in network science (Grover and Leskovec, 2016), proteinomics (Asgari and Mofrad, 2015), and other fields.", 
        "183": "As stated above, the SDR factorization solves the problem of finding information-theoretically optimal features, given co-occurrence statistics for a pair of discrete random variables X and Y .", 
        "184": "Associate a vector wi to the ith state of X , a vector hj to the jth state of Y , and let W = [wT1 · · ·wT|X|]T and H be defined similarly.", 
        "185": "Globerson and Tishby show that such optimal features can be obtained from a low-rank factoriza-\n2Optimal in an information-theoretic sense: they preserve the maximal mutual information between any pair of random variables with the observed coocurrence statistics, without regard to the underlying joint distribution.", 
        "186": "tion of the matrix G of co-occurence measurements: Gij counts the number of times state i of X has been observed to co-occur with state j of Y.", 
        "187": "The loss of this factorization is measured using the KL-divergence, and so the optimal features are obtained from solving the problem\narg min W,H DKL\n( G\nZG\n∥∥∥∥ 1\nZW,H eWH\nT ) .", 
        "188": "Here, ZG = ∑\nij Gij normalizes G into an estimate of the joint pmf of X and Y , and similarly ZW,H is the constant that normalizes eWH T into a joint pmf.", 
        "189": "The expression eWH T\ndenotes entrywise exponentiation of WHT .", 
        "190": "Now we revisit the Skip-Gram training objective, and show that it differs from the SDR objective only slightly.", 
        "191": "Whereas the SDR objective measures the distance between the pmfs given by (normalized versions of) G and eWH T , the SkipGram objective measures the distance between the pmfs given by (normalized versions of) the rows of G and eWH T .", 
        "192": "That is, SDR emphasizes fitting the entire pmfs, while Skip-Gram emphasizes fitting conditional distributions.", 
        "193": "Before presenting our main result, we state and prove the following lemma, which is of independent interest and is used in the proof of our main theorem.", 
        "194": "Recall that Skip-Gram represents each word c as a multinomial distribution over all other words w, and it learns the parameters for these distributions by a maximum likelihood estimation.", 
        "195": "It is known that learning model parameters by maximum likelihood estimation is equivalent to minimizing the KL-divergence of the learned model from the empirical distribution; the following lemma establishes the KL-divergence that Skip-Gram minimizes.", 
        "196": "Lemma 2.", 
        "197": "Let G be the word co-occurrence matrix constructed from the corpus on which a SkipGram model is trained, in which case Gcw is the number of times word w occurs as a neighboring word of c in the corpus.", 
        "198": "For each word c, let gc denote the empirical frequency of the word in the corpus, so that\ngc = ∑\nw\nGcw/ ∑\nt,w\nGt,w.", 
        "199": "Given a positive vector x, let x̂ = x/‖x‖1.", 
        "200": "Then, the Skip-Gram model parameters U =[ u1 · · · u|V | ]T and V = [ v1 · · · u|V | ]T\nminimize the objective ∑\nc\ngcDKL(ĝc ‖ êuTc VT ),\nwhere gc is the cth row of G.\nProof.", 
        "201": "Recall that Skip-Gram chooses U and V to maximize\nQ = 1\nT\nT∑\ni=1\nC∑\nδ=−C δ 6=0\nlog p(wi+δ|wi) ,\nwhere\np(w|c) = e uTc vw\n∑n i=1 e uTc vi .", 
        "202": "This objective can be rewritten using the pairwise cooccurence statistics as\nQ= 1\nT\n∑\nc,w\nGcw log p(w|c)\n= 1\nT\n∑\nc\n[(∑\nt\nGct\n)∑\nw\nGcw∑ tGct\nlog p(w|c) ]\n∝ 1 T\n∑\nc\n[ ( ∑\ntGct)\n( ∑\ntwGtw)\n∑\nw\nGcw∑ tGct\nlog p(w|c) ]\n= ∑\nc\ngc\n(∑\nw\n( ĝc ) w\nlog p(w|c) )\n= ∑\nc\ngc ( −DKL(ĝc ‖ p(·|c))−H(ĝc) ) ,\nwhere H(·) denotes the entropy of a distribution.", 
        "203": "It follows that since Skip-Gram maximizes Q, it minimizes ∑\nc\ngcDKL(ĝc ‖ p(·|c))= ∑\nc\ngcDKL(ĝc ‖ êuTc VT ).", 
        "204": "We now prove our main theorem of this section, which states that SDR parameters can be obtained by augmenting the Skip-Gram embeddings to account for word frequencies.", 
        "205": "Theorem 3.", 
        "206": "Let U,V be the results of fitting a Skip-Gram model to G, and consider the augmented matrices\nŨ = [U |α] and Ṽ = [V |1], where\nαc = log\n( gc∑\nw e uTc vw\n) and gc = ∑ wGc,w∑ t,wGt,w .", 
        "207": "Then, the features (Ũ, Ṽ) constitute a sufficient dimensionality reduction of G.\nProof.", 
        "208": "For convenience, let G denote the joint pdf matrix G/ZG, and let Ĝ denote the matrix obtained by normalizing each row of G to be a probability distribution.", 
        "209": "Then, it suffices to show that DKL(G ‖ qW,H) is minimized over the set of probability distributions { qW,H ∣∣∣∣ qW,H(w, c) = 1\nZ\n( eWH T ) cw } ,\nwhen W = Ũ and H = Ṽ.", 
        "210": "To establish this result, we use a chain rule for the KL-divergence.", 
        "211": "Recall that if we denote the expected KL-divergence between two marginal pmfs by\nDKL(p(·|c)‖q(·|c))\n= ∑\nc\np(c)\n(∑\nw\np(w|c) log ( p(w|c) q(w|c) )) ,\nthen the KL-divergence satisfies the chain rule:\nDKL(p(w, c)‖q(w, c)) = DKL(p(c)‖q(c)) +DKL(p(w|c)‖q(w|c)).", 
        "212": "Using this chain rule, we get\nDKL(G ‖ qW,H(w, c)) (9) =DKL(g ‖ qW,H(c))+DKL(Ĝ‖qW,H(w|c)).", 
        "213": "Note that the second term in this sum is, in the notation of Lemma 2, DKL(Ĝ‖qW,H(w|c)) = ∑\nc\ngcDKL(ĝc ‖ êwTc HT ),\nso the matrices U and V that are returned by fitting the Skip-Gram model minimize the second term in this sum.", 
        "214": "We now show that the augmented matrices W = Ũ and H = Ṽ also minimize this second term, and in addition they make the first term vanish.", 
        "215": "To see that the first of these claims holds, i.e., that the augmented matrices make the second term in (9) vanish, note that\nqŨ,Ṽ(w|c) ∝ eũ T c ṽw = eu T c vw+αc ∝ qU,V(w|c),\nand the constant of proportionality is independent of w. It follows that qŨ,Ṽ(w|c) = qU,V(w|c) and\nDKL(Ĝ ‖ qŨ,Ṽ(w|c)) = DKL(Ĝ ‖ qU,V(w|c)).", 
        "216": "Thus, the choice W = Ũ and H = Ṽ minimizes the second term in (9).", 
        "217": "To see that the augmented matrices make the first term in (9) vanish, observe that when W = Ũ and H = Ṽ, we have that qŨ,Ṽ(c) = g by construction.", 
        "218": "This can be verified by calculation:\nqŨ,Ṽ(c) = ∑ w qŨ,Ṽ(w, c)∑ w,t qŨ,Ṽ(w, t) = ∑ w e uTc vw+αc ∑ w,t e uTt vw+αt\n=\n(∑ w e uTc vw ) eαc\n∑ t (∑ w e uTt vw ) eαt\n=\n[ (eUV T 1) eα ] c\n1T [ (eUV T 1) eα ] .", 
        "219": "Here, the notation x y denotes entry-wise multiplication of vectors.", 
        "220": "Since αc = log(gc) − log (( eUV T 1 ) c ) , we\nhave\nqŨ,Ṽ(c) =\n[ (eUV T 1) eα ] c\n1T [ (eUV T 1) eα ] = gc∑ t gt = gc.", 
        "221": "The choice W = Ũ and H = Ṽ makes the first term in (9) vanish, and it also minimizes the second term in (9).", 
        "222": "Thus, it follows that the features (Ũ, Ṽ) constitute a sufficient dimensionality reduction of G."
    }, 
    "document_id": "P17-1007.pdf.json"
}
