{
    "abstract_sentences": {
        "1": "Generative conversational systems are attracting increasing attention in natural language processing (NLP).", 
        "2": "Recently, researchers have noticed the importance of context information in dialog processing, and built various models to utilize context.", 
        "3": "However, there is no systematic comparison to analyze how to use context effectively.", 
        "4": "In this paper, we conduct an empirical study to compare various models and investigate the effect of context information in dialog systems.", 
        "5": "We also propose a variant that explicitly weights context vectors by context-query relevance, outperforming the other baselines."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 231–236 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2036  1 Introduction  Recently, human-computer conversation is attracting increasing attention due to its promising potentials and alluring commercial values.", 
        "2": "Researchers have proposed both retrieval methods (Ji et al., 2014; Yan et al., 2016) and generative methods (Ritter et al., 2011; Shang et al., 2015) for automatic conversational systems.", 
        "3": "With the success of deep learning techniques, neural networks have demonstrated powerful capability of learning human dialog patterns; given a user-issued utterance as an input query q, the network can generate a reply r, which is usually accomplished in a sequence-to-sequence (Seq2Seq) manner (Shang et al., 2015).", 
        "4": "In the literature, there are two typical research setups for dialog systems: single-turn and multiturn.", 
        "5": "Single-turn conversation is, perhaps, the simplest setting where the model only takes q into consideration when generating r (Shang et al.,\n∗Corresponding author.", 
        "6": "2015; Mou et al., 2016).", 
        "7": "However, most realworld dialogs comprise multiple turns.", 
        "8": "Previous utterances (referred to as context in this paper) could also provide useful information about the dialog status and are the key to coherent multi-turn conversation.", 
        "9": "Existing studies have realized the importance of context, and proposed several context-aware conversational systems.", 
        "10": "For example, Yan et al.", 
        "11": "(2016) directly concatenate context utterances and the current query; others use hierarchical models, first capturing the meaning of individual utterances and then integrating them as discourses (Serban et al., 2016).", 
        "12": "There could be several ways of combining context and the current query, e.g., pooling or concatenation (Sordoni et al., 2015).", 
        "13": "Unfortunately, previous literature lacks a systematic comparison of the above methods.", 
        "14": "In this paper, we conduct an empirical study on context modeling in Seq2Seq-like conversational systems.", 
        "15": "We emphasize the following research questions: • RQ1.", 
        "16": "How can we make better use of con-\ntext information?", 
        "17": "Our study shows that hierarchical models are generally better than nonhierarchical ones.", 
        "18": "We also propose a variant of context integration that explicitly weights a context vector by its relevance measure, outperforming simple vector pooling or concatenation.", 
        "19": "• RQ2.", 
        "20": "What is the effect of context on neural\ndialog systems?", 
        "21": "We find context information is useful to neural conversational models.", 
        "22": "It yields longer, more informative and diversified replies.", 
        "23": "To sum up, the contributions of this paper are two-fold: (1) We conduct a systematic study on context modeling in neural conversational models.", 
        "24": "(2) We further propose an explicitly con-\n231\ntext weighting approach, outperforming the other baselines.", 
        "25": "2 Models    2.1 Non-Hierarchical Model  To model a few utterances before the current query, several studies directly concatenate these sentences together and use a single model to capture the meaning of context and the query (Yan et al., 2016; Sordoni et al., 2015).", 
        "26": "They are referred to as non-hierarchical models in our paper.", 
        "27": "Such method is also used in other NLP tasks, e.g., document-level sentiment analysis (Xu et al., 2016) and machine comprehension (Wang and Jiang, 2017).", 
        "28": "Following the classic encode-decoder framework, we use a Seq2Seq network, which transforms the query and context into a fixed-length vector venc by a recurrent neural network (RNN) during encoding; then, in the decoding phase, it generates a reply r with another RNN in a wordby-word fashion.", 
        "29": "(See Figure 1a.)", 
        "30": "In our study, we adopt RNNs with gated recurrent units (Cho et al., 2014, GRUs), which alleviates the long propagation problem of vanilla RNNs.", 
        "31": "When decoding, we apply beam search with a size of 5.", 
        "32": "2.2 Hierarchical Model  A more complicated approach to context modeling is to build hierarchical models with a two-step strategy: an utterance-level model captures the meaning of each individual sentences, and then an inter-utterance model integrates context and query information (Figure 1b).", 
        "33": "Researchers have tried different ways of combining information during inter-utterance modeling; this paper evaluates several prevailing methods.", 
        "34": "Sum pooling.", 
        "35": "Sum pooling (denoted as Sum) integrates information over a candidate set by summing the values in each dimension (Figure 2a).", 
        "36": "Given context vectors vc1 , · · · ,vcn and the query vector vq, the encoded vector venc is\nvenc =\nn∑\ni=1\nvci + vq (1)\nSum pooling is used in Sordoni et al.", 
        "37": "(2015), where bag-of-words (BoW) features of context\nand the query are simply added.", 
        "38": "In our experiments, sum pooling operates on the features extracted by sentence-level RNNs of context and query utterances, as modern neural networks preserve more information than BoW features.", 
        "39": "Concatenation.", 
        "40": "Concatenation (Concat) is yet another method used in Sordoni et al.", 
        "41": "(2015).", 
        "42": "This strategy concatenates every utterance-level vectors vci and vq as a long vector, i.e., venc = [vc0 ; .", 
        "43": ".", 
        "44": ".", 
        "45": ";vcn ;vq].", 
        "46": "(See Figure 2b.)", 
        "47": "Compared with sum pooling, vector concatenation can distinguish different roles of the context and query, as this operation keeps input separately.", 
        "48": "One potential shortcoming, however, is that concatenation only works with fixed-length context.", 
        "49": "Sequential integration.", 
        "50": "Yao et al.", 
        "51": "(2015) and Serban et al.", 
        "52": "(2015) propose hierarchical dialog systems, where an inter-utterance RNN is built upon utterance-level RNNs’ features (last hidden state).", 
        "53": "Training is accomplished by end-to-end gradient propagation, and the process is illustrated in Figure 2c.", 
        "54": "Using an RNN to integrate context and query vectors in a sequential manner enables complicated information interaction.", 
        "55": "Based on the RNN’s hidden states, Sum and Concat could also be applied to obtain the encoded vector venc.", 
        "56": "(a) Sum pooling.", 
        "57": "(b) Concatenation.", 
        "58": "However, we found their performance is worse than only using the last hidden state (denoted as Seq).", 
        "59": "One plausible reason might be that the inter-sentence RNN is not long and that RNN can preserve these information well.", 
        "60": "Therefore, this variant is adopted in our experiments, as shown in Figure 2c.", 
        "61": "2.3 Explicitly Weighting by Context-Query Relevance  In conversation, context utterances may vary in content and semantics: context utterances that are relevant to the query may be useful, while irrelevant ones may bring more about noise.", 
        "62": "Following this intuition, we propose a variant that explicitly weights the context vector by an attention score of context-query relevance.", 
        "63": "First, we compute the similarity between the context and query by the cosine measure\nsci = sim(ci, q) = eci · eq ‖eci‖ · ‖eq‖\n(2)\nwhere\neci = ∑\nw∈ci ew and eq =\n∑ w′∈q ew′ (3)\nthat is, the sentence embedding is the sum of word embeddings.", 
        "64": "Following the spirit of attention mechanisms (Bahdanau et al., 2014), we would like to normalize these similarities by a softmax function and obtain attention probabilities:\nαci = exp(sci)∑n\nj=0 exp(scj ) + exp(sq) (4)\nαq = exp(sq)∑n\nj=0 exp(scj ) + exp(sq) (5)\nwhere sq is computed in the same manner as sci and is always 1, which is the cosine of two same vectors.", 
        "65": "The intuition is that, if the context is less relevant, we should mainly focus on the query itself, but if the context is relevant, we should focus more evenly across context and the query.", 
        "66": "In other words, our explicitly weighting approach could be viewed as heuristic attention.", 
        "67": "Akin to Subsection 2.2, we aggregate the weighted context and query vectors by pooling and concatenation, resulting in the following two variants.", 
        "68": "• WSeq (sum), where weighted vectors are summed together\nvenc = n∑\ni=0\nαcihci + αqhq (6)\n• WSeq (concat), where weighted vectors are concatenated\nvenc = [αc0hc0 ; .", 
        "69": ".", 
        "70": ".", 
        "71": ";αcnhcn ;αqhq] (7)\nNotice that the explicitly weighting approach can also be applied to sentence embeddings (without inter-sentence RNN).", 
        "72": "We denote the variants by WSum and WConcat, respectively; details are not repeated.", 
        "73": "They are included for comparison in Section 3.2.", 
        "74": "3 Experiments    3.1 Setup  We conducted all experiments on a Chinese dataset crawled from an online free chatting platform, Baidu Tieba.1 To facilitate the research of context’s effect, we established a multi-turn conversational corpus following Sordoni et al.", 
        "75": "(2015) and Serban et al.", 
        "76": "(2015).", 
        "77": "A data sample contains three utterances, being a triple 〈last context, query, reply〉.", 
        "78": "In total, we had\n1https://tieba.baidu.com\n500,000 samples for training, 2000 for validation, and 4000 for testing.", 
        "79": "The hyperparameters of neural networks were mainly derived from Shang et al.", 
        "80": "(2015) and Song et al.", 
        "81": "(2016): embeddings 620d and hidden states 1000d; we used AdaDelta for optimization.", 
        "82": "3.2 Results and Analysis  We evaluated model performance by BLEU scores.", 
        "83": "As this paper compares various models, it is unaffordable for us to hire workers to manually annotate their satisfaction.", 
        "84": "BLEU scores, albeit imperfect for open-domain dialog systems, exhibits more or less correlation with human satisfaction (Liu et al., 2016; Tao et al., 2017).", 
        "85": "We present in Table 1 the overall performance of the models introduced in Section 2, and answer our research questions as follows.", 
        "86": "RQ1: How can we make better use of context information?", 
        "87": "We first observe that context-aware methods generally outperform the context-insensitive one.", 
        "88": "This implies context is indeed useful in opendomain, chit-chat-style dialog systems.", 
        "89": "The results are consistent with previous studies (Sordoni et al., 2015; Serban et al., 2015).", 
        "90": "Among context-aware neural conversational models, we have the following findings.", 
        "91": "• Hierarchical structures outperform the nonhierarchical one.", 
        "92": "Comparing the non-hierarchical and hierarchical structures, we find it obvious that (most) hierarchical models outperform the non-hierarchical one by a large margin.", 
        "93": "The results show that, dialog systems are differ-\nent from other NLP applications, e.g., comprehension (Wang and Jiang, 2017), where non-hierarchical recurrent neural networks are adopted to better integrate information across different sentences.", 
        "94": "A plausible explanation, as indicated by Meng et al.", 
        "95": "(2017), is that conversational sentences are not necessarily uttered by a same speaker, and literature shows consistent evidence of the effectiveness of hierarchical RNNs in dialog systems.", 
        "96": "• Keeping the roles of different utterances separately is important.", 
        "97": "As mentioned in Section 2, the concatenation operation (Concat) distinguishes the roles of different utterances, while sum pooling Sum aggregates information in a homogeneous way.", 
        "98": "We see that the former outperforms the latter in both sentence-embedding and inter-sentence RNN levels, showing that sum pooling is not suitable for treating dialog context.", 
        "99": "Our conjecture is that sum pooling buries illuminating query information under less important context.", 
        "100": "Hence, keeping them separately will generally help.", 
        "101": "• The context-query relevance score benefits conversational systems.", 
        "102": "Our explicitly weighting approach computes an attention probability by context-query relevance.", 
        "103": "In all variants (Sum, Concat, and Seq), explicitly weighting improves the performance by a large margin (except BLEU-1 for Seq).", 
        "104": "The results indicate that contextquery relevance is useful, as it emphasizes\nrelevant context utterances as well as weakens irrelevant contexts.", 
        "105": "RQ2: What is the effect of context on neural dialog systems?", 
        "106": "We are now curious about how context information affects neural conversational systems.", 
        "107": "In Table 2, we present three auxiliary metrics, i.e., sentence length, entropy, and diversity.", 
        "108": "The former two are used in Serban et al.", 
        "109": "(2016) and Mou et al.", 
        "110": "(2016), whereas the latter one is used in Zhang and Hurley (2008).", 
        "111": "As shown, content-aware conversational models tend to generate longer, more meaningful and diverse replies compared with content-insensitive models, given that they also improve BLEU scores.2\nThis shows an interesting phenomenon of neural sequence generation: an encoder-decoder framework needs sufficient source information for meaningful generation of the target; it simply does not fall into meaningful content from less meaningful input.", 
        "112": "A similar phenomenon is also reported in our previous work (Mou et al., 2016); we show that, a same network will generate more meaningful sentences if it starts from a given (meaningful) keyword.", 
        "113": "These results also partially explain why a seq2seq neural network tends to generate short and universally relevant replies in open-domain conversation, despite its success in machine translation, abstractive summarization, etc.", 
        "114": "4 Conclusion  In this work, we analyzed the effect of context in generative conversational models.", 
        "115": "We conducted a systematic comparison among existing meth-\n2This condition is important when we draw conclusions.", 
        "116": "The length, entropy and diversity metrics do not make sense by themselves alone, because a system can achieve very high scores by repetitively generating random words.", 
        "117": "ods and our newly proposed variant that explicitly weights context vectors by context-query relevance.", 
        "118": "We show that hierarchical RNNs generally outperform non-hierarchical ones, and that explicitly weighting context information can emphasize the relevant context utterances and weaken less relevant ones.", 
        "119": "Our experiments also reveal an interesting phenomenon: with context information, neural networks tend to generate longer, more meaningful and diverse replies, which sheds light on neural sequence generation.", 
        "120": "Acknowledgments  We thank the reviewers for insightful comments.", 
        "121": "This research is partially supported by 863 Grant No.", 
        "122": "2015AA015403 and NSFC Grant No.", 
        "123": "61672058."
    }, 
    "document_id": "P17-2036.pdf.json"
}
