{
    "abstract_sentences": {
        "1": "Tasks like code generation and semantic parsing require mapping unstructured (or partially structured) inputs to well-formed, executable outputs.", 
        "2": "We introduce abstract syntax networks, a modeling framework for these problems.", 
        "3": "The outputs are represented as abstract syntax trees (ASTs) and constructed by a decoder with a dynamically-determined modular structure paralleling the structure of the output tree.", 
        "4": "On the benchmark HEARTHSTONE dataset for code generation, our model obtains 79.2 BLEU and 22.7% exact match accuracy, compared to previous state-ofthe-art values of 67.1 and 6.1%.", 
        "5": "Furthermore, we perform competitively on the ATIS, JOBS, and GEO semantic parsing datasets with no task-specific engineering."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1139–1149 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1105\nAbstract Syntax Networks for Code Generation and Semantic Parsing\nMaxim Rabinovich∗ Mitchell Stern∗ Dan Klein Computer Science Division\nUniversity of California, Berkeley {rabinovich,mitchell,klein}@cs.berkeley.edu\nAbstract  1 Introduction  Tasks like semantic parsing and code generation are challenging in part because they are structured (the output must be well-formed) but not synchronous (the output structure diverges from the input structure).", 
        "2": "Sequence-to-sequence models have proven effective for both tasks (Dong and Lapata, 2016; Ling et al., 2016), using encoder-decoder frameworks to exploit the sequential structure on both the input and output side.", 
        "3": "Yet these approaches do not account for much richer structural constraints on outputs—including well-formedness, well-typedness, and executability.", 
        "4": "The wellformedness case is of particular interest, since it can readily be enforced by representing outputs as abstract syntax trees (ASTs) (Aho et al., 2006), an approach that can be seen as a much lighter weight\n∗Equal contribution.", 
        "5": "name: [ ’D’, ’i’, ’r’, ’e’, ’ ’, ’W’, ’o’, ’l’, ’f’, ’ ’, ’A’, ’l’, ’p’, ’h’, ’a’] cost: [’2’] type: [’Minion’] rarity: [’Common’] race: [’Beast’] class: [’Neutral’] description: [ ’Adjacent’, ’minions’, ’have’, ’+’, ’1’, ’Attack’, ’.’] health: [’2’] attack: [’2’] durability: [’-1’]\nclass DireWolfAlpha(MinionCard): def __init__(self): super().__init__( \"Dire Wolf Alpha\", 2, CHARACTER_CLASS.ALL, CARD_RARITY.COMMON, minion_type=MINION_TYPE.BEAST)\ndef create_minion(self, player): return Minion(2, 2, auras=[ Aura(ChangeAttack(1), MinionSelector(Adjacent()))\n])\nversion of CCG-based semantic parsing (Zettlemoyer and Collins, 2005).", 
        "6": "In this work, we introduce abstract syntax networks (ASNs), an extension of the standard encoder-decoder framework utilizing a modular decoder whose submodels are composed to natively generate ASTs in a top-down manner.", 
        "7": "The decoding process for any given input follows a dy-\n1139\nnamically chosen mutual recursion between the modules, where the structure of the tree being produced mirrors the call graph of the recursion.", 
        "8": "We implement this process using a decoder model built of many submodels, each associated with a specific construct in the AST grammar and invoked when that construct is needed in the output tree.", 
        "9": "As is common with neural approaches to structured prediction (Chen and Manning, 2014; Vinyals et al., 2015), our decoder proceeds greedily and accesses not only a fixed encoding but also an attention-based representation of the input (Bahdanau et al., 2014).", 
        "10": "Our model significantly outperforms previous architectures for code generation and obtains competitive or state-of-the-art results on a suite of semantic parsing benchmarks.", 
        "11": "On the HEARTHSTONE dataset for code generation, we achieve a token BLEU score of 79.2 and an exact match accuracy of 22.7%, greatly improving over the previous best results of 67.1 BLEU and 6.1% exact match (Ling et al., 2016).", 
        "12": "The flexibility of ASNs makes them readily applicable to other tasks with minimal adaptation.", 
        "13": "We illustrate this point with a suite of semantic parsing experiments.", 
        "14": "On the JOBS dataset, we improve on previous state-of-the-art, achieving 92.9% exact match accuracy as compared to the previous record of 90.7%.", 
        "15": "Likewise, we perform competitively on the ATIS and GEO datasets, matching or exceeding the exact match reported by Dong and Lapata (2016), though not quite reaching the records held by the best previous semantic parsing approaches (Wang et al., 2014).", 
        "16": "1.1 Related work  Encoder-decoder architectures, with and without attention, have been applied successfully both to sequence prediction tasks like machine translation and to tree prediction tasks like constituency parsing (Cross and Huang, 2016; Dyer et al., 2016; Vinyals et al., 2015).", 
        "17": "In the latter case, work has focused on making the task look like sequence-tosequence prediction, either by flattening the output tree (Vinyals et al., 2015) or by representing it as a sequence of construction decisions (Cross and Huang, 2016; Dyer et al., 2016).", 
        "18": "Our work differs from both in its use of a recursive top-down generation procedure.", 
        "19": "Dong and Lapata (2016) introduced a sequenceto-sequence approach to semantic parsing, includ-\ning a limited form of top-down recursion, but without the modularity or tight coupling between output grammar and model characteristic of our approach.", 
        "20": "Neural (and probabilistic) modeling of code, including for prediction problems, has a longer history.", 
        "21": "Allamanis et al.", 
        "22": "(2015) and Maddison and Tarlow (2014) proposed modeling code with a neural language model, generating concrete syntax trees in left-first depth-first order, focusing on metrics like perplexity and applications like code snippet retrieval.", 
        "23": "More recently, Shin et al.", 
        "24": "(2017) attacked the same problem using a grammar-based variational autoencoder with top-down generation similar to ours instead.", 
        "25": "Meanwhile, a separate line of work has focused on the problem of program induction from input-output pairs (Balog et al., 2016; Liang et al., 2010; Menon et al., 2013).", 
        "26": "The prediction framework most similar in spirit to ours is the doubly-recurrent decoder network introduced by Alvarez-Melis and Jaakkola (2017), which propagates information down the tree using a vertical LSTM and between siblings using a horizontal LSTM.", 
        "27": "Our model differs from theirs in using a separate module for each grammar construct and learning separate vertical updates for siblings when the AST labels require all siblings to be jointly present; we do, however, use a horizontal LSTM for nodes with variable numbers of children.", 
        "28": "The differences between our models reflect not only design decisions, but also differences in data—since ASTs have labeled nodes and labeled edges, they come with additional structure that our model exploits.", 
        "29": "Apart from ours, the best results on the codegeneration task associated with the HEARTHSTONE dataset are based on a sequence-tosequence approach to the problem (Ling et al., 2016).", 
        "30": "Abstract syntax networks greatly improve on those results.", 
        "31": "Previously, Andreas et al.", 
        "32": "(2016) introduced neural module networks (NMNs) for visual question answering, with modules corresponding to linguistic substructures within the input query.", 
        "33": "The primary purpose of the modules in NMNs is to compute deep features of images in the style of convolutional neural networks (CNN).", 
        "34": "These features are then fed into a final decision layer.", 
        "35": "In contrast to the modules we describe here, NMN modules do not make decisions about what to generate or which modules to call next, nor do they\nmaintain recurrent state.", 
        "36": "2 Data Representation    2.1 Abstract Syntax Trees  Our model makes use of the Abstract Syntax Description Language (ASDL) framework (Wang et al., 1997), which represents code fragments as trees with typed nodes.", 
        "37": "Primitive types correspond to atomic values, like integers or identifiers.", 
        "38": "Accordingly, primitive nodes are annotated with a primitive type and a value of that type—for instance, in Figure 3a, the identifier node storing \"create minion\" represents a function of the same name.", 
        "39": "Composite types correspond to language constructs, like expressions or statements.", 
        "40": "Each type has a collection of constructors, each of which specifies the particular language construct a node of that type represents.", 
        "41": "Figure 4 shows constructors for the statement (stmt) and expression (expr) types.", 
        "42": "The associated language constructs include function and class definitions, return statements, binary operations, and function calls.", 
        "43": "Composite types enter syntax trees via composite nodes, annotated with a composite type and a choice of constructor specifying how the node expands.", 
        "44": "The root node in Figure 3a, for example, is\n1The full grammar can be found online on the documentation page for the Python ast module: https://docs.python.org/3/library/ast.", 
        "45": "html#abstract-grammar\na composite node of type stmt that represents a class definition and therefore uses the ClassDef constructor.", 
        "46": "In Figure 3b, on the other hand, the root uses the Call constructor because it represents a function call.", 
        "47": "Children are specified by named and typed fields of the constructor, which have cardinalities of singular, optional, or sequential.", 
        "48": "By default, fields have singular cardinality, meaning they correspond to exactly one child.", 
        "49": "For instance, the ClassDef constructor has a singular name field of type identifier.", 
        "50": "Fields of optional cardinality are associ-\nated with zero or one children, while fields of sequential cardinality are associated with zero or more children—these are designated using ?", 
        "51": "and * suffixes in the grammar, respectively.", 
        "52": "Fields of sequential cardinality are often used to represent statement blocks, as in the body field of the ClassDef and FunctionDef constructors.", 
        "53": "The grammars needed for semantic parsing can easily be given ASDL specifications as well, using primitive types to represent variables, predicates, and atoms and composite types for standard logical building blocks like lambdas and counting (among others).", 
        "54": "Figure 2 shows what the resulting λ-calculus trees look like.", 
        "55": "The ASDL grammars for both λ-calculus and Prolog-style logical forms are quite compact, as Figures 9 and 10 in the appendix show.", 
        "56": "2.2 Input Representation  We represent inputs as collections of named components, each of which consists of a sequence of tokens.", 
        "57": "In the case of semantic parsing, inputs have a single component containing the query sentence.", 
        "58": "In the case of HEARTHSTONE, the card’s name and description are represented as sequences of characters and tokens, respectively, while categorical attributes are represented as single-token sequences.", 
        "59": "For HEARTHSTONE, we restrict our input and output vocabularies to values that occur more than once in the training set.", 
        "60": "3 Model Architecture  Our model uses an encoder-decoder architecture with hierarchical attention.", 
        "61": "The key idea behind our approach is to structure the decoder as a collection of mutually recursive modules.", 
        "62": "The modules correspond to elements of the AST grammar and are composed together in a manner that mirrors the structure of the tree being generated.", 
        "63": "A vertical LSTM state is passed from module to module to propagate information during the decoding process.", 
        "64": "The encoder uses bidirectional LSTMs to embed each component and a feedforward network to combine them.", 
        "65": "Component- and token-level attention is applied over the input at each step of the decoding process.", 
        "66": "We train our model using negative log likelihood as the loss function.", 
        "67": "The likelihood encompasses terms for all generation decisions made by\nthe decoder.", 
        "68": "3.1 Encoder  Each component c of the input is encoded using a component-specific bidirectional LSTM.", 
        "69": "This results in forward and backward token encodings ( −→ hc, ←− hc) that are later used by the attention mechanism.", 
        "70": "To obtain an encoding of the input as a whole for decoder initialization, we concatenate the final forward and backward encodings of each component into a single vector and apply a linear projection.", 
        "71": "3.2 Decoder Modules  The decoder decomposes into several classes of modules, one per construct in the grammar, which we discuss in turn.", 
        "72": "Throughout, we let v denote the current vertical LSTM state, and use f to represent a generic feedforward neural network.", 
        "73": "LSTM updates with hidden state h and input x are notated as LSTM(h,x).", 
        "74": "Composite type modules Each composite type T has a corresponding module whose role is to select among the constructors C for that type.", 
        "75": "As Figure 5a exhibits, a composite type module receives a vertical LSTM state v as input and applies a feedforward network fT and a softmax output layer to choose a constructor:\np (C | T,v) = [ softmax (fT (v)) ] C .", 
        "76": "Control is then passed to the module associated with constructor C.\nConstructor modules Each constructor C has a corresponding module whose role is to compute an intermediate vertical LSTM state vu,F for each of its fields F whenever C is chosen at a composite node u.", 
        "77": "For each field F of the constructor, an embedding eF is concatenated with an attention-based context vector c and fed through a feedforward neural network fC to obtain a context-dependent field embedding:\nẽF = fC (eF, c) .", 
        "78": "An intermediate vertical state for the field F at composite node u is then computed as\nvu,F = LSTM v (vu, ẽF) .", 
        "79": "Figure 5b illustrates the process, starting with a single vertical LSTM state and ending with one updated state per field.", 
        "80": "Constructor field modules Each field F of a constructor has a corresponding module whose role is to determine the number of children associated with that field and to propagate an updated vertical LSTM state to them.", 
        "81": "In the case of fields with singular cardinality, the decision and update are both vacuous, as exactly one child is always generated.", 
        "82": "Hence these modules forward the field vertical LSTM state vu,F unchanged to the child w corresponding to F:\nvw = vu,F.", 
        "83": "(1)\nFields with optional cardinality can have either zero or one children; this choice is made using a feedforward network applied to the vertical LSTM state:\np(zF = 1 | vu,F) = sigmoid (fgenF (vu,F)) .", 
        "84": "(2)\nIf a child is to be generated, then as in (1), the state is propagated forward without modification.", 
        "85": "In the case of sequential fields, a horizontal LSTM is employed for both child decisions and state updates.", 
        "86": "We refer to Figure 5c for an illustration of the recurrent process.", 
        "87": "After being initialized with a transformation of the vertical state, sF,0 = WFvu,F, the horizontal LSTM iteratively\ndecides whether to generate another child by applying a modified form of (2):\np (zF,i = 1 | sF,i−1, vu,F) = sigmoid (fgenF (sF,i−1, vu,F)) .", 
        "88": "If zF,i = 0, generation stops and the process terminates, as represented by the solid black circle in Figure 5c.", 
        "89": "Otherwise, the process continues as represented by the white circle in Figure 5c.", 
        "90": "In that case, the horizontal state su,i−1 is combined with the vertical state vu,F and an attention-based context vector cF,i using a feedforward network fupdateF to obtain a joint context-dependent encoding of the field F and the position i:\nẽF,i = f update F (vu,F, su,i−1, cF,i).", 
        "91": "The result is used to perform a vertical LSTM update for the corresponding child wi:\nvwi = LSTM v(vu,F, ẽF,i).", 
        "92": "Finally, the horizontal LSTM state is updated using the same field-position encoding, and the process continues:\nsu,i = LSTM h(su,i−1, ẽF,i).", 
        "93": "Primitive type modules Each primitive type T has a corresponding module whose role is to select among the values y within the domain of that type.", 
        "94": "Figure 5d presents an example of the simplest form of this selection process, where the value y is obtained from a closed list via a softmax layer applied to an incoming vertical LSTM state:\np (y | T,v) = [ softmax (fT (v)) ] y .", 
        "95": "Some string-valued types are open class, however.", 
        "96": "To deal with these, we allow generation both from a closed list of previously seen values, as in Figure 5d, and synthesis of new values.", 
        "97": "Synthesis is delegated to a character-level LSTM language model (Bengio et al., 2003), and part of the role of the primitive module for open class types is to choose whether to synthesize a new value or not.", 
        "98": "During training, we allow the model to use the character LSTM only for unknown strings but include the log probability of that binary decision in the loss in order to ensure the model learns when to generate from the character LSTM.", 
        "99": "3.3 Decoding Process  The decoding process proceeds through mutual recursion between the constituting modules, where the syntactic structure of the output tree mirrors the call graph of the generation procedure.", 
        "100": "At each step, the active decoder module either makes a generation decision, propagates state down the tree, or both.", 
        "101": "To construct a composite node of a given type, the decoder calls the appropriate composite type module to obtain a constructor and its associated module.", 
        "102": "That module is then invoked to obtain updated vertical LSTM states for each of the constructor’s fields, and the corresponding constructor field modules are invoked to advance the process to those children.", 
        "103": "This process continues downward, stopping at each primitive node, where a value is generated but no further recursion is carried out.", 
        "104": "3.4 Attention  Following standard practice for sequence-tosequence models, we compute a raw bilinear attention score qrawt for each token t in the input using the decoder’s current state x and the token’s encoding et:\nqrawt = e > t Wx.", 
        "105": "The current state x can be either the vertical LSTM state in isolation or a concatentation of the vertical LSTM state and either a horizontal LSTM state or a character LSTM state (for string generation).", 
        "106": "Each submodule that computes attention does so using a separate matrix W.\nA separate attention score qcompc is computed for each component of the input, independent of its content:\nqcompc = w > c x.", 
        "107": "The final token-level attention scores are the sums of the raw token-level scores and the corresponding component-level scores:\nqt = q raw t + q comp c(t) ,\nwhere c(t) denotes the component in which token t occurs.", 
        "108": "The attention weight vector a is then computed using a softmax:\na = softmax (q) .", 
        "109": "Given the weights, the attention-based context is given by:\nc = ∑\nt\natet.", 
        "110": "Certain decision points that require attention have been highlighted in the description above; however, in our final implementation we made attention available to the decoder at all decision points.", 
        "111": "Supervised Attention In the datasets we consider, partial or total copying of input tokens into primitive nodes is quite common.", 
        "112": "Rather than providing an explicit copying mechanism (Ling et al., 2016), we instead generate alignments where possible to define a set of tokens on which the attention at a given primitive node should be concentrated.2 If no matches are found, the corresponding set of tokens is taken to be the whole input.", 
        "113": "The attention supervision enters the loss through a term that encourages the final attention weights to be concentrated on the specified subset.", 
        "114": "Formally, if the matched subset of componenttoken pairs is S, the loss term associated with the supervision would be\nlog ∑\nt\nexp (at)− log ∑\nt∈S exp (at), (3)\n2Alignments are generated using an exact string match heuristic that also included some limited normalization, primarily splitting of special characters, undoing camel case, and lemmatization for the semantic parsing datasets.", 
        "115": "where at is the attention weight associated with token t, and the sum in the first term ranges over all tokens in the input.", 
        "116": "The loss in (3) can be interpreted as the negative log probability of attending to some token in S.  4 Experimental evaluation    4.1 Semantic parsing  Data We use three semantic parsing datasets: JOBS, GEO, and ATIS.", 
        "117": "All three consist of natural language queries paired with a logical representation of their denotations.", 
        "118": "JOBS consists of 640 such pairs, with Prolog-style logical representations, while GEO and ATIS consist of 880 and 5,410 such pairs, respectively, with λ-calculus logical forms.", 
        "119": "We use the same training-test split as Zettlemoyer and Collins (2005) for JOBS and GEO, and the standard training-development-test split for ATIS.", 
        "120": "We use the preprocessed versions of these datasets made available by Dong and Lapata (2016), where text in the input has been lowercased and stemmed using NLTK (Bird et al., 2009), and matching entities appearing in the same input-output pair have been replaced by numbered abstract identifiers of the same type.", 
        "121": "Evaluation We compute accuracies using tree exact match for evaluation.", 
        "122": "Following the publicly released code of Dong and Lapata (2016), we canonicalize the order of the children within conjunction and disjunction nodes to avoid spurious errors, but otherwise perform no transformations before comparison.", 
        "123": "4.2 Code generation  Data We use the HEARTHSTONE dataset introduced by Ling et al.", 
        "124": "(2016), which consists of 665 cards paired with their implementations in the open-source Hearthbreaker engine.3 Our trainingdevelopment-test split is identical to that of Ling et al.", 
        "125": "(2016), with split sizes of 533, 66, and 66, respectively.", 
        "126": "Cards contain two kinds of components: textual components that contain the card’s name and a description of its function, and categorical ones that contain numerical attributes (attack, health, cost, and durability) or enumerated attributes (rarity, type, race, and class).", 
        "127": "The name of the card is represented as a sequence of characters, while\n3Available online at https://github.com/ danielyule/hearthbreaker.", 
        "128": "its description consists of a sequence of tokens split on whitespace and punctuation.", 
        "129": "All categorical components are represented as single-token sequences.", 
        "130": "Evaluation For direct comparison to the results of Ling et al.", 
        "131": "(2016), we evaluate our predicted code based on exact match and token-level BLEU relative to the reference implementations from the library.", 
        "132": "We additionally compute node-based precision, recall, and F1 scores for our predicted trees compared to the reference code ASTs.", 
        "133": "Formally, these scores are obtained by defining the intersection of the predicted and gold trees as their largest common tree prefix.", 
        "134": "4.3 Settings  For each experiment, all feedforward and LSTM hidden dimensions are set to the same value.", 
        "135": "We select the dimension from {30, 40, 50, 60, 70} for the smaller JOBS and GEO datasets, or from {50, 75, 100, 125, 150} for the larger ATIS and HEARTHSTONE datasets.", 
        "136": "The dimensionality used for the inputs to the encoder is set to 100 in all cases.", 
        "137": "We apply dropout to the non-recurrent connections of the vertical and horizontal LSTMs, selecting the noise ratio from {0.2, 0.3, 0.4, 0.5}.", 
        "138": "All parameters are randomly initialized using Glorot initialization (Glorot and Bengio, 2010).", 
        "139": "We perform 200 passes over the data for the JOBS and GEO experiments, or 400 passes for the ATIS and HEARTHSTONE experiments.", 
        "140": "Early stopping based on exact match is used for the semantic parsing experiments, where performance is evaluated on the training set for JOBS and GEO or on the development set for ATIS.", 
        "141": "Parameters for the HEARTHSTONE experiments are selected based on development BLEU scores.", 
        "142": "In order to promote generalization, ties are broken in all cases with a preference toward higher dropout ratios and lower dimensionalities, in that order.", 
        "143": "Our system is implemented in Python using the DyNet neural network library (Neubig et al., 2017).", 
        "144": "We use the Adam optimizer (Kingma and Ba, 2014) with its default settings for optimization, with a batch size of 20 for the semantic parsing experiments, or a batch size of 10 for the HEARTHSTONE experiments.", 
        "145": "4.4 Results  Our results on the semantic parsing datasets are presented in Table 1.", 
        "146": "Our basic system achieves\na new state-of-the-art accuracy of 91.4% on the JOBS dataset, and this number improves to 92.9% when supervised attention is added.", 
        "147": "On the ATIS and GEO datasets, we respectively exceed and match the results of Dong and Lapata (2016).", 
        "148": "However, these fall short of the previous best results of 91.3% and 90.4%, respectively, obtained by Wang et al.", 
        "149": "(2014).", 
        "150": "This difference may be partially attributable to the use of typing information or rich lexicons in most previous semantic parsing approaches (Zettlemoyer and Collins, 2007; Kwiatkowski et al., 2013; Wang et al., 2014; Zhao and Huang, 2015).", 
        "151": "On the HEARTHSTONE dataset, we improve significantly over the initial results of Ling et al.", 
        "152": "(2016) across all evaluation metrics, as shown in Table 2.", 
        "153": "On the more stringent exact match metric, we improve from 6.1% to 18.2%, and on tokenlevel BLEU, we improve from 67.1 to 77.6.", 
        "154": "When supervised attention is added, we obtain an additional increase of several points on each scale, achieving peak results of 22.7% accuracy and 79.2 BLEU.", 
        "155": "4.5 Error Analysis and Discussion  As the examples in Figures 6-8 show, classes in the HEARTHSTONE dataset share a great deal of common structure.", 
        "156": "As a result, in the simplest cases, such as in Figure 6, generating the code is simply a matter of matching the overall structure and plugging in the correct values in the initializer and a few other places.", 
        "157": "In such cases, our system generally predicts the correct code, with the\nexception of instances in which strings are incorrectly transduced.", 
        "158": "Introducing a dedicated copying mechanism like the one used by Ling et al.", 
        "159": "(2016) or more specialized machinery for string transduction may alleviate this latter problem.", 
        "160": "The next simplest category of card-code pairs consists of those in which the card’s logic is mostly implemented via nested function calls.", 
        "161": "Figure 7 illustrates a typical case, in which the card’s effect is triggered by a game event (a spell being cast) and both the trigger and the effect are described by arguments to an Effect constructor.", 
        "162": "Our system usually also performs well on instances like these, apart from idiosyncratic errors that can take the form of under- or overgeneration or simply substitution of incorrect predicates.", 
        "163": "Cards whose code includes complex logic expressed in an imperative style, as in Figure 8, pose the greatest challenge for our system.", 
        "164": "Factors like variable naming, nontrivial control flow, and interleaving of code predictable from the description with code required due to the conventions of the library combine to make the code for these cards difficult to generate.", 
        "165": "In some instances (as in the figure), our system is nonetheless able to synthesize a close approximation.", 
        "166": "However, in the most complex cases, the predictions deviate significantly from the correct implementation.", 
        "167": "In addition to the specific errors our system makes, some larger issues remain unresolved.", 
        "168": "Existing evaluation metrics only approximate the actual metric of interest: functional equivalence.", 
        "169": "Modifications of BLEU, tree F1, and exact\nmatch that canonicalize the code—for example, by anonymizing all variables—may prove more meaningful.", 
        "170": "Direct evaluation of functional equivalence is of course impossible in general (Sipser, 2006), and practically challenging even for the HEARTHSTONE dataset because it requires integrating with the game engine.", 
        "171": "Existing work also does not attempt to enforce semantic coherence in the output.", 
        "172": "Long-distance semantic dependencies, between occurrences of a single variable for example, in particular are not modeled.", 
        "173": "Nor is well-typedness or executability.", 
        "174": "Overcoming these evaluation and modeling issues remains an important open problem.", 
        "175": "5 Conclusion  ASNs provide a modular encoder-decoder architecture that can readily accommodate a variety of tasks with structured output spaces.", 
        "176": "They are particularly applicable in the presence of recursive decompositions, where they can provide a simple decoding process that closely parallels the inherent structure of the outputs.", 
        "177": "Our results demonstrate their promise for tree prediction tasks, and we believe their application to more general output structures is an interesting avenue for future work.", 
        "178": "Acknowledgments  MR is supported by an NSF Graduate Research Fellowship and a Fannie and John Hertz Foundation Google Fellowship.", 
        "179": "MS is supported by an NSF Graduate Research Fellowship."
    }, 
    "document_id": "P17-1105.pdf.json"
}
