{
    "abstract_sentences": {
        "1": "Counselor empathy is associated with better outcomes in psychology and behavioral counseling.", 
        "2": "In this paper, we explore several aspects pertaining to counseling interaction dynamics and their relation to counselor empathy during motivational interviewing encounters.", 
        "3": "Particularly, we analyze aspects such as participants’ engagement, participants’ verbal and nonverbal accommodation, as well as topics being discussed during the conversation, with the final goal of identifying linguistic and acoustic markers of counselor empathy.", 
        "4": "We also show how we can use these findings alongside other raw linguistic and acoustic features to build accurate counselor empathy classifiers with accuracies of up to 80%."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1426–1435 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1131  1 Introduction  Behavioral counseling is an important tool to address public health issues such as mental health, substance abuse, and nutrition problems among others.", 
        "2": "This has motivated increased interest in the study of mechanisms associated with successful interventions.", 
        "3": "Among them, counselor empathy has been identified as a key intervention component that relates to positive therapy outcomes.", 
        "4": "Displaying empathic behavior helps counselors to build rapport with their clients.", 
        "5": "Empathy levels experienced during counseling have a significant effect on treatment outcomes, as clients who perceive their counselor as empathic are more likely to improve than the ones who do not (Moyers and Miller, 2013).", 
        "6": "In this paper, we apply quantitative approaches to understand the dynamics of the counseling interactions and their relation to counselor empa-\nthy.", 
        "7": "We focus our analysis on counseling conducted using Motivational Interviewing (MI), a well-established evidence-based counseling style, where counselor empathy is defined as the active interest and effort to understand the client’s perspective (Miller and Rollnick, 2013).", 
        "8": "We address four main research questions.", 
        "9": "First, are there differences in how the counselor and the client engage during empathic conversations?", 
        "10": "We explore this question by conducting turn-by-turn word frequency analyses of participant’s interactions across the counseling conversations.", 
        "11": "Second, are there differences in verbal and vocal mimicry patterns occurring during high and low empathy interactions?", 
        "12": "We address this question by measuring the degree of language matching, verbal and nonverbal coordination, and power dynamics expressed during the interaction.", 
        "13": "Third, are there content differences in counselor discourse during high and low empathy interactions?", 
        "14": "We answer this question by applying topic modeling to identify the topics that are more salient in high and low empathy interventions (or in both).", 
        "15": "Finally, fourth, can we build accurate classifiers of counselor empathy?", 
        "16": "We show how the linguistic and acoustic empathy markers identified in our analyses, together with other raw features, can be used to construct classifiers able to predict counselor empathy with accuracies of up to 80%.", 
        "17": "2 Related Work  There have been several efforts to study the role of empathy during counseling interactions.", 
        "18": "(Xiao et al., 2012) applied a text-based approach to discriminate empathic from non-empathic encounters using word-frequency analysis.", 
        "19": "They conducted a set of experiments aiming to predict empathy at the utterance and session level on a manually annotated dataset.", 
        "20": "Results showed that empathy can\n1426\nbe predicted at reasonable accuracy levels, comparable to human assessments.", 
        "21": "(Gibson et al., 2015) presented a more refined approach for this task, which in addition to n-grams included features derived from the Linguistic Inquire Word Count, LIWC (Tausczik and Pennebaker, 2010) as well as psycholinguistic norms.", 
        "22": "Other research has focused on exploring aspects related to counselor empathy skills, such as their ability to match the client language.", 
        "23": "(Lord et al., 2015) analyzed the language coordination between client and counselor using Language Style Synchrony (LSS), a measure of the degree of similarity in word usage among speakers in adjacent talking turns.", 
        "24": "They found that empathy scores are positively related to LSS, and that higher levels of LSS are likely to result in higher empathy scores.", 
        "25": "Another line of work has explored the use of the acoustic component to predict empathy levels during counseling encounters.", 
        "26": "(Xiao et al., 2014) presented a study on the automatic evaluation of counselor empathy based on the analysis of correlation between prosody patterns and the degree of empathy showed by the therapist during the counseling interactions.", 
        "27": "More recently, (Xiao et al., 2015) addressed the empathy prediction task by deriving language models from transcripts obtained by an automatic speech recognition system, thus eliminating the need of human intervention during speaker segmentation and transcription.", 
        "28": "Most of this previous research has focused on the prediction task, and explored a variety of linguistic and acoustic representations for this goal.", 
        "29": "While some of this work has explored the linguistic accommodation between speakers, previous methods have not fully explored the conversational aspects of the counseling interaction.", 
        "30": "In this paper, we seek to explore how conversational aspects such as engagement, accommodation, and discourse topics are related to counselor empathy by using strategies such as turn-byturn word frequency analysis, language coordination, power dynamics analysis, and topic modeling.", 
        "31": "Furthermore, we build accurate empathy classifiers that rely on acoustic and linguistic cues inspired by our conversational analyses.", 
        "32": "3 Counseling Empathy Dataset  The dataset used in this study consists of 276 MI audio-recorded sessions from: two clinical research studies on smoking cessation and medica-\ntion adherence (Catley et al., 2012; Goggin et al., 2013); recordings of MI students from a graduatelevel MI course; wellness coaching phone calls; brief medical encounters in dental practice and student counseling.", 
        "33": "The dataset was obtained from a previous study conducted by the authors.", 
        "34": "Further details can be found in (Pérez-Rosas et al., 2016).", 
        "35": "The counseling sessions target three behavior changes: diet changes (72 sessions), smoking cessation (95 sessions), medication adherence (93 sessions).", 
        "36": "In addition, there are 16 sessions on miscellaneous topics.", 
        "37": "The full set comprises 97.8 hours of audio with an average session length of 20.8 minutes with a standard deviation of 11.5 minutes.", 
        "38": "3.1 Data Preprocessing  Before conducting our analysis on the collected dataset, we performed several preprocessing steps to ensure the confidentiality of the data and to enable automatic text and audio feature extraction.", 
        "39": "First, all the counseling recordings were subjected to an anonymization process.", 
        "40": "This includes manually trimming the audio to remove introductions, and inserting silences to replace references to participant’s name and location.", 
        "41": "Next, 162 sessions for which transcripts were not readily available were transcribed via Mechanical Turk (Marge et al., 2010) using the following guidelines: 1) transcribe speech turn by turn, 2) clearly identify the speaker (either client or counselor), 3) include speech disfluencies, such as false starts, repetitions of whole words or parts of words, and fillers.", 
        "42": "Transcriptions were manually verified at random points to avoid spam and ensure their quality.", 
        "43": "Since sessions were recorded in natural conditions, we applied speech enhancement methods to remove noise and improve the speech signal quality.", 
        "44": "We started by converting the audio signal from a stereo to a mono channel and to a uniform sample rate of 16k.", 
        "45": "We then applied the Mean Square Error estimation of spectral amplitude for audio denoising, as implemented in the Voicebox Speech Processing toolbox (Brookes, 2003).", 
        "46": "To allow for a turn-by-turn audio analysis of the counseling interaction, we processed the speech signal to separate client and counselor speech segments.", 
        "47": "To accomplish this task, we used on automatic speech-to-text forced alignment API.1 We\n1YouTube Data API\nthen used the automatically-obtained time stamps to segment the audio and derive speaker-specific speech segments for each counseling dyad.", 
        "48": "3.2 Data Annotation  Empathy assessments were obtained using the Motivational Interviewing Treatment Integrity (MITI) coding scheme version 4.1 (Moyers, 2014).", 
        "49": "Each session was assigned an empathy score using a 5-point Likert scale, which measures the extent to which the clinician understands or makes an effort to grasp the client’s perspective and feelings.", 
        "50": "The coding was conducted by two independent teams of three coders who had previous experience in MI and MI coding.", 
        "51": "Annotations were conducted using the session audio recording along with its transcript.", 
        "52": "The inter-rater reliability, measured in a random sample of 20 double coded sessions using the Intra-Class Correlation Coefficient was 0.60,2 suggesting that the annotators showed moderate agreement on empathy assessments.", 
        "53": "The reported annotation agreement was calculated on the original 5-scale empathy score and it is within the ranges reported in previous Motivational Interviewing studies (0.60- 0.62).", 
        "54": "Because of the skewed frequency distribution of the empathy scores in the dataset, we decided to conduct our analyses using empathy as a binary outcome, by classifying scores from 1 to 3 as low empathy, and scores of 4 and 5 as high empathy.", 
        "55": "This resulted in 179 high empathy sessions and 97 low empathy sessions.", 
        "56": "4 Empathic vs Non-Empathic Interactions: Counselor Engagement  We start by exploring differences in verbal exchange length between low and high empathy encounters as an indirect measure of participants engagement during the conversation.", 
        "57": "In this analysis, we account for the time dimension by segmenting the conversation into five equal portions.", 
        "58": "First, we look at the ratio of words exchanged between the counselor and the client for the different fractions of the conversation.3 As shown in Figure 1, low empathy interactions present noticeably\n2ICC scores were obtained using a two-way mixed model with absolute agreement.", 
        "59": "3This ratio is calculated for each pair of turns in the conversation, and it is simply measured as the number of words uttered by the counselor divided by the number of words uttered by the client.", 
        "60": "The turn-level word ratios are then averaged for all the turns included in a portion of the conversation.", 
        "61": "lower ratio of words exchanged between counselors and clients across the interaction, while high empathy exchanges show consistently higher levels of interaction.", 
        "62": "This can be further observed in Figure 2, which shows that more empathic counselors speak considerably less than their clients, and that their less empathic counterparts.", 
        "63": "This is in line with findings in MI literature indicating that counselors who reduce the amount of time they talk with their clients are likely to allow more time for the patient to talk and explore their concerns, thus improving the perception of empathy and understanding.", 
        "64": "5 The Role of Verbal and Nonverbal Accommodation in Empathy  Accommodation in health care communication involves counselor and client coordination including participation in communication and decision making, and shared understanding (D’Agostino\nand Bylund, 2014).", 
        "65": "We analyze the accommodation and its relation to empathy by exploring verbal and nonverbal behaviors exhibited by counseling participants during MI encounters.", 
        "66": "In addition to accommodation assessments, we explore the direction of the accommodation phenomena, i.e., whether the counselor is mirroring or leading the client.", 
        "67": "5.1 Verbal Accommodation  In order to explore how verbal accommodation phenomena in our dataset relate to the MITI empathy assessments, we use two methods that are drawn from the Conversation Accommodation Theory.", 
        "68": "The first one is the Linguistic Style Matching (LSM) proposed in (Gonzales et al., 2009) to quantify to which extent one speaker, i.e., the counselor, matches the language of the other, i.e., the client.", 
        "69": "The second one is the Linguistic Style Coordination (LSC) metric proposed in (Danescu-Niculescu-Mizil et al., 2011), which quantifies the degree to which one individual immediately echoes the linguistic style of the person they are responding to.", 
        "70": "Both metrics are evaluated across eight linguistic markers from the LIWC dictionary (Tausczik and Pennebaker, 2010) (i.e., quantifiers, conjunctions, adverbs, auxiliary verbs, prepositions, articles, personal pronouns and impersonal pronouns).", 
        "71": "LSM produces a score ranging between 0 and 1 indicating how much one person uses types of words comparable to the other person, while LSC generates a coordination score in the range of -1 to 1 indicating the degree of immediate coordination between speakers.", 
        "72": "While both measures are designed to analyze verbal synchrony, they can reveal different aspects of the counseling interaction.", 
        "73": "We use LSM to explore the potential match of language between counselors and clients across the counseling interaction, and we use LSC to quantify whether the counselor use of a specific linguistic marker in a given turn increases the probability of the client using the same marker during their reply.", 
        "74": "In addition, we use LSC to investigate power differences during the conversation based on the amount of coordination displayed by either counselor or client, under the assumption that the speaker who accommodates less holds the most power during the conversation (Danescu-Niculescu-Mizil et al., 2012).", 
        "75": "Figure 3 shows the average LSM scores for\neight linguistic markers measured on five equal segments of the conversation duration.", 
        "76": "As expected, we observe an increasing trend of language style matching during the counseling interaction in both high-empathic and low-empathic encounters, as people usually match their language unconsciously and regardless of the outcome of the conversation (Niederhoffer and Pennebaker, 2002).", 
        "77": "Interestingly, counselors and clients present a higher degree of language matching during high empathy encounters, while speakers in low empathy encounters show lower levels of style matching.", 
        "78": "We evaluate the immediate LSC in two directions: coordination of counselors toward clients, and coordination of clients toward counselors.", 
        "79": "Results indicate low levels of immediate coordination in both cases, with values ranging between -0.06 and 0.1.", 
        "80": "Nonetheless, the results also suggest that clients coordinate more than counselors, with LSC(client,counselor)=-0.030 compared to LSC(counselor, client)=-0.038, which further suggests that counselors have more power (control) during the conversation.4\nAnalyses of the LSC levels from counselors to clients on different linguistic markers across highempathic and low-empathic interactions provide interesting findings.", 
        "81": "While counselors generally show lower levels of coordination in the use of prepositions, auxiliary verbs, and personal pronouns (Figure 4), low-empathic counselors show higher LSC levels than their high-empathic counterparts.", 
        "82": "This can be attributed to the use of con-\n4The differences in coordination showed during the analyses are statistically significant (two tailed t-test, p=0.0156)\nfrontational language (e.g., I, could, should, and have), which is often associated with low empathy.", 
        "83": "Similar analyses on the client side, shown in Figure 5, indicate significant differences in the use of linguistic markers by the client (except for articles and quantifiers).", 
        "84": "In particular, during low empathy encounters, clients coordinate more on the use of conjunctions, adverbs, auxiliary verbs, prepositions, personal pronouns, and impersonal pronouns.", 
        "85": "5.2 Nonverbal Accommodation  Empathy is also shown through nonverbal channels such as visual and acoustics (Regenbogen et al., 2012).", 
        "86": "We explore the role of nonverbal mirroring in empathy by looking at vocal synchrony patterns shared between counselors and clients during the counseling interaction.", 
        "87": "We focus our analysis on vocal pitch, which is defined as the psychological perception of the voice frequency in terms of how high or how low it sounds.", 
        "88": "Pitch carries information about the speaker’s emotional state, and has been shown to be related to the perception of empathy in psychotherapy (Reich et al., 2014).", 
        "89": "We evaluate speech synchrony during turntaking trajectories in the conversation.", 
        "90": "We con-\nsider two cases: sequences where the counselor replies to the client statements (e.g., rephrasing), and sequences where the counselor leads the interaction (e.g., asking questions).", 
        "91": "Starting with the turn-by-turn segmentation,5 we extract pitch (F0) on each speaker-specific segment using OpenEar (Eyben et al., 2009).6 We then measure the correlation of all pitch values during counselor following turns and during counselor leading turns across the entire therapy session.7\nFigures 6 and 7 show the trends in pitch synchrony across high-empathic and low-empathic encounters in the dataset.", 
        "92": "In the first figure, we observe that when replying to clients, counselors who are given low empathy scores show higher vocal synchrony levels than counselors who receive higher empathy scores.", 
        "93": "A potential explanation for this finding is that a counselor who mirrors the client pitch might amplify the emotional distress of the client, or may suggest the counselor’s lack of confidence or knowledge (Reich et al., 2014).", 
        "94": "On the other hand, we observe the opposite trend for the counselor leading sequences, where higher vocal synchrony levels are observed during high empathy interactions, which can be at-\n5On average, there are approximately 40 counselor-client turns per conversation\n6The feature extraction was done at audio-frame level every 10ms with a 25ms Hamming window.", 
        "95": "7The terms of “counselor following” and “counselor leading” simply refer to how the correlation is computed.", 
        "96": "In “counselor following,” we consider the set of counselor utterances and the previous client utterances; in “counselor leading,” we consider the set of counselor utterances and the following client utterances.", 
        "97": "tributed to clients mirroring the counselor speech.", 
        "98": "The similarity is noticeably higher at the beginning of the conversation and gradually decreases as the conversation progresses.", 
        "99": "Moreover, the differences are not significant for the 40-100% turns, but results for the first 20% suggest significant differences at least in the beginning of the conversation (p < 0.05).", 
        "100": "This further confirm similarities during verbal and nonverbal accommodation, similar to how in section 5.1 we found that during high-empathic encounters, counselors hold control of the conversation and clients accommodate more than counselors.", 
        "101": "6 Topics Discussed during Counseling Interaction and their Relation to Empathy  We also conduct content analysis on the counseling interactions, to identify themes discussed in high-empathic and low-empathic encounters.", 
        "102": "For this task, we employ the Meaning Extraction Method (MEM) (Chung and Pennebaker, 2008), a topic extraction method that identifies the most common words used in a set of documents, and clusters them into coherent themes by analyzing their co-occurrences.", 
        "103": "MEM has been used in the past in the psychotherapy domain to analyze salient topics in depression forums (RamirezEsparza et al., 2008) and also to investigate differences in topics discussed by patients given their therapy outcomes, i.e., therapeutic gain or unsuccessful therapy (Wolf et al., 2010).", 
        "104": "Our analyses are conducted on counselor turns only, thus all the client turns are removed from\neach session transcript.", 
        "105": "We use the Meaning Extraction Helper tool (Boyd, 2016) to conduct the text preprocessing tasks, which include tokenizing and lemmatizing the words in each session, as well as removing function words.", 
        "106": "We keep only words who appear in at least 10% of the transcripts with a minimum frequency of 50.", 
        "107": "From the resulting list, we remove adjectives, adverbs, and verbs and keep only nouns as they usually refer to one definite class thus helping us to identify less ambiguous topics.", 
        "108": "Using the resulting noun list, with 339 entries, we generate a binary vector for each document, indicating the presence or absence of each noun in the document.", 
        "109": "We then run a Principal Component Analysis (PCA), followed by varimax rotation on the document matrix to find clusters of co-occurring nouns.", 
        "110": "The initial PCA shows that the first three components consist mainly of domain specific nouns.", 
        "111": "Notably, this accurately captures the presence of the three main behavior change targets discussed in the dataset, i.e., medication adherence, smoking cessation, and weight management; sample words from each component are shown in Table 1.", 
        "112": "In order to identify topics potentially related to the counseling skill, we decided to remove the domain words from the analysis, which resulted in 250 nouns.", 
        "113": "Next, we use the same PCA configuration on the binary document matrix and rerun the experiment, which this time leads to 98 components.", 
        "114": "Following PCA literature recommendations (Velicer and Fava, 1998), we retain only components with at least three variables with loadings greater than 0.30, which leads to 14 components.", 
        "115": "We then re-run PCA forcing a 14 components solution; these components explain 35% of the total variance in the original matrix.", 
        "116": "Finally, we use the method proposed in (Wilson et al., 2016) to measure the degree to which a particular MEM topic (component) is used during highempathic and low-emphatic encounters.", 
        "117": "Table 2 shows the scores assigned to each topic.", 
        "118": "In this table, scores greater than 1 correspond to topics salient in high empathy encounters while scores lower than 1 indicate topics salient in low empathy encounters.", 
        "119": "From this table, we can derive interesting observations.", 
        "120": "First, during high-empathic encounters, counselors seem to pay more attention to patient concerns, provide information, use reflective language, and talk about change.", 
        "121": "Second, during less empathic encounters, counselors seem to persuade and direct more, as well as focus on client’s resistance to change.", 
        "122": "Interestingly, topics that are identified as dominant in less empathic interactions are also related to MI non-adherent behavior, which means the counselors are not following the MI strategy (Rollnick et al., 2008).", 
        "123": "Finally, regardless of the empathy shown during the encounter, counselors discuss patients’ support system and feelings at similar rates (values closer to 1), which is expected when following the MI strategy.", 
        "124": "7 Prediction of Counselor Empathy  In the previous sections, we provided evidence of important differences in linguistic and verbal be-\nhaviors exhibited by counselors and clients during high-empathic and low-empathic MI encounters.", 
        "125": "In this section, we explore the use of linguistic and acoustic cues to build a computational model that predicts counselor empathy during MI encounters.", 
        "126": "The feature set consists of the cues identified during our exploratory analyses as potential indicators of counselor empathy, as well as additional text and audio features used during standard NLP and acoustic feature extraction.", 
        "127": "The text-based features are extracted from the manual transcripts of the sessions, while the audio-based features are extracted from audio segments obtained by force-aligning each session transcript with its corresponding audio.", 
        "128": "However, as future work, we are considering to automatize this process by conducting automatic speaker diarization and transcription via automatic speech recognition.", 
        "129": "During our experiments, we first explore the predictive power of each cue separately, followed by an integrated model that attempts to combine the linguistic and acoustic cues to improve the prediction of counselor empathy.", 
        "130": "All the experiments are performed using a Random Forest (Breiman, 2001) classifier.", 
        "131": "Given the large number of features, we use feature selection based on information gain to identify the best set of features during each experiment.", 
        "132": "During this process we keep at least 20% of the features in each set.", 
        "133": "Evaluations are conducted using leaveone-session-out cross-validation.", 
        "134": "The feature selection algorithm is run on each training fold before the model is trained, and the final model includes the best subset of attributes.", 
        "135": "As a reference value, we use a majority class baseline, obtained by selecting high empathy as the default class, which corresponds to 64% accuracy.", 
        "136": "7.1 Linguistic and Acoustic Features  Engagement: These features represent the participant’s engagement during the conversation as described in Section 4.", 
        "137": "They are evaluated at 20% increments of the conversation duration and also at conversation (session) level.", 
        "138": "The features are listed in Table 3.", 
        "139": "Linguistic accommodation: We measure the LSM and LSC metrics as described in section 5.2 over 74 LIWC categories and measured at 20% increments of the encounter duration.", 
        "140": "8Calculated using the LSC metric\nNonverbal accommodation: This set includes the counselor-leading and counselor-following synchrony scores, calculated as described in section 5.2, and evaluated at 20% increments of the encounter duration.", 
        "141": "Discourse topics: These features consist of the 14 topics identified in section 6 as frequently discussed during the MI encounters.", 
        "142": "The features are obtained by calculating the product of the principal components matrix and the binary documentterm matrix.", 
        "143": "Raw linguistic features: We extract a large set of linguistic features derived from the session transcript to model the counselor language.", 
        "144": "We include: unigrams and bigrams (ngrams), represented as a vector containing their frequencies in the session; psycholinguistic-inspired features that capture differences in semantic meaning (lexicons), represented as the total frequency counts of all the words in a lexicon-category that are present in the transcript; syntactic features that encode syntax patterns in the counselor statements (CFG), represented as a vector containing the frequency of lexicalized and unlexicalized production rules from the Context Free Grammar parse trees9 of each transcript.", 
        "145": "The final linguistic features set consists of 13,648 features.", 
        "146": "Raw acoustic features: This feature set includes a large number of speech features extracted with the OpenEar toolkit (Eyben et al., 2009).", 
        "147": "We use a predefined feature set, EmoLarge, which consists of a set of 6,552 features used for emotion recognition tasks.", 
        "148": "The features are derived from 25 lowlevel speech descriptors including intensity, loudness, 12 Mel frequency coefficients, pitch (F0),\n9Extracted with the Stanford parser (Klein and Manning, 2003).", 
        "149": "probability of voicing, F0 envelope, zero-crossing rate, and 8 line spectral frequencies.", 
        "150": "7.2 Classification Results  Classification results for each feature set are shown in Table 4.", 
        "151": "For the linguistic and acoustic modalities, almost all the feature sets provide classification accuracies above the baseline, with good F-scores for both high and low empathy.", 
        "152": "The only exception are the nonverbal accommodation features, which have an accuracy comparable to the baseline (64.86% vs. 64%).", 
        "153": "When combining all the feature sets for each modality, we observe performance gains in the range of 10 to 15%, as compared to the models that use one feature set at a time.", 
        "154": "We also conduct multimodal experiments where we combine linguistic and acoustic features using either early fusion by concatenating all the feature vectors, or late fusion by aggregating the outputs of each classifier using a rule-based score level fusion that assigns a weight of 0.8 to the linguistic classifier, and 0.2 to the acoustic classifier.10\nOverall, the results show performance gains when using late fusion as compared to early fusion.", 
        "155": "While the late fusion model does not outperform the best linguistic model in terms of accuracy and high empathy F-score, the multimodal late fusion classifier has significantly better F-score performance in the classification of low empathy encounters, thus suggesting potential benefits of fus-\n10Weights empirically determined on a development set by evaluating increments of 0.2 for each classifier weight.", 
        "156": "ing acoustic and linguistic cues during the prediction of counselor empathy.", 
        "157": "8 Conclusions  In this paper, we presented an extensive analysis of counselors and clients behaviors during MI encounters, and found significant differences in the way counselors and clients behave during high and low empathy encounters.", 
        "158": "We specifically explored the engagement, coordination, and discourse of counselors during MI interventions.", 
        "159": "Our main findings include: Engagement: Empathic counselors show more engagement during the conversation by a) showing levels of verbal interaction consistent with their client, and b) reducing their relative talking time with clients.", 
        "160": "Coordination: Empathic counselors match the linguistic style of their clients across the session, but maintain control of the conversation by coordinating less at immediate conversation turn-level.", 
        "161": "Conversation content: Empathic counselors use reflective language and talk about behavior change, while less empathic counselors persuade more and focus on client resistance toward change.", 
        "162": "The results of these analyses were used to build accurate counselor empathy classifiers that rely on linguistic and acoustic cues, with accuracies of up to 80%.", 
        "163": "In the future, we plan to build upon the acquired knowledge and the developed classifiers to create automatic tools that provide accurate evaluative feedback of counseling practice.", 
        "164": "Acknowledgments  We are grateful to Prof. Berrin Yanikoglu for her very useful input on the machine learning framework.", 
        "165": "This material is based in part upon work supported by the University of Michigan under the M-Cube program, by the National Science Foundation (grant #1344257), the John Templeton Foundation (grant #48503), and the Michigan Institute for Data Science.", 
        "166": "Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author and do not necessarily reflect the views of the University of Michigan, the National Science Foundation, the John Templeton Foundation, or the Michigan Institute for Data Science."
    }, 
    "document_id": "P17-1131.pdf.json"
}
