{
    "abstract_sentences": {
        "1": "Neural machine translation (NMT) becomes a new approach to machine translation and generates much more fluent results compared to statistical machine translation (SMT).", 
        "2": "However, SMT is usually better than NMT in translation adequacy.", 
        "3": "It is therefore a promising direction to combine the advantages of both NMT and SMT.", 
        "4": "In this paper, we propose a neural system combination framework leveraging multi-source NMT, which takes as input the outputs of NMT and SMT systems and produces the final translation.", 
        "5": "Extensive experiments on the Chineseto-English translation task show that our model archives significant improvement by 5.3 BLEU points over the best single system output and 3.4 BLEU points over the state-of-the-art traditional system combination methods."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 378–384 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-2060  1 Introduction  Neural machine translation has significantly improved the quality of machine translation in recent several years (Kalchbrenner and Blunsom, 2013; Sutskever et al., 2014; Bahdanau et al., 2015; Junczys-Dowmunt et al., 2016a).", 
        "2": "Although most sentences are more fluent than translations by statistical machine translation (SMT) (Koehn et al., 2003; Chiang, 2005), NMT has a problem to address translation adequacy especially for the rare and unknown words.", 
        "3": "Additionally, it suffers from over-translation and under-translation to some extent (Tu et al., 2016).", 
        "4": "Compared to NMT, SMT, such as phrase-based machine translation (PBMT, (Koehn et al., 2003)) and hierarchical phrase-based machine translation (HPMT,\n∗Corresponding author.", 
        "5": "(Chiang, 2005)), does not need to limit the vocabulary and can guarantee translation coverage of source sentences.", 
        "6": "It is obvious that NMT and SMT have different strength and weakness.", 
        "7": "In order to take full advantages of both NMT and SMT, system combination can be a good choice.", 
        "8": "Traditionally, system combination has been explored respectively in sentence-level, phrase-level, and word-level (Kumar and Byrne, 2004; Feng et al., 2009; Chen et al., 2009).", 
        "9": "Among them, word-level combination approaches that adopt confusion network for decoding have been quite successful (Rosti et al., 2007; Ayan et al., 2008; Freitag et al., 2014).", 
        "10": "However, these approaches are mainly designed for SMT without considering the features of NMT results.", 
        "11": "NMT opts to produce diverse words and free word order, which are quite different from SMT.", 
        "12": "And this will make it hard to construct a consistent confusion network.", 
        "13": "Furthermore, traditional system combination approaches cannot guarantee the fluency of the final translation results.", 
        "14": "In this paper, we propose a neural system combination framework, which is adapted from the multi-source NMT model (Zoph and Knight, 2016).", 
        "15": "Different encoders are employed to model the semantics of the source language input and each best translation produced by different NMT and SMT systems.", 
        "16": "The encoders produce multiple context vector representations, from which the decoder generates the final output word by word.", 
        "17": "Since the same training data is used for NMT, SMT and neural system combination, we further design a smart strategy to simulate the real training data for neural system combination.", 
        "18": "Specifically, we make the following contributions in this paper:\n• We propose a neural system combination method, which is adapted from multi-source\n378\nNMT model and can accommodate both source inputs and different system translations.", 
        "19": "It combines the fluency of NMT and adequacy (especially the ability to address rare words) of SMT.", 
        "20": "• We design a good strategy to construct appropriate training data for neural system combination.", 
        "21": "• The extensive experiments on ChineseEnglish translation show that our model archives significant improvement by 3.4 BLEU points over the state-of-the-art system combination methods and 5.3 BLEU points over the best individual system output.", 
        "22": "2 Neural Machine Translation  The encoder-decoder NMT with an attention mechanism (Bahdanau et al., 2015) has been proposed to softly align each decoder state with the encoder states, and computes the conditional probability of the translation given the source sentence.", 
        "23": "The encoder is a bidirectional neural network with gated recurrent units (GRU) (Cho et al., 2014) which reads an input sequence X = (x1, x2, ..., xm) and encodes it into a sequence of hidden states H = h1, h2, ..., hm.", 
        "24": "The decoder is a recurrent neural network that predicts a target sequence Y = (y1, y2, ..., yn).", 
        "25": "Each word yj is predicted based on a recurrent hidden state sj , the previously predicted word yj−1, and a context vector cj .", 
        "26": "cj is obtained from the\nweighted sum of the annotations hi.", 
        "27": "We use the latest implementation of attention-based NMT1.", 
        "28": "3 Neural System Combination for Machine Translation  Macherey and Och (2007) gave empirical evidence that these systems to be combined need to be almost uncorrelated in order to be beneficial for system combination.", 
        "29": "Since NMT and SMT are two kinds of translation models with large differences, we attempt to build a neural system combination model, which can take advantage of the different systems.", 
        "30": "Model: Figure 1 illustrates the neural system combination framework, which can take as input the source sentence and the results of MT systems.", 
        "31": "Here, we use MT results as inputs to detail the model.", 
        "32": "Formally, given the result sequences Z(Zn, Zp, and Zh) of three MT systems for the same source sentence and previously generated target sequence Y<j = (y1, y2, ..., yj−1), the probability of the next target word yj is\np(yj |Y<j , Z) = softmax(f(cj , yj−1, sj)) (1)\nHere f(.)", 
        "33": "is a non-linear function, yj−1 represents the word embedding of the previous prediction word, and sj is the state of decoder at time step j, calculated by\nsj = GRU(s̃j−1, cj) (2)\n1https://github.com/nyu-dl/dl4mt-tutorial\ns̃j−1 = GRU(sj−1, yj−1) (3)\nwhere sj−1 is previous hidden state, s̃j−1 is an intermediate state.", 
        "34": "And cj is the context vector of system combination obtained by attention mechanism, which is computed as weighted sum of the context vectors of three MT systems, just as illustrated in the middle part of Figure 1.\ncj = K∑\nk=1\nβjkcjk (4)\nwhere K is the number of MT systems, and βjk is a normalized item calculated as follows:\nβjk = exp(s̃j−1 · cjk)∑ k′ exp(s̃j−1 · cjk′ )\n(5)\nHere, we calculate kth MT system context cjk as a weighted sum of the source annotations:\ncjk = m∑\ni=1\nαkjihi (6)\nwhere hi = [ −→ h i; ←− h i] is the annotation of zi from a bi-directional GRU, and its weight αkji is computed by\nαkji = exp(eji)∑m l=1 exp(ejl)\n(7)\nwhere eji = vTa tanh(Was̃j−1+Uahi) scores how well s̃j−1 and hi match.", 
        "35": "Training Data Simulation: The neural system combination framework should be trained on the outputs of multiple translation systems and the gold target translations.", 
        "36": "In order to keep consistency in training and testing, we design a strategy\nto simulate the real scenario.", 
        "37": "We randomly divide the training corpus into two parts, then reciprocally train the MT system on one half and translate the source sentences of the other half into target translations.", 
        "38": "The MT translations and the gold target reference can be available.", 
        "39": "4 Experiments  We perform our experiments on the ChineseEnglish translation task.", 
        "40": "The MT systems participating in system combination are PBMT, HPMT and NMT.", 
        "41": "The evaluation metric is caseinsensitive BLEU (Papineni et al., 2002).", 
        "42": "4.1 Data preparation  Our training data consists of 2.08M sentence pairs extracted from LDC corpus.", 
        "43": "We use NIST 2003 Chinese-English dataset as the validation set, NIST 2004-2006 datasets as test sets.", 
        "44": "We list all the translation methods as follows:\n• PBMT: It is the start-of-the-art phrase-based SMT system.", 
        "45": "We use its default setting and train a 4-gram language model on the target portion of the bilingual training data.", 
        "46": "• HPMT: It is a hierarchical phrase-based SMT system, which uses its default configuration as PBMT in Moses.", 
        "47": "• NMT: It is an attention-based NMT system, with the same setting given in section 2.", 
        "48": "4.2 Training Details  The hyper-parameters used in our neural combination system are described as follows.", 
        "49": "We limit both Chinese and English vocabulary to 30k in our experiments.", 
        "50": "The number of hidden units is 1000\nand the word embedding dimension is 500 for all source and target word.", 
        "51": "The network parameters are updated with Adadelta algorithm.", 
        "52": "We adopt beam search with beam size b=10 at test time.", 
        "53": "As to confusion-network-based system Jane, we use its default configuration and train a 4-gram language model on target data and 10M Xinhua portion of Gigaword corpus.", 
        "54": "4.3 Main Results  We compare our neural combination system with the best individual engines, and the state-of-the-art traditional combination system Jane (Freitag et al., 2014).", 
        "55": "Table 1 shows the BLEU of different models on development data and test data.", 
        "56": "The BLEU score of the multi-source neural combination model is 2.53 higher than the best single model HPMT.", 
        "57": "The source language input gives a further improvement of +1.12 BLEU points.", 
        "58": "As shown in Table 1, Jane outperforms the best single MT system by 1.92 BLEU points.", 
        "59": "However, our neural combination system with source language gets an improvement of 1.67 BLEU points over Jane.", 
        "60": "Furthermore, when augmenting our neural combination system with ensemble decoding 2, it leads to another significant boost of +1.69 BLEU points.", 
        "61": "4.4 Word Order of Translation  We evaluate word order by the automatic evaluation metrics RIBES (Isozaki et al., 2010), whose score is a metric based on rank correlation coefficients with word precision.", 
        "62": "RIBES is known to have stronger correlation with human judgements than BLEU for English as discussed in Isozaki et al.", 
        "63": "(2010).", 
        "64": "2We use four neural combination models in ensemble model.", 
        "65": "Figure 2 illustrates experimental results of RIBES scores, which demonstrates that our neural combination model outperforms the best result of single MT system and Jane.", 
        "66": "Additionally, although BLEU point of Jane is higher than single NMT system, the word order of Jane is worse in terms of RIBES.", 
        "67": "4.5 Rare and Unknown Words Translation  It is difficult for NMT systems to handle rare words, because low-frequency words in training data cannot capture latent translation mappings in neural network model.", 
        "68": "However, we do not need to limit the vocabulary in SMT, which are often able to translate rare words in training data.", 
        "69": "As shown in Table 2, the number of unknown words of our proposed model is 137 fewer than original NMT model.", 
        "70": "Table 4 shows an example of system combination.", 
        "71": "The Chinese word zǔzhı̄wǎng is an out-ofvocabulary(OOV) for NMT and the baseline NMT cannot correctly translate this word.", 
        "72": "Although PBMT and HPMT translate this word well, they does not conform to the grammar.", 
        "73": "By combining the merits of NMT and SMT, our model gets the correct translation.", 
        "74": "4.6 Effect of Ensemble Decoding  The performance of candidate systems is very important to the result of system combination, and we use ensemble strategy with four NMT models to improve the performance of original NMT system.", 
        "75": "As shown in Table 3, the E-NMT with\nensemble strategy outperforms the original NMT system by +1.40 BLEU points, and it has become the best sytem in all MT systems, which is +0.68 BLEU points higher than HPMT.", 
        "76": "After replacing original NMT with strong ENMT , Jane outperforms original result by +0.45 BLEU points, and our model gets an improvement of +3.08 BLEU points over Jane.", 
        "77": "Experiments further demonstrate that our proposed model is effective and robust for system combination.", 
        "78": "5 Related Work  The recently proposed neural machine translation has drawn more and more attention.", 
        "79": "Most of the existing approaches and models mainly focus on designing better attention models (Luong et al., 2015a; Mi et al., 2016a,b; Tu et al., 2016; Meng et al., 2016), better strategies for handling rare and unknown words (Luong et al., 2015b; Li et al., 2016; Zhang and Zong, 2016a; Sennrich et al., 2016b) , exploiting large-scale monolingual data (Cheng et al., 2016; Sennrich et al., 2016a; Zhang and Zong, 2016b), and integrating SMT techniques (Shen et al., 2016; Junczys-Dowmunt et al., 2016b; He et al., 2016).", 
        "80": "Our focus in this work is aiming to take advantage of NMT and SMT by system combination, which attempts to find consensus translations among different machine translation systems.", 
        "81": "In past several years, word-level, phrase-level and sentence-level system combination methods were well studied (Bangalore et al., 2001; Rosti et al., 2008; Li and Zong, 2008; Li et al., 2009; Heafield and Lavie, 2010; Freitag et al., 2014; Ma and Mckeown, 2015; Zhu et al., 2016), and reported stateof-the-art performances in benchmarks for SMT.", 
        "82": "Here, we propose a neural system combination model which combines the advantages of NMT and SMT efficiently.", 
        "83": "Recently, Niehues et al.", 
        "84": "(2016) use phrase-\nbased SMT to pre-translate the inputs into target translations.", 
        "85": "Then a NMT system generates the final hypothesis using the pre-translation.", 
        "86": "Moreover, multi-source MT has been proved to be very effective to combine multiple source languages (Och and Ney, 2001; Zoph and Knight, 2016; Firat et al., 2016a,b; Garmash and Monz, 2016).", 
        "87": "Unlike previous works, we adapt multi-source NMT for system combination and design a good strategy to simulate the real training data for our neural system combination.", 
        "88": "6 Conclusion and Future Work  In this paper, we propose a novel neural system combination framework for machine translation.", 
        "89": "The central idea is to take advantage of NMT and SMT by adapting the multi-source NMT model.", 
        "90": "The neural system combination method cannot only address the fluency of NMT and the adequacy of SMT, but also can accommodate the source sentences as input.", 
        "91": "Furthermore, our approach can further use ensemble decoding to boost the performance compared to traditional system combination methods.", 
        "92": "Experiments on Chinese-English datasets show that our approaches obtain significant improvements over the best individual system and the state-of-the-art traditional system combination methods.", 
        "93": "In the future work, we plan to encode nbest translation results to further improve the system combination quality.", 
        "94": "Additionally, it is interesting to extend this approach to other tasks like sentence compression and text abstraction.", 
        "95": "Acknowledgments  The research work has been funded by the Natural Science Foundation of China under Grant No.", 
        "96": "61333018 and No.", 
        "97": "61673380, and it is also supported by the Strategic Priority Research Program of the CAS under Grant No.", 
        "98": "XDB02070007."
    }, 
    "document_id": "P17-2060.pdf.json"
}
