{
    "abstract_sentences": {
        "1": "Interactive topic models are powerful tools for understanding large collections of text.", 
        "2": "However, existing sampling-based interactive topic modeling approaches scale poorly to large data sets.", 
        "3": "Anchor methods, which use a single word to uniquely identify a topic, offer the speed needed for interactive work but lack both a mechanism to inject prior knowledge and lack the intuitive semantics needed for userfacing applications.", 
        "4": "We propose combinations of words as anchors, going beyond existing single word anchor algorithms— an approach we call “Tandem Anchors”.", 
        "5": "We begin with a synthetic investigation of this approach then apply the approach to interactive topic modeling in a user study and compare it to interactive and noninteractive approaches.", 
        "6": "Tandem anchors are faster and more intuitive than existing interactive approaches.", 
        "7": "Topic models distill large collections of text into topics, giving a high-level summary of the thematic structure of the data without manual annotation.", 
        "8": "In addition to facilitating discovery of topical trends (Gardner et al., 2010), topic modeling is used for a wide variety of problems including document classification (Rubin et al., 2012), information retrieval (Wei and Croft, 2006), author identification (Rosen-Zvi et al., 2004), and sentiment analysis (Titov and McDonald, 2008).", 
        "9": "However, the most compelling use of topic models is to help users understand large datasets (Chuang et al., 2012).", 
        "10": "Interactive topic modeling (Hu et al., 2014) allows non-experts to refine automatically generated topics, making topic models less of a “take it or leave it” proposition.", 
        "11": "Including humans input during training improves the quality of the model and allows users to guide topics in a specific way, custom tailoring the model for a specific downstream task or analysis.", 
        "12": "The downside is that interactive topic modeling is slow—algorithms typically scale with the size of the corpus—and requires non-intuitive information from the user in the form of must-link and cannot-link constraints (Andrzejewski et al., 2009).", 
        "13": "We address these shortcomings of interactive topic modeling by using an interactive version of the anchor words algorithm for topic models.", 
        "14": "The anchor algorithm (Arora et al., 2013) is an alternative topic modeling algorithm which scales with the number of unique word types in the data rather than the number of documents or tokens (Section 1).", 
        "15": "This makes the anchor algorithm fast enough for interactive use, even in web-scale document collections.", 
        "16": "A drawback of the anchor method is that anchor words—words that have high probability of being in a single topic—are not intuitive.", 
        "17": "We extend the anchor algorithm to use multiple anchor words in tandem (Section 2).", 
        "18": "Tandem anchors not only improve interactive refinement, but also make the underlying anchor-based method more intuitive.", 
        "19": "For interactive topic modeling, tandem anchors produce higher quality topics than single word anchors (Section 3).", 
        "20": "Tandem anchors provide a framework for fast interactive topic modeling: users improve and refine an existing model through multiword anchors (Section 4).", 
        "21": "Compared to existing methods such as Interactive Topic Models (Hu et al., 2014), our method is much faster."
    }, 
    "body_sentences": {
        "1": "  Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 896–905 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1083\nTopic models distill large collections of text into topics, giving a high-level summary of the thematic structure of the data without manual annotation.", 
        "2": "In addition to facilitating discovery of topical trends (Gardner et al., 2010), topic modeling is used for a wide variety of problems including document classification (Rubin et al., 2012), information retrieval (Wei and Croft, 2006), author identification (Rosen-Zvi et al., 2004), and sentiment analysis (Titov and McDonald, 2008).", 
        "3": "However, the most compelling use of topic models is to help users understand large datasets (Chuang et al., 2012).", 
        "4": "Interactive topic modeling (Hu et al., 2014) allows non-experts to refine automatically generated\ntopics, making topic models less of a “take it or leave it” proposition.", 
        "5": "Including humans input during training improves the quality of the model and allows users to guide topics in a specific way, custom tailoring the model for a specific downstream task or analysis.", 
        "6": "The downside is that interactive topic modeling is slow—algorithms typically scale with the size of the corpus—and requires non-intuitive information from the user in the form of must-link and cannot-link constraints (Andrzejewski et al., 2009).", 
        "7": "We address these shortcomings of interactive topic modeling by using an interactive version of the anchor words algorithm for topic models.", 
        "8": "The anchor algorithm (Arora et al., 2013) is an alternative topic modeling algorithm which scales with the number of unique word types in the data rather than the number of documents or tokens (Section 1).", 
        "9": "This makes the anchor algorithm fast enough for interactive use, even in web-scale document collections.", 
        "10": "A drawback of the anchor method is that anchor words—words that have high probability of being in a single topic—are not intuitive.", 
        "11": "We extend the anchor algorithm to use multiple anchor words in tandem (Section 2).", 
        "12": "Tandem anchors not only improve interactive refinement, but also make the underlying anchor-based method more intuitive.", 
        "13": "For interactive topic modeling, tandem anchors produce higher quality topics than single word anchors (Section 3).", 
        "14": "Tandem anchors provide a framework for fast interactive topic modeling: users improve and refine an existing model through multiword anchors (Section 4).", 
        "15": "Compared to existing methods such as Interactive Topic Models (Hu et al., 2014), our method is much faster.", 
        "16": "896  1 Vanilla Anchor Algorithm  The anchor algorithm computes the topic matrix A, where Av,k is the conditional probability of observing word v given topic k, e.g., the probability of seeing the word “lens” given the camera topic in a corpus of Amazon product reviews.", 
        "17": "Arora et al.", 
        "18": "(2012a) find these probabilities by assuming that every topic contains at least one ‘anchor’ word which has a non-zero probability only in that topic.", 
        "19": "Anchor words make computing the topic matrix A tractable because the occurrence pattern of the anchor word mirrors the occurrence pattern of the topic itself.", 
        "20": "To recover the topic matrix A using anchor words, we first compute a V × V cooccurrence matrix Q, where Qi,j is the conditional probability p(wj |wi) of seeing word type wj after having seen wi in the same document.", 
        "21": "A form of the Gram-Schmidt process on Q finds anchor words {g1 .", 
        "22": ".", 
        "23": ".", 
        "24": "gk} (Arora et al., 2013).", 
        "25": "Once we have the set of anchor words, we can compute the probability of a topic given a word (the inverse of the conditioning in A).", 
        "26": "This coefficient matrix C is defined row-wise for each word i\nC∗i,· = argmin Ci,· DKL\n( Qi,· ∥∥∥∥ K∑\nk=1\nCi,kQgk,·\n) ,\n(1) which gives the best reconstruction (based on Kullback-Leibler divergence DKL) of non-anchor words given anchor words’ conditional probabilities.", 
        "27": "For example, in our product review data, a word such as “battery” is a convex combination of the anchor words’ contexts (Qgk,·) such as “camera”, “phone”, and “car”.", 
        "28": "Solving each row of C is fast and is embarrassingly parallel.", 
        "29": "Finally, we apply Bayes’ rule to recover the topic matrix A from the coefficient matrix C.\nThe anchor algorithm can be orders of magnitude faster than probabilistic inference (Arora et al., 2013).", 
        "30": "The construction of Q has a runtime of O(DN2) where D is the number of documents and N is the average number of tokens per document.", 
        "31": "This computation requires only a single pass over the data and can be pre-computed for interactive use-cases.", 
        "32": "Once Q is constructed, topic recovery requires O(KV 2 +K2V I), where K is the number of topics, V is the vocabulary size, and I is the average number of iterations (typically 100-1000).", 
        "33": "In contrast, traditional topic\nAnchor Top Words in Topics backpack backpack camera lens bag room carry fit cameras equipment comfortable camera camera lens pictures canon digital lenses batteries filter mm photos bag bag camera diaper lens bags genie smell\nroom diapers odor\nTable 1: Three separate attempts to construct a topic concerning camera bags in Amazon product reviews with single word anchors.", 
        "34": "This example is drawn from preliminary experiments with an author as the user.", 
        "35": "The term “backpack” is a good anchor because it uniquely identifies the topic.", 
        "36": "However, both “camera” and “bag” are poor anchors for this topic.", 
        "37": "model inference typically requires multiple passes over the entire data.", 
        "38": "Techniques such as Online LDA (Hoffman et al., 2010) or Stochastic Variation Inference (Hoffman et al., 2013) improves this to a single pass over the entire data.", 
        "39": "However, from Heaps’ law (Heaps, 1978) it follows that V 2 DN for large datasets, leading to much faster inference times for anchor methods compared to probabilistic topic modeling.", 
        "40": "Further, even if online were to be adapted to incorporate human guidance, a single pass is not tractable for interactive use.", 
        "41": "2 Tandem Anchor Extension  Single word anchors can be opaque to users.", 
        "42": "For an example of bewildering anchor words, consider a camera bag topic from a collection of Amazon product reviews (Table 1).", 
        "43": "The anchor word “backpack” may seem strange.", 
        "44": "However, this dataset contains nothing about regular backpacks; thus, “backpack” is unique to camera bags.", 
        "45": "Bizarre, low-to-mid frequency words are often anchors because anchor words must be unique to a topic; intuitive or high-frequency words cannot be anchors if they have probability in any other topic.", 
        "46": "The anchor selection strategy can mitigate this problem to some degree.", 
        "47": "For example, rather than selecting anchors using an approximate convex hull in high-dimensional space, we can find an exact convex hull in a low-dimensional embedding (Lee and Mimno, 2014).", 
        "48": "This strategy will produce more salient topics but still makes it difficult for users to manually choose unique anchor words for interactive topic modeling.", 
        "49": "If we instead ask users to give us representative\nwords for this topic, we would expect combinations of words like “camera” and “bag.” However, with single word anchors we must choose a single word to anchor each topic.", 
        "50": "Unfortunately, because these words might appear in multiple topics, individually they are not suitable as anchor words.", 
        "51": "The anchor word “camera” generates a general camera topic instead of camera bags, and the topic anchored by “bag” includes bags for diaper pails (Table 1).", 
        "52": "Instead, we need to use sets of representative terms as an interpretable, parsimonious description of a topic.", 
        "53": "This section discusses strategies to build anchors from multiple words and the implications of using multiword anchors to recover topics.", 
        "54": "This extension not only makes anchors more interpretable but also enables users to manually construct effective anchors in interactive topic modeling settings.", 
        "55": "2.1 Anchor Facets  We first need to turn words into an anchor.", 
        "56": "If we interpret the anchor algorithm geometrically, each row of Q represents a word as a point in V -dimensional space.", 
        "57": "We then model each point as a convex combination of anchor words to reconstruct the topic matrix A (Equation 1).", 
        "58": "Instead of individual anchor words (one anchor word per topic), we use anchor facets, or sets of words that describe a topic.", 
        "59": "The facets for each anchor form a new pseudoword, or an invented point in V -dimensional space (described in more detail in Section 2.2).", 
        "60": "While these new points do not correspond to words in the vocabulary, we can express nonanchor words as convex combinations of pseudowords.", 
        "61": "To construct these pseudowords from their facets, we combine the co-occurrence profiles of the facets.", 
        "62": "These pseudowords then augment the original cooccurrence matrix Q with K additional rows corresponding to synthetic pseudowords forming each of K multiword anchors.", 
        "63": "We refer to this augmented matrix as S. The rest of the anchor algorithm proceeds unmodified.", 
        "64": "Our augmented matrix S is therefore a (V + K) × V matrix.", 
        "65": "As before, V is the number of token types in the data and K is the number of topics.", 
        "66": "The first V rows of S correspond to the V token types observed in the data, while the additionalK rows correspond to the pseudowords constructed from anchor facets.", 
        "67": "Each entry of S en-\ncodes conditional probabilities so that Si,j is equal to p(wi |wj).", 
        "68": "For the additionalK rows, we invent a cooccurrence pattern that can effectively explain the other words’ conditional probabilities.", 
        "69": "This modification is similar in spirit to supervised anchor words (Nguyen et al., 2015).", 
        "70": "This supervised extension of the anchor words algorithm adds columns corresponding to conditional probabilities of metadata values after having seen a particular word.", 
        "71": "By extending the vector-space representation of each word, anchor words corresponding to metadata values can be found.", 
        "72": "In contrast, our extension does not add dimensions to the representation, but simply places additional points corresponding to pseudoword words in the vectorspace representation.", 
        "73": "2.2 Combining Facets into Pseudowords  We now describe more concretely how to combine an anchor facets to describe the cooccurrence pattern of our new pseudoword anchor.", 
        "74": "In tandem anchors, we create vector representations that combine the information from anchor facets.", 
        "75": "Our anchor facets are G1 .", 
        "76": ".", 
        "77": ".GK , where Gk is a set of anchor facets which will form the kth pseudoword anchor.", 
        "78": "The pseudowords are g1 .", 
        "79": ".", 
        "80": ".", 
        "81": "gK , where gk is the pseudoword from Gk.", 
        "82": "These pseudowords form the new rows of S. We give several candidates for combining anchors facets into a single multiword anchor; we compare their performance in Section 3.", 
        "83": "Vector Average An obvious function for computing the central tendency is the vector average.", 
        "84": "For each anchor facet,\nSgk,j = ∑\ni∈Gk\nSi,j |Gk| , (2)\nwhere |Gk| is the cardinality of Gk.", 
        "85": "Vector average makes the pseudoword Sgk,j more central, which is intuitive but inconsistent with the interpretation from Arora et al.", 
        "86": "(2013) that anchors should be extreme points whose linear combinations explain more central words.", 
        "87": "Or-operator An alternative approach is to consider a cooccurrence with any anchor facet in Gk.", 
        "88": "For word j, we use De Morgan’s laws to set\nSgk,j = 1− ∏\ni∈Gk (1− Si,j).", 
        "89": "(3)\nUnlike the average, which pulls the pseudoword inward, this or-operator pushes the word outward,\nincreasing each of the dimensions.", 
        "90": "Increasing the volume of the simplex spanned by the anchors explains more words.", 
        "91": "Element-wise Min Vector average and oroperator are both sensitive to outliers and cannot account for polysemous anchor facets.", 
        "92": "Returning to our previous example, both “camera” and “bag” are bad anchors for camera bags because they appear in documents discussing other products.", 
        "93": "However, if both “camera” and “bag” are anchor facets, we can look at an intersection of their contexts: words that appear with both.", 
        "94": "Using the intersection, the cooccurrence pattern of our anchor facet will only include terms relevant to camera bags.", 
        "95": "Mathematically, this is an element-wise min operator,\nSgk,j = min i∈Gk Si,j .", 
        "96": "(4)\nThis construction, while perhaps not as simple as the previous two, is robust to words which have cooccurrences which are not unique to a single topic.", 
        "97": "Harmonic Mean Leveraging the intuition that we should use a combination function which is both centralizing (like vector average) and ignores large outliers (like element-wise min), the final combination function is the element-wise harmonic mean.", 
        "98": "Thus, for each anchor facet\nSgk,j = ∑\ni∈Gk\n( S−1i,j |Gk| )−1 .", 
        "99": "(5)\nSince the harmonic mean tends towards the lowest values in the set, it is not sensitive to large outliers, giving us robustness to polysemous words.", 
        "100": "2.3 Finding Topics  After constructing the pseudowords of S we then need to find the coefficients Ci,k which describe each word in our vocabulary as a convex combination of the multiword anchors.", 
        "101": "Like standard anchor methods, we solve the following for each token type:\nC∗i,· = argmin Ci,· DKL\n( Si,· ∥∥∥∥ K∑\nk=1\nCi,kSgk,·\n) .", 
        "102": "(6) Finally, we appeal to Bayes’ rule, we recover the topic-word matrix A from the coefficients of C.\nThe correctness of the topic recovery algorithm hinges upon the assumption of separability.", 
        "103": "Separability means that the occurrence pattern across\ndocuments of the anchor words across the data mirrors that of the topics themselves.", 
        "104": "For single word anchors, this has been observed to hold for a wide variety of data (Arora et al., 2012b).", 
        "105": "With our tandem anchor extension, we make similar assumptions as the vanilla algorithm, except with pseudowords constructed from anchor facets.", 
        "106": "So long as the occurrence pattern of our tandem anchors mirrors that of the underlying topics, we can use the same reasoning as Arora et al.", 
        "107": "(2012a) to assert that we can provably recover the topic-word matrix A with all of the same theoretical guarantees of complexity and robustness.", 
        "108": "Furthermore, we runtime analysis given by Arora et al.", 
        "109": "(2013) applies to tandem anchors.", 
        "110": "If desired, we can also add further robustness and extensibility to tandem anchors by adding regularization to Equation 6.", 
        "111": "Regularization allows us to add something which is mathematically similar to priors, and has been shown to improve the vanilla anchor word algorithm (Nguyen et al., 2014).", 
        "112": "We leave the question of the best regularization for tandem anchors as future work, and focus our efforts on solving the problem of interactive topic modeling.", 
        "113": "3 High Water Mark for Tandem Anchors  Before addressing interactivity, we apply tandem anchors to real world data, but with anchors gleaned from metadata.", 
        "114": "Our purpose is twofold.", 
        "115": "First, we determine which combiner from Section 2.2 to use in our interactive experiments in Section 4 and second, we confirm that well-chosen tandem anchors can improve topics.", 
        "116": "In addition, we examine the runtime of tandem anchors and compare to traditional model-based interactive topic modeling techniques.", 
        "117": "We cannot assume that we will have metadata available to build tandem anchors, but we use them here because they provide a high water mark without the variance introduced by study participants.", 
        "118": "3.1 Experimental Setup  We use the well-known 20 Newsgroups dataset (20NEWS) used in previous interactive topic modeling work: 18,846 Usenet postings from 20 different newgroups in the early 1990s.1 We remove the newsgroup headers from each message, which contain the newsgroup names, but otherwise left messages intact with any footers or quotes.", 
        "119": "We\n1http://qwone.com/˜jason/20Newsgroups/\nthen remove stopwords and words which appear in fewer than 100 documents or more than 1,500 documents.", 
        "120": "To seed the tandem anchors, we use the titles of newsgroups.", 
        "121": "To build each multiword anchor facet, we split the title on word boundaries and expand any abbreviations or acronyms.", 
        "122": "For example, the newsgroup title ‘comp.os.mswindows.misc’ becomes {“computer”, “operating”, “system”, “microsoft”, “windows”, “miscellaneous”}.", 
        "123": "We do not fully specify the topic; the title gives some intuition, but the topic modeling algorithm must still recover the complete topic-word distributions.", 
        "124": "This is akin to knowing the names of the categories used but nothing else.", 
        "125": "Critically, the topic modeling algorithm has no knowledge of document-label relationships.", 
        "126": "3.2 Experimental Results  Our first evaluation is a classification task to predict documents’ newsgroup membership.", 
        "127": "Thus, we do not aim for state-of-the-art accuracy,2 but the experiment shows title-based tandem anchors yield topics closer to the underlying classes than Gram-Schmidt anchors.", 
        "128": "After randomly splitting the data into test and training sets we learn topics from the test data using both the title-based tandem anchors and the Gram-Schmidt single word anchors.3 For multiword anchors, we use each of the combiner functions from Section 2.2.", 
        "129": "The anchor algorithm only gives the topic-word distributions and not word-level topic assignments, so we infer token-level topic assignments using LDA Latent Dirichlet Allocation (Blei et al., 2003) with fixed topics discovered by the anchor method.", 
        "130": "We use our own implementation of Gibbs sampling with fixed topics and a symmetric documenttopic Dirichlet prior with concentration α = .01.", 
        "131": "Since the topics are fixed, this inference is very fast and can be parallelized on a per-document basis.", 
        "132": "We then train a hinge-loss linear classifier on the newsgroup labels using Vowpal Wabbit4 with topic-word pairs as features.", 
        "133": "Finally, we infer topic assignments in the test data and evaluate the classification using those topic-word features.", 
        "134": "For both training and test, we exclude words outside\n2The best system would incorporate topic features with other features, making it harder to study and understand the topical trends in isolation.", 
        "135": "3With fixed anchors and data the anchor algorithm is deterministic, so we use random splits instead of the standard train/test splits so that we can compute variance.", 
        "136": "4http://hunch.net/˜vw/\nthe LDA vocabulary.", 
        "137": "The topics created from multiword anchor facets are more accurate than Gram-Schmidt topics (Figure 1).", 
        "138": "This is true regardless of the combiner function.", 
        "139": "However, harmonic mean is more accurate than the other functions.5\nSince 20NEWS has twenty classes, accuracy alone does not capture confusion between closely related newsgroups.", 
        "140": "For example, accuracy penalizes a classifier just as much for labeling a document from ‘rec.sport.baseball’ with ‘rec.sport.hockey’ as with ‘alt.atheism’ despite the similarity between sports newsgroups.", 
        "141": "Consequently, after building a confusion matrix between the predicted and true classes, external clustering metrics reveal confusion between classes.", 
        "142": "The first clustering metric is the adjusted Rand index (Yeung and Ruzzo, 2001), which is akin to accuracy for clustering, as it gives the percentage of correct pairing decisions from a reference clustering.", 
        "143": "Adjusted Rand index (ARI) also accounts for chance groupings of documents.", 
        "144": "Next we use F-measure, which also considers pairwise groups, balancing the contribution of false negatives, but without the true negatives.", 
        "145": "Finally, we use variation of information (VI).", 
        "146": "This metric measures the amount of information lost by switching from the gold standard labels to the predicted labels (Meilă, 2003).", 
        "147": "Since we are measuring the amount of information lost, lower variation of information is better.", 
        "148": "Based on these clustering metrics, tandem anchors can yield superior topics to those created using single word anchors (Figure 1).", 
        "149": "As with accuracy, this is true regardless of which combination function we use.", 
        "150": "Furthermore, harmonic mean produces the least confusion between classes.5\nThe final evaluation is topic coherence by Newman et al.", 
        "151": "(2010), which measures whether the topics make sense, and correlates with human judgments of topic quality.", 
        "152": "Given V , the set of the n most probable words of a topic, coherence is\n∑\nv1,v2∈V log\nD(v1, v2) +\nD(v2) (7)\nwhere D(v1, v2) is the co-document frequency of\n5Significant at p < 0.01/4 when using two-tailed t-tests with a Bonferroni correction.", 
        "153": "For each of our evaluations, we verify the normality of our data (D’Agostino and Pearson, 1973) and use two-tailed t-tests with Bonferroni correction to determine whether the differences between the different methods are significant.", 
        "154": "word types v1 and v2, and D(v2) is the document frequency of word type v2.", 
        "155": "A smoothing parameter prevents zero logarithms.", 
        "156": "Figure 1 also shows topic coherence.", 
        "157": "Although title-based anchor facets produce better classification features, topics from Gram-Schmidt anchors have better coherence than title-based anchors with the vector average or the or-operator.", 
        "158": "However, when using the harmonic mean combiner, title-based anchors produce the most human interpretable topics.6\nHarmonic mean beats other combiner functions because it is robust to ambiguous or irrelevant term cooccurrences an anchor facet.", 
        "159": "Both the vector average and the or-operator are swayed by large outliers, making them sensitive to ambiguous terms in an anchor facet.", 
        "160": "Element-wise min also has this robustness, but harmonic mean is also able to better characterize anchor facets as it has more centralizing tendency than the min.", 
        "161": "3.3 Runtime Considerations  Tandem anchors will enable users to direct topic inference to improve topic quality.", 
        "162": "However, for the algorithm to be interactive we must also consider runtime.", 
        "163": "Cook and Thomas (2005) argue that for interactive applications with user-initiated actions like ours the response time should be less than ten seconds.", 
        "164": "Longer waits can increase the cognitive load on the user and harm the user interaction.", 
        "165": "6Significant at p < 0.01/4 when using two-tailed t-tests with a Bonferroni correction.", 
        "166": "For each of our evaluations, we verify the normality of our data (D’Agostino and Pearson, 1973) and use two-tailed t-tests with Bonferroni correction to determine whether the differences between the different methods are significant.", 
        "167": "Fortunately, the runtime of tandem anchors is amenable to interactive topic modeling.", 
        "168": "On 20NEWS, interactive updates take a median time of 2.13 seconds.", 
        "169": "This result was obtained using a single core of an AMD Phemon II X6 1090T processor.", 
        "170": "Furthermore, larger datasets typically have a sublinear increase in distinct word types, so we can expect to see similar run times, even on much larger datasets.", 
        "171": "Compared to other interactive topic modeling algorithms, tandem anchors has a very attractive run time.", 
        "172": "For example, using an optimized version of the sampler for the Interactive Topic Model described by Hu and Boyd-Graber (2012), and the recommended 30 iterations of sampling, the Interactive Topic Model updates with a median time of 24.8 seconds (Hu and Boyd-Graber, 2012), which is well beyond our desired update time for interactive use and an order of magnitude slower than tandem anchors.", 
        "173": "Another promising interactive topic modeling approach is Utopian (Choo et al., 2013), which uses non-negative factorization, albeit without the benefit of anchor words.", 
        "174": "Utopian is much slower than tandem anchors.", 
        "175": "Even on the small InfoVisVAST dataset which contains only 515 documents, Utopian takes 48 seconds to converge.", 
        "176": "While the times are not strictly comparable due to differing datasets, Utopian scales linearly with the size of the data, we can intuit that even for moderately sized datasets such as 20NEWS, Utopian is infeasible for interactive topic modeling due to run time.", 
        "177": "While each of these interactive topic modeling algorithms do achieve reasonable topics, only our algorithm fits the run time requirements for inter-\nactivity.", 
        "178": "Furthermore, since tandem anchors scales with the size of the vocabulary rather than the size of the data, this trend will only become more pronounced as we increase the amount of data.", 
        "179": "4 Interactive Anchor Words  Given high quality anchor facets, the tandem anchor algorithm can produce high quality topic models (particularly when the harmonic mean combiner is used).", 
        "180": "Moreover, the tandem anchor algorithm is fast enough to be interactive (as opposed to model-based approaches such as the Interactive Topic Model).", 
        "181": "We now turn our attention to our main experiment: tandem anchors applied to the problem of interactive topic modeling.", 
        "182": "We compare both single word and tandem anchors in our study.", 
        "183": "We do not include the Interactive Topic Model or Utopian, as their run times are too slow for our users.", 
        "184": "4.1 Interface and User Study  To show that interactive tandem anchor words are fast, effective, and intuitive, we ask users to understand a dataset using the anchor word algorithm.", 
        "185": "For this user study, we recruit twenty participants drawn from a university student body.", 
        "186": "The student median age is twenty-two.", 
        "187": "Seven are female, and thirteen are male.", 
        "188": "None of the students had any prior familiarity with topic modeling or the 20NEWS dataset.", 
        "189": "Each participant sees a simple user interface (Figure 2) with topic given as a row with two columns.", 
        "190": "The left column allows users to view and edit topics’ anchor words; the right column lists the most probable words in each topic.7 The user can remove an anchor word or drag words from\n7While we use topics generated using harmonic mean for our final analysis, users were shown topics generated using the min combiner.", 
        "191": "However, this does not change our result.", 
        "192": "the topic word lists (right column) to become an anchor word.", 
        "193": "Users can also add additional topics by clicking the “Add Anchor” to create additional anchors.", 
        "194": "If the user wants to add a word to a tandem anchor set that does not appear in the interface, they manually type the word (restricted to the model’s vocabulary).", 
        "195": "When the user wants to see the updated topics for their newly refined anchors, they click “Update Topics”.", 
        "196": "We give each a participant a high level overview of topic modeling.", 
        "197": "We also describe common problems with topic models including intruding topic words, duplicate topics, and ambiguous topics.", 
        "198": "Users are instructed to use their best judgement to determine if topics are useful.", 
        "199": "The task is to edit the anchor words to improve the topics.", 
        "200": "We asked that users spend at least twenty minutes, but no more than thirty minutes.", 
        "201": "We repeat the task twice: once with tandem anchors, and once with single word anchors.8  4.2 Quantitative Results  We now validate our main result that for interactive topic modeling, tandem anchors yields better topics than single word anchors.", 
        "202": "Like our titlebased experiments in Section 3, topics generated from users become features to train and test a classifier for the 20NEWS dataset.", 
        "203": "We choose this dataset for easier comparison with the Interactive Topic Modeling result of Hu et al.", 
        "204": "(2014).", 
        "205": "Basedsie on our results with title-based anchors, we use the harmonic mean combiner in our analysis.", 
        "206": "As before, we report not only accuracy, but also multiple clustering metrics using the confusion matrix from the classification task.", 
        "207": "Finally, we report topic coherence.", 
        "208": "Figure 3 summarizes the results of our quantitative evaluation.", 
        "209": "While we only compare user generated anchors in our analysis, we include the unsupervised Gram-Schmidt anchors as a baseline.", 
        "210": "Some of the data violate assumptions of normality.", 
        "211": "Therefore, we use Wilcoxon’s signed-rank test (Wilcoxon, 1945) to determine if the differences between multiword anchors and single word anchors are significant.", 
        "212": "Topics from user generated multiword anchors yield higher classification accuracy (Figure 3).", 
        "213": "Not only is our approach more scalable than the Interactive Topic Model, but we also achieve\n8The order in which users complete these tasks is counterbalanced.", 
        "214": "higher classification accuracy than Hu et al.", 
        "215": "(2014).9 Tandem anchors also improve clustering metrics.10\nWhile user selected tandem anchors produce better classification features than single word anchors, users selected single word anchors produce topics with similar topic coherence scores.11\nTo understand this phenomenon, we use quality metrics (AlSumait et al., 2009) for ranking topics by their correspondence to genuine themes in the data.", 
        "216": "Significant topics are likely skewed towards a few related words, so we measure the distance of each topic-word distribution from the uniform distribution over words.", 
        "217": "Topics which are close to the underlying word distribution of the entire data are likely to be vacuous, so we also measure the distance of each topic-word distribution from the underlying word distribution.", 
        "218": "Finally, background topics are likely to appear in a wide range of documents, while meaningful topics will appear in a smaller subset of the data.", 
        "219": "Figure 4 reports our topic significance findings.", 
        "220": "For all three significance metrics, multiword anchors produce more significant topics than single word anchors.10 Topic coherence is based solely on the top n words of a topic, while both accuracy and topic significance depend on the entire topicword distributions.", 
        "221": "With single word anchors, topics with good coherence may still be too general.", 
        "222": "Tandem anchors enables users to produce topics with more specific word distributions which are better features for classification.", 
        "223": "4.3 Qualitative Results  We examine the qualitative differences between how users select multiword anchor facets versus single word anchors.", 
        "224": "Table 2 gives examples of topics generated using different anchor strategies.", 
        "225": "In a follow-up survey with our users, 75% find it easier to affect individual changes in the topics using tandem anchors compared to single word anchors.", 
        "226": "Users who prefer editing multiword anchors over single word anchors often report that\n9However, the values are not strictly comparable, as Hu et al.", 
        "227": "(2014) use the standard chronological test/train fold, and we use random splits.", 
        "228": "10Significant at p < 0.01 when using Wilcoxon’s signedrank test.", 
        "229": "11The difference between coherence scores was not statistically significant using Wilcoxon’s signed-rank test.", 
        "230": "multiword anchors make it easier to merge similar topics into a single focused topic by combining anchors.", 
        "231": "For example, by combining multiple words related to Christianity, users were able to create a topic which is highly specific, and differentiated from general religion themes which included terms about Atheism and Judaism.", 
        "232": "While users find that use tandem anchors is easier, only 55% of our users say that they prefer the final topics produced by tandem anchors compared to single word anchors.", 
        "233": "This is in harmony with our quantitative measurements of topic coherence, and may be the result of our stopping criteria: when users judged the topics to be useful.", 
        "234": "However, 100% of our users feel that the topics created through interaction were better than those generated from Gram-Schmidt anchors.", 
        "235": "This was true regardless of whether we used tandem anchors or single word anchors.", 
        "236": "Our participants also produce fewer topics when using multiword anchors.", 
        "237": "The mean difference between topics under single word anchors and multiple word anchors is 9.35.", 
        "238": "In follow up interviews, participants indicate that the easiest way to resolve an ambiguous topic with single word anchors was to create a new anchor for each of the ambiguous terms, thus explaining the proliferation of topics for single word anchors.", 
        "239": "In contrast, fixing an ambiguous tandem anchor is simple: users just add more terms to the anchor facet.", 
        "240": "5 Conclusion  Tandem anchors extend the anchor words algorithm to allow multiple words to be combined into anchor facets.", 
        "241": "For interactive topic modeling, using anchor facets in place of single word anchors produces higher quality topic models and are more intuitive to use.", 
        "242": "Furthermore, our approach scales much better than existing interactive topic modeling techniques, allowing interactivity on large\ndatasets for which interactivity was previous impossible.", 
        "243": "Acknowledgements  This work was supported by the collaborative NSF Grant IIS-1409287 (UMD) and IIS- 1409739 (BYU).", 
        "244": "Boyd-Graber is also supported by NSF grants IIS-1320538 and NCSE-1422492."
    }, 
    "document_id": "P17-1083.pdf.json"
}
